

[{"id":1,"page_name":"rules","page_sections":[{"order":"1","content":"<p>The rules are simple and straightforward.&nbsp;You can either follow them or suffer the consequences.<\/p><p>There are two forms of punishment in the game.&nbsp;One is being silenced,&nbsp;and the other is being banned.<\/p><p>A player can be silenced for 10,&nbsp;20 or 30 minutes.&nbsp;If the player is not online,&nbsp;and they will be emailed that they can speak again&nbsp;(assuming they have those settings enabled).<\/p><p>Players can be silenced via&nbsp;<strong>The Creator<\/strong>&nbsp;or through chat throttling&nbsp;(see below).<\/p><p>A player can be banned for 1 day,&nbsp;1 week or&nbsp;“For ever”.&nbsp;A banned player may request to be unbanned via the&nbsp;“banned unfairly?”&nbsp;form that can be accessed via the login screen.&nbsp;However,&nbsp;<strong>they can only make this request if they have been banned forever<\/strong>.<\/p><p>A player will be emailed if they have been banned and when&nbsp;(or if)&nbsp;the ban lifts.&nbsp;You cannot turn these emails off.&nbsp;You will also always be given a reason as to why you were banned.<\/p><p>Once the player fills out the form,&nbsp;any future requests will be ignored by the system.&nbsp;You will receive an email,&nbsp;regarding your request one way or the other.<\/p><p><strong>All decisions are final<\/strong>.<\/p><p>With that out of the way let's go over some rules of Tlessa.<\/p><h2>Core Rules<\/h2><ol><li>There is to be no RMT (Real Money Trade) of any kind in-game. This includes but not limited to: Items, characters, kingdoms, playing your character, managing your kingdoms.<\/li><li>Taking advantage of game bugs, including accessing parts of the game you are not allowed to, and failure to report said bugs can and will get you banned.<\/li><li>Hacking, Cheating, Scripting bots to play for you will also get you banned.<\/li><li>Third party tools of any kind will also get you banned.<\/li><li>Accessing other characters information and not reporting it as a security flaw will get you banned.<\/li><li>No racial slurs or other attacks on anyone for any reason other than playful banter in-game (see Free speech above)<\/li><\/ol><h2>Being Banned and Multiple Accounts<\/h2><p>Tlessa will let you have 10 accounts.&nbsp;<strong>DO NOT ASK FOR MORE<\/strong>.&nbsp;The emails must be unique.&nbsp;This game doesn't really support tunes,&nbsp;as you can't trade between players without using the market board.<\/p><p>Characters may log into multiple accounts,&nbsp;but may only send one request per client to the server at a time.&nbsp;This is called Multi Boxing.<\/p><p>Players may not use scripts or third party tools to manage multiple accounts.<\/p><p>Should one of the 10 characters be banned,&nbsp;even for a day or a week or god forbid,&nbsp;forever&nbsp;-&nbsp;<strong>ALL CHARACTERS<\/strong>&nbsp;will be banned.&nbsp;So if you and your house mate are playing,&nbsp;and they get banned,&nbsp;you just lost your account.<\/p><p>You can still do the&nbsp;\"banned unfairly\"&nbsp;request and I,&nbsp;The Creator will review the request.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Chat<\/h2><p>Since chat is a part of the game,&nbsp;The Creator,&nbsp;will never moderate chat unless it is in the best interest of the community.<\/p><p>Chat messages,&nbsp;including private messages are all logged,&nbsp;unencrypted and can be seen at any time&nbsp;(going back 90 days).&nbsp;Should the need arise The Creator can and will step in to deal the appropriate punishment.<\/p><p>Racial slurs,&nbsp;attacks on other people for any reason including but&nbsp;<strong>not limited to<\/strong>:&nbsp;Sexual Identity\/Preference,&nbsp;Racial Heritage,&nbsp;Age,&nbsp;Sex,&nbsp;Religious Affiliation or Disability.&nbsp;Will not be tolerated and will result in the appropriate punishment.<\/p><p><strong>Do not post your personal information in chat<\/strong>.&nbsp;This includes but&nbsp;<strong>not limited to<\/strong>:&nbsp;Email,&nbsp;address,&nbsp;real name,&nbsp;phone number,&nbsp;credit card or any other identifiable information about you.<\/p><p>With that said your location in-game is shown in chat as X,Y coordinates.<\/p><p>Last but not least,&nbsp;no auction in chat.&nbsp;If you want to sell something go to the&nbsp;<a href=\"about:blank\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(10, 114, 133);\">market board<\/a>.&nbsp;Failure to head this rule can result in being silenced and then,&nbsp;for repeat offenders,&nbsp;banned.<\/p><h2>Chat Throttling<\/h2><p>A player may only send 25 messages every 1 minutes.&nbsp;Failure to heed this,&nbsp;and the system will auto silence you for 5 minutes.&nbsp;If you are not logged in when you can speak again,&nbsp;and have the email settings enabled,&nbsp;you will be emailed when you can speak again.<\/p><h2>\"Free\" Speech<\/h2><p>Just because chat is self moderated for the most part,&nbsp;does not mean The Creator will allow for hate speech,&nbsp;racism or wild conspiracies or the posting of&nbsp;\"fake news\".&nbsp;These are bannable offenses and will result in a silence,&nbsp;followed by an appropriate ban for repeatable offenses.<\/p><p>The Creator suggests,&nbsp;you leave religion and politics out of the general chat discussion.&nbsp;While I will not go and silence or ban someone for talking about current world events,&nbsp;if things do get out of hand appropriate measures will be taken.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<h2>Character Names<\/h2><ol><li>Character names may not have special characters in them (including emojis or asci characters).<\/li><li>Character names may not have spaces<\/li><li>Character names must be between 5 and 15 characters long.<\/li><li>Character names may only container letters of any case and numbers.<\/li><\/ol><p>If a character name is deemed to be offensive,&nbsp;that is it contains a racial slur or some other offensive slur,&nbsp;<strong>The Creator<\/strong>&nbsp;can and will initiate a forced name change.<\/p><p>Any attempt to circumvent changing your name including scripts,&nbsp;third party tools or hacks will get your account banned forever.<\/p><p>Once this popup shows up,&nbsp;even if you log out and back in or refresh the page,&nbsp;this popup will stay.<\/p>","content_image_path":"rules\/Y3jPo64QwHOSeS8kT5bdRhzMREXitCB4QxOZT37r.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":2,"page_name":"home","page_sections":[{"order":"1","content":"<p>Welcome to Tlessa, a full-fledged, completely free, no cash shops, no pay to win PBBG that allows you to level, gear, craft, enchant, settle kingdoms and so much more.<\/p><p>The store of Tlessa is simple: The Creator has escaped from Purgatory, follow a series of Quests starting on surface to learn more about the NPC’s and the Creator himself. Help to answer questions, unravel the mystery of how and why The Creator escaped from Purgatory.<\/p><p>Tlessa has a lot of systems and a lot to do, most of which is gated behind quests. As a result, the game can be a bit confusing to figure out. As a result, players who signup can enable The Guide, who’s is a quest giver to help guide you through your first thousand levels.<\/p><p>That’s right, there are well over a thousand levels, but unlock additional character levels, you must complete quests, level your character, earn currencies and progress through the world. Are you ready?<\/p><h2>&nbsp;Key Features<\/h2><ul><li>Market board where players can list and buy enchanted gear<\/li><li>Scaling drops (as you level, so do the drops you get from monsters to an extent and utilizing RNG)<\/li><li>6 Planes of existence to explore and fight monsters on.<\/li><li>&nbsp;Automation for fighting called Exploration.<\/li><li>Crafting\/Enchanting\/Alchemy\/Trinketry to gear and push your stats further.<\/li><li>Queen of Hearts and Unique items<\/li><li>&nbsp;Faction Farming<\/li><li>Well over 60+ Quests<\/li><li>&nbsp;Hours, months, day and weeks of content.<\/li><\/ul><p>Players are not gated behind energy systems, instead we use Timers to slow you down. Some timers lock you out of specific features, such as exploration. Others can be hidden away, such as Kingdom management.<\/p><p>You can play for an hour, three or ever … You can play for ever. Questions?<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":3,"page_name":"exploration","page_sections":[{"order":"1","content":"<p>Tlessa offers players a way to take the monotony out of clicking Attack repeatedly for enemies.<\/p><p>Players can engage in what’s called Exploration.<\/p><p>Exploration allows players automate the attacking process and still engage with the game to move, manage their kingdoms as well as craft.<\/p><p>It does limit players from being able to use items on themselves, cancel boons, equip other gear or manage their skills be they trainable or passive. You cannot enter special locations, paricipate in hunting or fighting celestials. You cannot hand in Quests or Guide Quests while automation is running.<\/p><p>While you are exploring you will go through two phases. One is fight with you and the creature you selected one and one and then another with between one to seven of the same creatures, each fight happens back-to-back.<\/p><p>Should you die during exploration, you will be told and can click the exploration button to see the output the battle, assuming you are logged in. The beauty of Exploration is you can log out and it will run for the set length of time.<\/p><p>Items, xp, skill xp, gold and other currencies are given to you automatically.<\/p><p>Quest items from special locations will NOT drop while exploration is running, other quest items will though.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<p>How to get started with exploration<\/p><p>First, click the exploration button. If this is colored in, it is disabled because you are dead.<\/p><p>Next select a creature, a length of time and the attack type. Optionally you can select wether to automatically move down the monster list every X levels. New players are suggested to set this to 20, then 10 then 5 as their gear progresses.<\/p><p>What this means is every X levels, move one down the list. This repeats for the duration till the timer runs out, you die or the monster list is exhausted. In that case we fight the final creature, over and over again.<\/p><p>If you have auto disenchant turned on, all drops will follow your disenchanting pretences.<\/p><p>Once satisfied click the explore button.<\/p>","content_image_path":"exploration\/1MOZesNMtFa7lVzxorQkWj7in5YtzMWDwmti7OMs.png","live_wire_component":"null"},{"order":3,"content":"<p>You can see the timer under the map. You can still move around the map, the two timers will just sit side by side.<\/p>","content_image_path":"exploration\/6RJlUywX1oWtPwz7BAZ8x0nnpKzBHLnZzxzMzbh2.png","live_wire_component":"null"},{"order":4,"content":"<p>Exploration gets players a few things:<\/p><ul><li>Drops (if auto disenchanting is off)<\/li><li>Gold<\/li><li>Gold Dust if you are auto disenchanting<\/li><li>XP<\/li><li>Skill XP (if training)<\/li><li>Certain Quest items<\/li><\/ul><p>Players also receive what’s called <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">Faction points<\/a>. As players earn these points and gain specific milestones, they will get what’s called unique items (basic at first till you get access to Hell).<\/p><p>These can give you a leg up in Battle and can be sold on the market board.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":5,"content":"<p>When in exploration check the Exploration tab beside Server Messages, in the chat section.<\/p><p>Every 5 minutes you will do an encounter, as described above. At the end of the time you selected you will also be rewarded with 10,000 gold, regardless of time selected.<\/p>","content_image_path":"exploration\/rzNrgOklPlEk58UjhRY0C5tI1Pls27BOaiOFZGVV.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":4,"page_name":"races-and-classes","page_sections":[{"order":"1","content":"<p>In Tlessa there are a few Races and classes you can choose from. You are free to pick whatever Race and Class you want to play as, however if you are a min\/maxer, you might be interested I the below information.<\/p><p>When it comes to picking a race, you want one that will complement the class you plan to play as. All classes have their own play style, suggested attacks, and gear. All classes also have special attacks, based off their class skill and equipment requirements.<\/p><p>When picking a race\/class combo look for one who’s stats align to either double or come close to doubling the racial or class stat, specifically for “to hit” and “damage”.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<h2>Races of Tlessa.<\/h2><p>Below are a series of races you can choose from. You can click each one to see the stats with the inclusion of Skill modifiers and defence modifiers.<\/p><p>Some classes and Races play nice together when giving bonuses to skills, such as Accuracy, Dodge or Looting. These are your three primary skills, with Accuracy being most important and (to a lesser degree) Casting Accuracy, which no race or class gives bonus too. This skill is intended for Casters using Damage spells.<\/p><p>As a new player, if you want optimization, go for a race that gives the highest accuracy.<\/p>","content_image_path":null,"live_wire_component":"admin.races.races-table"},{"order":3,"content":"<h2>Classes of Tlessa<\/h2><p>Below are a series of classes to choose from. Some use two handed weapons such as Hammers, Bows, Staves, while other can wield any weapon. All classes have a hints, tips and tricks section that essentially tells you the most optimal way to play your class.<\/p><p>Again, feel free to experiment.<\/p><p>Much like Races, classes effect your stats and your skills, Dodge, Looting and Accuracy as well as your defence Modifier or Armour Class.<\/p><p>All classes have a To Hit and a Damage Stat. To Hit means the stat we use in conjunction with Accuracy to see if you can hit. Damage is used as your primary damage stat, added to your weapons and so on. These two stats are vital for you to raise via gear, which all gear will raise these stats to some degree.<\/p>","content_image_path":null,"live_wire_component":"admin.classes.classes-table"},{"order":4,"content":"<h2>Regarding Class Bonuses<\/h2><p>Each class has a special attack, even the one you selected. This fire based off a few factors: Do you have the appropriate items equipped and is your chance high enough.<\/p><p>You can see your class bonus on the character sheet under the inventory information section, see the relevant screen shot to the side or below if on mobile.<\/p><p>These will fire automatically on your turn when attacking. There is only one way to increase this chance: Gear. Specifically, enchantments. If you follow the enchantments link and filter the enchantments table by class bonus, then you get all the enchantments that effect the class bonus.<\/p><p>The higher this bonus the more chance for these special attacks to fire, which can help take down harder creatures.<\/p><p>Click your class above, to read more about their special attacks and for tips and tricks.<\/p><p>Gear with enchantments that increase the class bonus do not stack. Instead we take the best one.<\/p>","content_image_path":"races-and-classes\/L9jyYgDIYaorxBoRcUjoKcOyZJ9iHMSkyJLH4Lo7.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":5,"page_name":"voidance","page_sections":[{"order":"1","content":"<p>Tlessa has a concept that becomes more apparent later, it’s called Voidance and Devoidance. In game we call this Devouring Light (Voidance) and Devouring Darkness (Devoidance).<\/p><p>Enemies in special locations, starting on surface, have small amount of these stats. The further down the plane list you go, into Purgatory, the higher these values on enemies become.<\/p><p>There are various quests to do which grant items that increase both stats.<\/p><p>Holy Items also increases these stats later when you have access to the Purgatory Smiths Work Bench.<\/p><p>These will fire automatically, after you click attack and before you click the attack button. This is what’s called pre battle effect’s<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>How do this work?<\/h2><p>Once you start getting further along in the game, you will run into creatures that void you. This means your fancy equipment that boosts all your stats, becomes useless. None of your enchantments will fire, you will use base stats for everything.<\/p><p><strong>Note<\/strong>: If you are voided, your rings and affixes will not fire. However, your secondary ring effects will still fire on the enemies turn. This includes spell evasion and healing reduction (to the enemy)<\/p><p>This can be mitigated by you having Devouring Darkness (Devoidance) which will stop the enemy from being able to void you.<\/p><p>Some enemies also have Devouring Darkness which prevents you from voiding them. This is where resistance enchantments come in.<\/p><p>Voidance and Devoidance last the entire battle.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<h2>What about PVP?<\/h2><p>In pvp, resistance enchantments are also needed to reduce the other players Devouring Light and Darkness Resistance.<\/p><p>Monsters and celestials do not have resistances to devouring light or darkness, but players do. If you can reduce their voidance\/Devoidance, you can have a chance to ne shot kill them.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":6,"page_name":"settings","page_sections":[{"order":"1","content":"<p>The Settings page can be accessed by tapping or hovering over the circular user icon at the top right. From here you can tap\/click on settings to see the page to the right (bottom, for mobile).<\/p><p>This page lets you:<\/p><ul><li>Delete your account<\/li><li>Reset your Character<\/li><li>Enable or Disable Chat\/Email Settings<\/li><li>Enable and Manage Auto Disenchant Settings<\/li><li>Enable The Guide (if under level 10)<\/li><li>Change your character name.<\/li><\/ul><p>When it comes to deleting your account, we will wipe your entire account -email and password and send you a final confirmation email.<\/p><p>When it comes to resetting your account, we delete your character and all that is associated, but not the user account. We will re-roll you a fresh character based on your chosen race and class, or you can keep your race and class and just re-roll to start over.<\/p><p>When it comes to changing your name, you are free to name your self what ever. If the community or The Creator deem it inappropriate you will be greeted with a \"force name\" change modal that cannot be dismissed.<\/p><p>Finally, the guide cannot be enabled for characters over level 10 as he is meant to help new players. Characters can re-roll and enable him. You cannot turn him off. You will see a green Guide Quest button at the top of the screen.<\/p><p>Clicking this will open your first quest, Guide quests have a bit of story, requirements, and instructions.<\/p>","content_image_path":"settings\/B04wTWMhFSKY2IjEm1sxxdtDMNEsNM0wZgXuZEIu.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":7,"page_name":"monsters","page_sections":[{"order":"1","content":"<p>The primary thing you do in Tlessa is kill monsters. This can be done through manual fighting or exploration.<\/p><p>Either way monsters play a big part of your progression, the primary driving force to keep you going.<\/p><p>Monsters drop random gear that scales with your character level to a point per plane and only ever to max of level 300 crafting\/enchanting. This means players still have to craft and enchant to get the top gear.<\/p><p>Below is a list of monsters. You can filter by plane.<\/p>","content_image_path":null,"live_wire_component":"admin.monsters.monsters-table"},{"order":2,"content":"<p>There are places in the world of Tlessa, such as special locations and Planes below Dungeons such as Shadow Plane, Hell, and Purgatory where monsters’ stats get higher than what’s listed here.<\/p><p>The stats above are base line, as if they were all on surface. Special locations on each plane can raise the enemy strength, while planes do the same but also weaken your character.<\/p><p>Gear is your only way forward. Whether you find it, buy it or eventually are forced to craft and enchant it.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":3,"content":"<h2>Regarding Celestials<\/h2><p>As you have seen in the list above, there are Celestials for each plane as well, most of the planes anyhow.<\/p><p>These creatures can be Conjured via the conjure button on the map, or in the drop down of actions for mobile players.<\/p><p>These creatures, most of them, will spawn every Wednesday at 1pm GMT-6 for 24 hours. They have, on this day, an 80% chance to spawn by you just moving around.<\/p><p>Killing them gets you rewards such as items, quest items, gold and a currency called: Crystal Shards which is used in Alchemy.<\/p><p>You can learn more about celestials, including how to conjure, <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">here<\/a>.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:12.000000Z","updated_at":"2023-08-08T18:45:12.000000Z"},{"id":8,"page_name":"celestials","page_sections":[{"order":"1","content":"<p>When it comes to stronger creatures in the game, Celestials are the creatures you want. They are not cheap to conjure and exist per plane. See the monster’s section and filter by Plane Name Celestials, where the Plane Name is the one you want.<\/p><p>Celestials have stronger stats then top end creatures and require good gear to take down. A level 1 character will die a horrible death. But a level 100 character who has been investing in enchanting and crafting may have a chance at some of the Surface Celestials.<\/p><p>Celestials can be conjured by clicking the <strong>Conjure <\/strong>(beside teleport) button (see image to the left or bottom for mobile).<\/p><p>You need two <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Currencies<\/a>: Gold and Gold Dust.<\/p><p>Gold, you get from killing, exploration, selling your enchanted items to the shop or the market.<\/p><p>Gold Dust you get from <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">disenchanting<\/a> enchanted items and the daily Gold Dust Lottery at 12 pm Noon GMT-6 for a chance to get 10k gold dust.<\/p><p>Once you have these and decent gear you can click conjure to begin the process.<\/p>","content_image_path":"celestials\/h3N6368j54rlQJrNaShMMu89UrrsvjGZJYZdjArc.png","live_wire_component":"null"},{"order":2,"content":"<p>From here you can see the conjuration window will popup and let you select a Celestial for that plane to conjure. This can be private or public.<\/p><ul><li>Public means every one will see the location of the creature you spawned, meaning any one can come and kill it before you have a chance too.<\/li><li>Private means the global message still goes out but you, and only you, get the location of the creature.<\/li><\/ul><p>Celestials are a first come first serve to get the treasure they drop. If you fail to kill one, in one hit, it will flee and tell people where it went to, even it was a private conjuration.<\/p>","content_image_path":"celestials\/mAmHDR6ovNwarBSeLpKFoRuRm8J0jdYhRTdMUiEi.png","live_wire_component":"null"},{"order":3,"content":"<p>When you come upon the Celestials location, again you will be told via the Server Message tab down by the chat, or in the chat as a global message, you will see a new button appear.<\/p><p>Click this to begin the attack. From here its about selecting which attack and clicking it. This is a server side fight, so it can take a second to process the fight.<\/p><p><strong>For mobile players<\/strong> when you come to the location of the Celestial, your actions drop down will update with a option called Fight Celestial, select this to engage with the celestial.<\/p>","content_image_path":"celestials\/YhN5MfPLfGW7atf0iRQKzUDZdvQ19kqtVHBc4fmw.png","live_wire_component":"null"},{"order":4,"content":"<p>You can see here, after clicking Fight Celestial, that the fight is very similar to how you fight monsters. With the exception that the fight is done server side.<\/p><p>See image to the right or bottom for mobile players.<\/p><p>Celestials can be conjured privately and thus you can use the \/pct command to move instantly to the celestial at no gold cost but with a Movement Timeout.<\/p><p>After killing the Celestial, the chat section is updated with a global message for all to see, your Server tab will also update with any rewards.<\/p><p>Celestials are first come, first serve. Fail to kill one and it will flee.<\/p><p>On Wednesdays at 1pm GMT-6, There is a global message that goes out alerting everyone that the gates have swung open, and the Celestials will start spawning much easier. This means that with every movement, there is an 80% chance on this day for 24 hours, for these entities to spawn, across all planes accept Purgatory.<\/p>","content_image_path":"celestials\/LvajupDRkMr4Ypjytr70PxCSBS7m2agP9fYV1Qi4.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":9,"page_name":"quest-items","page_sections":[{"order":"1","content":"<p>Tlessa has a series of <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a> that progress the player through the world and unlock new features over time. There are a series of quest items that go along with these quests, some effect your character, some are just for handing in.<\/p><p>You can get these items from:<\/p><ul><li>Celestials<\/li><li>Monsters<\/li><li>Special Locations<\/li><li>Other quests as rewards<\/li><\/ul><p>Below you can see a list of quest items the game offers. All of which are obtainable by just playing the game.<\/p>","content_image_path":null,"live_wire_component":"info.quest-items.quest-items-table"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":10,"page_name":"enchanting","page_sections":[{"order":"1","content":"<p>Enchanting is one of Tlessa’s primary and most important ways to progress your gear.<\/p><p>There are a ton of enchantments, and the table below will let you filter by various types of enchantments. These are also known as, Affixes.<\/p><p>There are two types of enchantments: Prefix and Suffix.<\/p><p>Items from monsters can drop with magical enchantments on them. These will scale with the players level and get higher and better as you progress down to Purgatory. However, they are all random enchantments on random items.<\/p><p>For example, in Purgatory you can get level 300 crafting gear with level 300 enchantments on them. However, because of RNG, it's between level 1 and 300.<\/p><p>Enchanting also gets very expensive quickly, therefore players also want to disenchant the enchanted items they make through enchanting to not only get <a href=\"information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a>, but also level enchanting it’s self at half the rate.<\/p><p><strong>Tip for new players:<\/strong> craft yourself a set of enchanting gear, enchant a series of items, disenchant them. Through this process you will level enchanting very quickly.<\/p><p>The last thing to know about enchanting is that it requires intelligence. The most expensive enchant requires 1000 int to craft, if you have no gear on and are less than level 1000 the enchantments will not show for you in the list.<\/p><p>We fetch the enchants you can create based on your skill level and your intelligence. If you are not a heretic or other class where int is your primary damage (this means it gets 2 points per level) and are less then level 500, you will need to craft gear that raises your int, so you can enchant higher level and int required items.<\/p><p><strong>Note:<\/strong> There is not enchantments for Alchemy or Quick Feet Skill. Instead, For Quick Feet, Use <strong>Move Timeout Modifiers<\/strong><\/p>","content_image_path":null,"live_wire_component":"admin.affixes.affixes-table"},{"order":2,"content":"<p>Just like with Crafting you can also fight monsters while crafting, see the image to the right or bottom for mobile.<\/p><p>To get here all you have to do is select Enchant from the blue Craft\/Enchant drop down.<\/p><p>For mobile, select Craft from the actions drop down, then select enchant from the blue drop down. From here the steps are the same on mobile and pc.<\/p><p>As you can see there are three selects, Select the Item, Prefix and\/or Suffix.<\/p><p>At first you will have limited Enchants, but as you enchant more gear, find better gear, and raise your enchanting level and intelligence, you will unlock more powerful and expensive enchants that turn the tide of battle.<\/p>","content_image_path":"enchanting\/Ms857h6FYhYFd0PxSkwPdvyt1XZ4rQhe1tDHP4HR.png","live_wire_component":"null"},{"order":3,"content":"<p>You can enchant any item that appears in your list, the items must live in your inventory. We will not be looking through sets for items to enchant.<\/p><p>If you enchant an item that has two enchantments (see image to the right or bottom for mobile) it will take 30 seconds, because we replace the enchants. If you enchant an item that has no enchants, its 10 seconds.<\/p><p>The cost does not increase for replacing enchantments with other enchantments.<\/p><p>There is no way to move enchantments unless you have unique items, then you can use the Queen of Hearts in Hell to move Unique and Mythic Enchants to other items. This is more end game though.<\/p><p>You will fail more than succeed at first, and it will cost you a pretty penny, but again, sort the enchanting list above by enchants that would help you achieve whatever goal it is you are attempting to achieve. Want to hit better, enchant with accuracy, want to cast damage spells better, use casting accuracy and int enchants to do even more damage.<\/p><p>Enchantments are how you build your character.<\/p>","content_image_path":"enchanting\/WeKJQlapxZKWJWOSb34wC3ejm1OiFppsCvtruP4d.png","live_wire_component":"null"},{"order":4,"content":"<h2>Final Thoughts<\/h2><p>When enchanting you have the option to enchant with two enchantments at the same time. This can, for success of both, give you twice the XP. However, if one applies, but the other fails, you will only get XP for the one that applied – even if the item was destroyed because of the other failing to apply.<\/p><p>Another thing to consider is the timer. If you enchant with one or two, it’s a 10 second timeout.<\/p><p>If you are replacing one enchantment on an already enchanted item, it’s a 20 second timeout.<\/p><p>If you are replacing both enchantments on an already enchanted item, it’s a 30 second timeout.<\/p><p>Enchanting with two enchants at the same time can be expensive at first but can level your enchanting skill faster.<\/p><p>There can be times when you find your self enchanting with one type of enchantment, for example: Prefixes only to find<\/p><p>that the enchantment is too easy to craft.<\/p><p>You will also have one type, be it suffix or prefix that is not too easy. As it stands there are more prefixes than<\/p><p>there are suffixes to apply to your gear. If this is the case, it is not a case of \"there's a level gap\" it is a case of \"switch to the other enchantment type\"<\/p><p>and continue on.<\/p><p>As it stands, the way enchanting levels, you will most likely get a new enchanting skill or set of every few levels. Roughly 1-2 or 1-3 levels<\/p><p>of either or both types.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":11,"page_name":"gear-progression","page_sections":[{"order":1,"content":"<p>Gear progression in Planes of Tlessa is very linear and very easy to follow. There are a few systems that play into character progression, which easily equates to Damage, Damage and more Damage, but most importantly is Your Weapon and Your Body – Gear.<\/p><p>Gear can be obtained a few different ways.<\/p><p>You can <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">craft<\/a> it, you can find it as drops off enemies – which at first will be easy until you reach level 12 and we rely solely on your looting skill.<\/p><p>You can Purchase gear from the <a href=\"\/information\/shop\" rel=\"noopener noreferrer\" target=\"_blank\">shop<\/a>, how ever eventually you will our craft the shop.<\/p><p>You can upgrade it for more powerful gear.<\/p><p>You can <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchant<\/a> it.<\/p><p>Gear, at its core – raises your stats by a % that, together with all the things you equipped, will raise your stats. The higher the stats, the more health, the more damage, the more death!<\/p><p>So how linear? Lets discuss:<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<h2><strong>Basics<\/strong><\/h2><p>You will start with some drops, enchanted gear – that’s all that drops, but the gear you find will be level 1 – Your Current level, <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">Crafting<\/a> gear.<\/p><p>Crafting level simply means the level your Weapon, Armour, Ring, Spell Crafting level has to be to craft it.<\/p><p>For example, if you are level 6, you have a chance to get a level 6 weapon with a level enchant on it, making it better – potentially – hen what you have on.<\/p><p>The basics will take you until you have a set of gear, where each piece costs you Two Billion gold. That’s as high as the shop will go.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":3,"content":"<h2>Tier 2 – Uniques<\/h2><p>Players who play the game and kill enough creatures will incur what’s called Faction Points which in turn reward the player with a unique item every time they reach a new Faction level, which means you could get 25 of these.<\/p><p>Players who get them through Factions only get the entry level uniques. These can be attached to any item and can have one or two enchants. Players can only equip one.<\/p><p>The goal of Tier 2 is to get to Hell, engage with the Queen of Hearts and Purchase the 100 billion Gold Uniques. Which are the best enchantments in game minus Mythics.<\/p><p>You can then Re-roll and move these enchants to another piece of gear.<\/p><p>Tier 2 ends when you have, for example Top Tier Crafted Body with a Decent set of Unique Enchants that cost 100 billion on the item.<\/p>","content_image_path":null,"live_wire_component":null},{"order":4,"content":"<h2><a href=\"\/information\/hell-forged-set\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Hell Forged<\/strong><\/a><\/h2><p>Once you have access to the Hell <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Plane<\/a>, you will be able to purchase your self better Unique’s from the Queen of Hearts as well as the new set of gear which, as base stats will be better then Crafted Gear, with no enchants.<\/p><p>This is why players will, as part of the cost, trade in a piece of their max crafted item (level 400), to get a piece of Hell Forged gear of the same type. Ie, trade in your current equipped Body, get the exact same one back, but now as Hell Forged.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":5,"content":"<h2><a href=\"\/information\/purgatory-chains-set\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Purgatory Chain<\/strong><\/a><\/h2><p>Once you have a full set of Hell Forged, you will want to then upgrade it further, by doing the same steps, but in Purgatory and for Purgatory Chain Gear. Instead of Max level crafted item for trade, it will be your current Hell Forged gear as cost. Your enchants will be moved over to the new gear.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":6,"content":"<h2><a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Holy Oils<\/strong><\/a><\/h2><p>Next you’ll want to spend some time leveling <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a>, which you can unlock through doing a <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">Quest<\/a>.<\/p><p>Alchemy lets you craft usable items called Oils. You will craft many of these as each of your items can have 20 Hoily Oils Applied as a Holy Stack.<\/p><p>These increase the power on your items and your stats. This will cost a pretty penny and take a while to complete.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":7,"content":"<h2><a href=\"\/information\/pirate-lord-leather-set\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Pirate Lord Leather<\/strong><\/a><\/h2><p>This is the next set of gear after Purgatory Chains, but can only be obtained by being in the top 10 of damage dealers to a raid boss during the raid: The Smugglers Are Back!<\/p><p>This gear, with raw stats is better then Purgatory Chains.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":8,"content":"<h2><strong>Other Considerations for gear<\/strong><\/h2><p>There are a couple other aspects you will unlock over time by completing various quests to unlock new features and new ways to progress your character.<\/p><p>These aspects include:<\/p><p>- Trinkets<\/p><p>- Mythical Items<\/p><p>- Ancestral Items<\/p><p>- Gems and and Sockets<\/p><p>These take time and depend on various factors, but can be obtained over time. Lets go over a few of<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":9,"content":"<h2><a href=\"\/information\/trinketry\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Trinkets<\/strong><\/a><\/h2><p>Trinkets can be crafted at any time in which you have the required currency to craft them. These help you with creatures in Purgatory who can ambush and Counter your attacks. With the higher level trinkets, you can get the jump on creatures and other players in PVP, with your own ambush and counter chance.<\/p><p>These are vital to survive in Purgatory.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":10,"content":"<h2><a href=\"\/information\/mythical-items\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Mythical Items<\/strong><\/a><\/h2><p>Mythical items can be found in a few ways:<\/p><p>- <a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\">Monthly PVP<\/a> as a chance to drop when competing in the tournament or as a guaranteed drop when you win the monthly tournament.<\/p><p>- After Monthly PVP the Celestial Kings will drop if you kill one you have a chance to get one.<\/p><p>- Purgatory Dungeons in Purgatory has a chance to drop them.<\/p><p>Mythical items are like unique items, however the enchantments are randomly rolled are much higher and better then unique items.<\/p><p>They have the same restrictions as unique items, where you can only have one equipped and one in a set.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":11,"content":"<h2><a href=\"\/information\/ancestral-items\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>Ancestral Items<\/strong><\/a><\/h2><p>These items are immensely powerful and are specific to each of the classes in Planes of Tlessa. Since characters can switch classes at any time through the Class Ranks system, characters can get one of each.<\/p><p>Players can only have one in a set and can only equip one.<\/p><p>These items also come with Item Skills that give you even more stats as you level them and unlock new ones to level for even more damage.<\/p><p>Only the player who kills the <a href=\"\/information\/raids\" rel=\"noopener noreferrer\" target=\"_blank\">raid<\/a> boss is rewarded with one of these. There is no other way to get one.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-12T03:17:55.000000Z"},{"id":12,"page_name":"the-guide","page_sections":[{"order":"1","content":"<p>The Guide is designed to help new players learn the ropes of the game. We give you explicit instructions on how to complete the quest, as well as some story. Each quest is designed to introduce you to various features, from killing and shops, skills, crafting, enchanting and so on.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Accessing The Guide<\/h2><p>When you register you have an option to enable the guide. If you did not do this, you can head to your settings and enable the guide from there, assuming you’re under level 10.<\/p><p>If you enabled during registration, you will see a popup once the game loads, we only show you this popup once. You can access the guide quests by clicking Guide Quests in the top nav. See image to the right or below for mobile.<\/p>","content_image_path":"the-guide\/W87AY0LcYGu6kUTVDhOIF4CGNmp84h1Arc78mjaf.png","live_wire_component":null},{"order":3,"content":"<h2>Viewing the past<\/h2><p>You can view previously complete Guide quests by opening your side bar (hamburger menu at the top left beside the game name).<\/p><p>Here, in the image to the right or bottom for mobile, is an additional option under quests called Completed Guide Quests. Clicking this shows you a table of your quests. You can further click on the quest name to see the story, instructions, and requirements.<\/p><p>The instructions might be useful if you need a refresher.<\/p>","content_image_path":"the-guide\/XEwMMIBsDM6uTLp5UKs01JeCJLLhpFCbdHT2u7jw.png","live_wire_component":null},{"order":4,"content":"<h2>Completing the quests<\/h2><p>When you open this modal, see to the right or bottom for mobile, you are shown the requirements in orange at the top, story under that and a tab called instructions which contains the quests instructions spelled out for you.<\/p><p>The hand in button will only be available once you have met the requirements of the quest.<\/p>","content_image_path":"the-guide\/QkwMKKs8D0rNEkmkP7whp0jfFgLHGB8HhzF0xzlV.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":13,"page_name":"automation","page_sections":[{"order":"1","content":"<p>Automation<\/p><p>Automation in Tlessa comes in a couple forms:<\/p><ul><li><a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a><\/li><li>Pvp Monthly Automation<\/li><\/ul><p>When characters are in either form of automation, they cannot manage their inventory such as equipping items or sets. They cannot manage their skills or passives.<\/p><p>You can read more about exploration and how to engage with that here. Players will find as they are leveling skills, exploration will become essential.<\/p><p>Because of how loot works, in the sense that it is completely random and levels with your character to a point per plane – exploration is one of the best ways to get loot aside from manually fighting.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<p><strong>Pvp Automation<\/strong> however is slightly different. Those who choose to participate in <a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\">monthly pvp event<\/a>, will find themselves, after they are automatically moved to the arena, locked out not just being able to attack, but also move.<\/p><p><a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a> does not stop you from moving, you just cannot traverse or wage war or settle new kingdoms.<\/p><p>Pvp Automation does prevent you from moving.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":14,"page_name":"disenchanting","page_sections":[{"order":"1","content":"<p>Disenchanting can be done in a verity of ways and will level your enchanting skill by half per successful disenchant.<\/p><p>Disenchanting also gets you a currency: Gold Dust, which is used in a verity of aspects from conjuring celestials to quests, gear upgrades and more.<\/p><p>Disenchanting can be done from the Item Comparison window when an item drops from a monster, the character sheet tab in the inventory, or through a setting on the character settings page to auto disenchant drops.<\/p><p>New players are not encouraged to enable auto disenchant until they get off Surface.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>How to disenchant.<\/h2><p>For this example, we are going to go through the character sheet, inventory section. For mobile players, click the character sheet tab, select Inventory Management from the drop down to follow along.<\/p><p>As you can see (to the right or bottom for mobile) I have some enchanted items. If you are unfamiliar with enchanting, check out the enchanting docs.<\/p>","content_image_path":"disenchanting\/euyUUrVoK0s2jnWQnwjDHB6iOP204fWwICnPqFLe.png","live_wire_component":null},{"order":3,"content":"<p>Or I can do this by disenchanting all the enchanted items. Careful, if you have unique items, move them first to a set to “stash them”. You can also read about Inventory Management and Set Management.<\/p>","content_image_path":"disenchanting\/N956OaSuxs5o3tVGj9qrv3gKJxUAqftcCiJZHSoO.png","live_wire_component":null},{"order":4,"content":"<p>I can do this one by one, by clicking on the item name itself in the table.<\/p>","content_image_path":"disenchanting\/Upf8xhEy5UMtJKveXibxw2gTRTowHFUX5wXeTyz3.png","live_wire_component":null},{"order":5,"content":"<p>In this case I chose to disenchant all the items, now you can see in the Server Message Tab that not only did I fail, I also disenchanted some items and even gained a skill level in enchanting, plus – to top it all off - managed to get some Gold Dust!<\/p>","content_image_path":"disenchanting\/cYgXT3oiF9tVxCxTEekrYVjTj2Y6Iq8Q4XLOBR2v.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":15,"page_name":"currencies","page_sections":[{"order":"1","content":"<p>There are a couple of currencies that you can get in Tlessa, all of them are listed in your top section on the game tab.<\/p><p>You can see the image to the right, bottom for mobile. For mobile players you will need to expand your top section to see the same details.<\/p><p>As you can see, we have:<\/p><ul><li>Gold (You can have a max of 2 Trillion)<\/li><li>&nbsp;Gold Dust (You can have a max of 2 Billion)<\/li><li>&nbsp;Crystal Shards (You can have a max of 2 Billion)<\/li><li>Copper Coins (You can have a max of 1 Million)<\/li><\/ul><p><strong>Gold<\/strong>, you earn through killing creatures. This is easy to get. Kingdoms can hold more gold through the treasury, which is capped at 2 Billion or the Goblin Coin Bank, which allows you to purchase 1000 Gold Bars for 2 Billion Gold Each.<\/p><p><strong>Gold Dust,<\/strong> you get through <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Disenchanting<\/a> items, this also helps to level <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a>. Gold dust is used in <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> to create items as well as with the Queen of hearts to move enchantments and re roll unique items.<\/p><p><strong>Crystal shards<\/strong> are only obtained by killing <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">celestial<\/a> entities. The further down the planes you go the more shards they drop. These are also used the same way as Gold Dust.<\/p><p><strong>Copper Coins<\/strong> are only obtained by killing any creature in Purgatory. You need these to craft Trinkets which give your character Ambush and Counter Resistance\/Chance.<\/p><p>Some quests require these currencies, specifically Gold Dust.<\/p>","content_image_path":"currencies\/M6fEl4dQHhVNVUh95qgc78bde0cU96DcX1b6FabL.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":16,"page_name":"account-deletion","page_sections":[{"order":"1","content":"<p>After 5 months of being in active, we flag your account for deletion.<\/p><p>You can still log in and this will remove the flag before 6 months has passed.<\/p><p>Once flagged, if you do not log in for a total of 6 months, your account will be deleted. No email will be sent to you.<\/p><p><strong>What gets deleted?<\/strong><\/p><ul><li>All character data, including Kingdoms which are handed over to the NPC kingdom holder for other players to purchase.<\/li><li>All market place listings<\/li><li>All items, sets, quests, logs - such as attack kingdom attack logs, completed quests, completed guide quests and so on are deleted.<\/li><li>All User data <strong><u>including<\/u><\/strong> Email and Password.<\/li><\/ul><p>Tlessa takes your privacy and security seriously. You can trust we will never sell your email or send you unwanted emails before or after account deletion.<\/p><p>Should your account be deleted and you would like to come back, you may of course register a new account at any time.<\/p><p>Should you wish to delete our account your self, you may login and click\/tap the profile icon in the top right and then click\/tap on settings. There will be a big red, visible delete account button under the character name change. After confirming this is what you want to do, we log you out in a moment you will receive an email confirming your account was deleted.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":17,"page_name":"random-enchants","page_sections":[{"order":1,"content":"<p>Random Enchantments are also known by two other names. Uniques (green items) and Mythics (orange items).<\/p><p>Both can be gotten in game, and both can be re-rolled as well as have their enchantments moved to other items.<\/p><p>The downside is you can only have one unique, or one mythic equipped at any one time.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<p>There are three levels to uniques, with mythical items being better than the third level of uniques.<\/p><p>Uniques start at a valuation of 10 billion Gold, the second level is 50 billion Gold and the Third is 100 billion Gold.<\/p><p>A 10 billion gold Unique will drop every time you level a faction for a total of 25 of them. These are considered mid-range enchantments and are on par with mid-range enchantments.<\/p><p>A 50 billion gold unique can only be purchased from the Queen of Hearts in Hell. These are considered High end and are on par with the more high-end enchantments you can make.<\/p><p>A 100 billion gold unique can only be purchased from the Queen of Hearts in Hell. These are better than any enchantment you can put on an item.<\/p><p>Uniques that drop from Faction levels as a reward or those that you buy are completely random in stats and can come with one or two enchants on them.<\/p><p>Uniques can be sold on the market and to the shop and even disenchanted. You can re-roll and move the enchantments at The Queen of Hearts in Hell.<\/p><p>If we break down the types of Uniques you can get into their stats you can see that:<\/p><p><strong>10 Billion Uniques come with a maximum of<\/strong>:<\/p><p>- 10-25% on stats and reductions, skill modifiers as well as base modifiers such as base healing, base damage and base AC modifiers<\/p><p>- 1-2.5% for life stealing and entrancing<\/p><p>- 100-300 Affix damage<\/p><p><strong>50 Billion Uniques come with a maximum of<\/strong>:<\/p><p>- 30-50% on stats and reductions, skill modifiers as well as base modifiers such as base healing, base damage and base AC modifiers<\/p><p>- 3-5% for life stealing and entrancing<\/p><p>- 500-750 Affix damage<\/p><p><strong>100 Billion Uniques come with a maximum of<\/strong>:<\/p><p>- 60-75% on stats and reductions, skill modifiers as well as base modifiers such as base healing, base damage and base AC modifiers<\/p><p>- 6-7.5% for life stealing and entrancing<\/p><p>- 1000-5000 Affix damage<\/p><p><strong>Mythics come with a maximum of<\/strong>:<\/p><p>- 75-100% on stats and reductions, skill modifiers as well as base modifiers such as base healing, base damage and base AC modifiers<\/p><p>- 7.5-10% for life stealing and entrancing<\/p><p>- 6000-10,000 Affix damage<\/p><p>Mythics are not something you can buy from the Queen of Hearts or get from <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">Faction<\/a> farming, they can drop at a 1% drop chance from <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a> or during the <a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\">Monthly PVP<\/a> event or from regular <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">PVP<\/a>.<\/p><p>Mythics will show up orange in your inventory and you <strong>cannot<\/strong> have a Mythic <strong><u>AND<\/u><\/strong> a unique equipped at the same time. They are considered upgrades to the 100 Billion Unique and can be re-rolled as well as have their enchantments moved to other gear via the Queen of Hearts, which we will learn more about below.<\/p>","content_image_path":"random-enchants\/Ba5QEaIX8LWmD1rG6pU4XSpFaIAsRq4KeNyBlGF0.png","live_wire_component":"null"},{"order":3,"content":"<p>Mythics on the other hand only have three places to drop from and cannot be bought from any NPC or shop. But can be purchased from the market if you have the gold and one is for sale.<\/p><p>These are the best items in the game. They can have their stats re-rolled at The Queen of Hearts in Hell. You can even move the enchantments another set of gear.<\/p><p>The key difference here is that with a unique item, you can re-roll how many enchants are on it, with Mythics, The Queen will only re-roll the attached enchantment.<\/p><p>Mythics can be found from&nbsp;<a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: blue;\">PVP<\/a>, players have a small chance without looting to get one from killing another player.<\/p><p>Mythics can also drop from dead players in the monthly PVP and one is rewarded to the winner of the&nbsp;<a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: blue;\">Monthly PVP<\/a>&nbsp;event.<\/p>","content_image_path":null,"live_wire_component":null},{"order":4,"content":"<h2>Accessing the Queen<\/h2><p>While you are new, you won’t have access to the queen. This requires an extensive quest line on surface to be done, to not only access Hell but to also Access the queen.<\/p><p>Having access to Hell will not get you Access to the queen, instead you need to finish the quest: Queens Decision, which is a surface quest.<\/p><p>Upon finishing this quest and while in Hell, you will be able to access the new Crafting Option called Queen of Hearts (see image to the right or bottom for mobile).<\/p>","content_image_path":"random-enchants\/rRuYNghwvxUtvhZr9FugeQPqi7FoeMKN29fynYFT.png","live_wire_component":null},{"order":5,"content":"<h2>Using the Queen<\/h2><p>While in Hell and only in Hell, you can access this crafting option. Selecting it will add a new crafting section under your attack options. (See image to the right or bottom for mobile)<\/p><p>If you are on mobile, you will have to select the crafting action, then select Queen of Hearts from the Blue Drop down.<\/p><p>As you can see, we have some options: Buy, Re-Roll and Move Enchantments.<\/p>","content_image_path":"random-enchants\/9hdfavVs1EGaZUs6XiCrwBcG5Pt14R7dQwvaGxN4.png","live_wire_component":null},{"order":6,"content":"<h2>Buying Uniques<\/h2><p>Let’s start with buying a unique.<\/p><p>In the image to the right or bottom for mobile, you will see the cost of the three types you can buy.<\/p><p>As above, the cost represents the type of unique you will get. When you purchase a unique, it can come with one or two enchants.<\/p><p>As stated above, all uniques are randomly rolled. It is very rare that two players even roll the same unique.<\/p>","content_image_path":"random-enchants\/92Y2swUkeCF12Xt7lnXxWTZ6Tz3Ls2eWgGtMNwyj.png","live_wire_component":null},{"order":7,"content":"<p>When you have selected the type on unique you want, you can click Purchase, to then purchase the unique.<\/p><p>Your server tab in the chat section will update and you will see a message like the one to the right or bottom for mobile.<\/p><p>As stated, uniques can roll with one or two enchants on them. A 10 billion unique generated with 2 Enchants on it is considered the cost of 20 billion.<\/p><p>When selling these on the market you will not be able to list the item for any lower than the total valuation of the item.<\/p><p>In this case we rolled with one unique, making the item worth 50 billion.<\/p><p>This cost will come in handy when moving the enchantment(s) to an item, which we will talk about later.<\/p><p>You can click the link in the server section to open a modal to show you the stats and compare against what you have. Remember – you can only have one unique equipped at any one time. That unique can have one or two enchants on it.<\/p>","content_image_path":"random-enchants\/eGyhlyvsB0RmRYs0laqCJ1ZAKNGHwf23j3XUcCwy.png","live_wire_component":null},{"order":8,"content":"<h2>Re-Rolling Uniques<\/h2><p>Re-rolling uniques only costs Gold Dust and Shards.<\/p><p>With the image to the right or the bottom for mobile, we select the item we want to re-roll as well as the relevant suffix, prefix, or both.<\/p>","content_image_path":"random-enchants\/K8x5lXyQ0YW87sRnGDtbOUtLp8d8Ux2XWtMdq7GJ.png","live_wire_component":null},{"order":9,"content":"<p>Next, we want to select, what we want to re-roll for the attached enchantments. For example, see the image to the right or bottom for mobile.<\/p><p>He we have a list of options we can re-roll, you can also select to re-roll all the stats on a unique.<\/p>","content_image_path":"random-enchants\/bn9xHWApXZLBbPgMhVx5U9mc2ixkVGc4jC81JxUi.png","live_wire_component":null},{"order":10,"content":"<p>Upon re-rolling, you will see the server message update (see image to the right or bottom for mobile).<\/p><p>Again, you can click this to see any relevant details. There is no way to compare what you had, against what you re-rolled, as we generate a new item based off the selections you made from above.<\/p>","content_image_path":"random-enchants\/ffIITQmqRKVAwdnVqbg1U6j1r0bkRfJH0HxnMjMI.png","live_wire_component":null},{"order":11,"content":"<h2>Moving Uniques<\/h2><p>Finally, let's discuss moving uniques.<\/p><p>You may move both enchantments on any unique to any item I your inventory. The item must not be equipped and must not be in a set. The Queen will not go looking for items in sets or accept items equipped.<\/p><p>She can replace any enchantments already on the item.<\/p><p>First let’s select the item we want to move the unique from. The Queen only moves uniques and no other enchantments.<\/p><p>See the image to the right or bottom for mobile.<\/p>","content_image_path":"random-enchants\/60Ynd2Xeb0S3A8JcnyTwCqZPAFSA7oHY8QUgIQyo.png","live_wire_component":null},{"order":12,"content":"<p>Now let’s select what we want to move on the item. In this case we only have a prefix.<\/p><p>Image is to the right or bottom for mobile.<\/p>","content_image_path":"random-enchants\/P1iNbUsmcHuoQaqGow52cgcyeYhTwj3AcQ0lurlw.png","live_wire_component":null},{"order":13,"content":"<p>Finally let’s select the item we want to move this enchantment to.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"random-enchants\/KX5SG3Dqv2rD67dFngFM3AnRTYfbW3ZdSSlAwgdt.png","live_wire_component":null},{"order":14,"content":"<p>Remember that valuation cost I was talking about before? This unique has one enchantment on it, thus we are only moving one enchantment, the Prefix to the new item: Broken Dagger.<\/p><p>See image to the right or bottom for mobile.<\/p><p>This will cost Gold and Shards. The cost of Gold is the total enchantments valuation. I.e., 50 billion Gold * 1 = 50 billion Gold.<\/p><p>If this item rolled with two uniques and you wanted to move both it would cost 100 billion gold.<\/p>","content_image_path":"random-enchants\/rB4Z54rQk7bhTiOqp9tkrDI4jPXWC5jY19UfS9TK.png","live_wire_component":null},{"order":15,"content":"<p>As you can see The Queen has moved our enchantment to the new item, making that item a unique item.<\/p><p>See Image to the right or bottom for mobile.<\/p>","content_image_path":"random-enchants\/zJN7H476b6vVkAxn6gPJb6rAt47piJvFtvdO9OdJ.png","live_wire_component":null},{"order":16,"content":"<p>Opening the link (after we moved the item – see image to the right or bottom for mobile) shows the comparison data, we see we moved this enchantment to a Broken Dagger.<\/p>","content_image_path":"random-enchants\/phwOfw6CLJNBJMH0YlKfrC7HqJQIpIkTjmIrlX4M.png","live_wire_component":null},{"order":17,"content":"<h2>Re Roll Elements<\/h2><p>When it comes to selecting what to re-roll there are a few types, as you saw above that you can select from.<\/p><p>Lets inspect what each of the re-roll types do:<\/p><p><strong>Base Details<\/strong>:<\/p><p>- Core Modifiers: base Damage\/AC\/Healing %<\/p><p>- Class Bonus % (rolled\/10)<\/p><p><strong>Core Stats<\/strong>:<\/p><p>- Increases stats such as str, int, dex … %<\/p><p>- Reduces enemy stats: str, int, dex … %<\/p><p><strong>Skills Modifiers<\/strong>:<\/p><p>- Set skills with skill bonuses as well as other modifiers such as damage, ac, healing, fight timeout modifier and movement timeout modifier.<\/p><p><strong>Damage Modifiers<\/strong>:<\/p><p>- Sets damage details, such as resistible or not, stacking or not and amount.<\/p><p>- Sets Devouring Light\/Life Stealing\/Entrancing Chance % (rolled\/10)<\/p><p><strong>Resistances<\/strong>:<\/p><p>- Sets your resistances and enemy resistance reduction %<\/p><p>- Skill Reduction for enemies and resistance reduction.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":18,"content":"<p>The final thing to mention is you can move a 100 billion unique to an item with an attached 50 billion unique.<\/p><p>This would make the items minimum cost on the market: 150 billion.<\/p><p>You can also move a unique to an item with an enchantment that is not a unique and thus have an item that has one regular enchantment and one unique. The item will then be considered a unique.<\/p><p>Finally, you can do all of this with Mythics. Except for purchase. You can re-roll them and move the enchantments on them to other items. You can even have Mythics that have uniques attached to them, making them Mythics or Mythics with regular enchantments.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":18,"page_name":"factions","page_sections":[{"order":1,"content":"<p>Factions are how we gate some of the features of Tlessa. We use Quests as well to gate features and advancements.<\/p><p>As you have seen from <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">Quests documentation<\/a>, there are a ton of quests that start on surface to give you access to other planes with specific instructions on how to complete them.<\/p><p>If you are missing a required item to be able to hand in and be teleported\/traversed to the <a href=\"\/information\/npcs\" rel=\"noopener noreferrer\" target=\"_blank\">NPC<\/a>, there are even explicit instructions on how to access that NPC.<\/p><p>As you can see, to the right or bottom for mobile, there are 5 planes that you can gain factions on.<\/p>","content_image_path":"factions\/Crm9PfFDuuDb895i7xCzYtXHQzRRZGf2V0I3ILaM.png","live_wire_component":"null"},{"order":2,"content":"<p>Factions are like notoriety. You kill monsters on a given plane, any monster, to increase the faction points and level them up<\/p><p>Each monster you kill gives you 2 points from level 0 – 1 and 1 point after level 1. Each Faction has a total of 5 levels.<\/p><p>There are quests that require you to level facts, and even a quest that give you a faction quest item to give you more points per kill.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<p>It is suggested that players do not manually try to grind these out, and instead use <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">exploration<\/a>, which give you points per kill and bonus points along the way.<\/p><p>Factions also give you <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">uniques<\/a>, worth 10 billion gold per level up. Meaning every player can get a total of 25 uniques at a valuation of 10 billion gold each.<\/p><p>The Queen of Hearts (late in the game) can let you buy 50 and 100 Billion gold uniques as well as re-roll and move the enchantments to other gear.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":19,"page_name":"combat","page_sections":[{"order":1,"content":"<p>Combat in Tlessa is rather simple. There are two forms of Combat: <a href=\"\/information\/automation\" rel=\"noopener noreferrer\" target=\"_blank\">Automated<\/a>, known as <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a> or Manual.<\/p><p>Manual combat is nothing more than repeatedly clicking to attack and kill monsters.<\/p>","content_image_path":"combat\/cWRRDvfi0M9ZjqWaOdmgktYCBE4V84McK4JXCysG.png","live_wire_component":null},{"order":2,"content":"<p>There are two phases that can play out when it comes to manual combat, first is the “before the fight” phase where you and the enemy have a chance to void\/devoid each other and where your enchantments can reduce enemy skills, resistances, and stats.<\/p><p>This phase is done before the enemy’s stats are calculated, allowing stat reduction enchantments to reduce the enemy’s stats.<\/p><p>These same steps play out for automation as well.<\/p>","content_image_path":"combat\/1zaNKHjOJduPWEIb8CVgqoYbtXqkJtbofcha7xa5.png","live_wire_component":null},{"order":3,"content":"<p>Next, you will choose your attack. You have one of five attacks to choose from. All classes do better with specific attacks once you established your gear.<\/p><p>The Attacks are as follows in order (see the image to the right or bottom):<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Attack (Uses both hands)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cast (Uses both spells)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Cast and Attack (Uses spell in spell slot 1 and weapon in right hand)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Attack and Cast (Uses spell in spell slot 2 and weapon in left hand)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Defend (Uses your armour to defend, can also fire off Vampire’s special attack)<\/p><p>When you are just starting out it’s best to ignore any “recommendations” of your class until you are more established and just use the first option: Attack.<\/p>","content_image_path":"combat\/06KXa7AiqcAFY4Jpgpb4V6f9HVGATC5IvNToVoSf.png","live_wire_component":null},{"order":4,"content":"<p>The final thing to note is that drops will appear in your server message section. For example, see the image to the right or bottom for mobile.<\/p><p>This item is a quest item used in a quest. <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">Quest items<\/a> can drop from some <a href=\"\/information\/monsters\" rel=\"noopener noreferrer\" target=\"_blank\">monsters<\/a> as well as other items that can be randomly rolled and is generally with in your level range up to a point per plane, with <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a> giving the best gear (albeit not better than what you can craft, but better than the shop) and surface giving “starter” gear up to a max crafting level of 100.<\/p>","content_image_path":"combat\/Tjo5ktSEAKDSotCaEEqOZVopYJo7TLaSkOhXB5ty.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":20,"page_name":"quests","page_sections":[{"order":1,"content":"<p>Tlessa offers a variety of quests in which are used to access various forms of content, including access to other <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">planes<\/a>, max level, <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">crafting<\/a> types such as <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">The Queen of Hearts <\/a>and more.<\/p><p>When you first start the game, you will see a Quests tab at the top of the screen. Clicking this will present you with the following image. (See right or bottom for mobile)<\/p><p>As you can see here, there are a ton of quests that one can do.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Blue Quests mean you can do them<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Green Quests mean you have done them<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Red quests are gated behind the parent quest.<\/p><p>Quests are nothing more than attain this item, <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currency<\/a> and\/or <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">faction<\/a> points. All of which can be obtained for free with a bit of time.<\/p>","content_image_path":"quests\/f6IC9cGvd9FL67keqcEtjgi4drL0zSLiyyoWHLn8.png","live_wire_component":"null"},{"order":2,"content":"<p>As you see in the image (above) Surface is generally the place with the most quests, but you have an option to select to select other planes. (To the right or bottom for mobile)<\/p><p>If you are on another plane and open the quest section you will see the quests for that plane, assuming the plane has quests. Not all planes have quests.<\/p>","content_image_path":"quests\/H6RrxfqPpr58CyyU9brbk10KQo8brrUpxoiKx9GG.png","live_wire_component":null},{"order":3,"content":"<p>Clicking on a quest shows you one of three tabs:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;NPC Details<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Requirements<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rewards<\/p><p>You will also notice the Hand In button. If you are missing any of the requirements or cannot access the <a href=\"\/information\/npcs\" rel=\"noopener noreferrer\" target=\"_blank\">NPC<\/a>, you will be told as such.<\/p><p>See Image to the right or bottom for mobile.<\/p>","content_image_path":"quests\/tNfhesQb9Xo8uqQ6DWIjLIRAColHqLwWfkR0Y7ow.png","live_wire_component":"null"},{"order":4,"content":"<p>The First tab is the NPC tab. This is where you see details on how to access the NPC. If the NPC is not on surface, you will have explicit instructions to follow to access the NPC.<\/p><p>See the above section for the image<\/p><p>You can also see a story of sorts on this tab. When you hand in the quest after completing the requirements tab, this story will update to show you the “after” context.<\/p>","content_image_path":null,"live_wire_component":null},{"order":5,"content":"<p>The second tab is called the requirements tab. This has all the listed requirements as you can see to the right or bottom for mobile, and clicking each help icon will, in explicit detail, give you the instructions to obtain each <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">item<\/a>.<\/p>","content_image_path":"quests\/v6L8LiLUv4FP1UGd96isIKcMfZlcNNCUmOksLt9f.png","live_wire_component":"null"},{"order":6,"content":"<p>The third tab contains the rewards (to the right or bottom for mobile). These are the rewards you get for completing the quest.<\/p><p>Sometimes you will be rewarded a quest item, which is needed for another quest or used to unlock a specific aspect of the game.<\/p><p>When you Hand in a quest, the Chat section at the bottom of the game section will update, specifically the Server Message tab. You will also be moved, across plane, and teleported to that NPC’s location at no Gold cost and with no Movement Timeout.<\/p>","content_image_path":"quests\/DA3x0JGZy1jDzCYIzGsWCl8NUhKUH4O2iYdilNCX.png","live_wire_component":null},{"order":7,"content":"<p>Quests are easy to do and will be done as you progress through the game. There are two types of quests – as you might have seen above – One Off quests, that is quests not in a tree and are usually used to upgrade items you obtained through fighting monsters and Quest trees, like the big one above.<\/p><p>The Last type of quest not covered here are Guide Quests. These are quests that guide new players, slowly, through the initial steps of the game, getting them use to the mechanics of the game.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":21,"page_name":"alchemy","page_sections":[{"order":1,"content":"<p>Alchemy is a crafting skill that is unlocked at later stages of the game and requires you to unlock a quest as well as kill <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a> for their precious <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Shards<\/a>!<\/p><p>Alchemy allows players to create three types of items:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Potions, Dusts, and other items you can use on your character to raise your stats for a limited time.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Kingdom destruction items that you can use on enemy kingdoms to level the kingdom to the ground before sending in your Settler and taking control of the kingdom.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy Oils that can be used in Purgatory to add additional stats to your items and turn them into what’s called Holy Items.<\/p><p>To unlock Alchemy, you must first complete the On Off <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>: I Dream of Alchemy on Surface.<\/p><p>This then unlocks the skill and the crafting option.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Crafting Alchemical Items<\/h2><p>The first step to crafting these items, after you have unlocked the required skill, is to then open your crafting section. See image to the right or bottom for mobile.<\/p><p>Here you can see a new crafting option called Alchemy.<\/p>","content_image_path":"alchemy\/lwdt0pgh61AQqQaco7snKBI4R61RkOca6EpPNzx3.png","live_wire_component":null},{"order":3,"content":"<p>Much like <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">crafting<\/a> or <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a>, you will have limited options in the items you can craft for now.<\/p><p>However, you can see the table of alchemical items below and their required skill levels to craft.<\/p>","content_image_path":null,"live_wire_component":"info.alchemy-items.alchemy-items-table"},{"order":4,"content":"<p>Let’s craft an Alchemical item, once the Alchemy section is open, lets craft a Bland Potion.<\/p><p>See image to the right or bottom for mobile.<\/p><p>Here we see it Costs 200 <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a> and 8 <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Shards<\/a>.<\/p><p>As stated, before Shards come from <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a>. But how do you get Gold Dust? You can enchant and then <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">disenchant<\/a> the items you do not want; this will destroy the item and give you some Gold Dust as well as level enchanting at ½ the XP from disenchanting.<\/p>","content_image_path":"alchemy\/ocNKTezlhvtS3JJPxUba8ANUqsK6KfKbmQJjmPsq.png","live_wire_component":null},{"order":5,"content":"<p>Now that we crafted the item, if you are successful, you will see the message in the server section of your chat section. See image to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/HXPfHunIWJvqb4wDNUpt1vJ1LoSpgWp3yIK4nmIR.png","live_wire_component":null},{"order":6,"content":"<p>Clicking this item will show you the details, as we can see it raises all our stats by 0.80%.<\/p><p>See image to the right or bottom for mobile.<\/p><p>A player can then use this, as we will in a moment to apply the effects to their character for, as you can see, 10 minutes at a time. A player may have 10 alchemical items (or as we call them Boons) applied to themselves at any one time. All Boons stack with each other, your gear, and any relevant quest items.<\/p>","content_image_path":"alchemy\/x4qYE2HoXi0m5pnZ75PciAduQ2bTFFupHP2fJBtH.png","live_wire_component":null},{"order":7,"content":"<h2>Using Alchemical Items<\/h2><p>Items you can use will appear in your inventory with a Use Options drop down. To get to this we first need to go to our Inventory on the Character Sheet tab.<\/p><p>For mobile players you will need to select Inventory Management from the drop down that appears on the Character Sheet.<\/p><p>Next, while on the inventory tab, we want to select the Usable from the Type drop down as we can see to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/opCcuF0tO6gY2q1nxg06FfcWWpHLLkxA7Emvu8pf.png","live_wire_component":null},{"order":8,"content":"<p>This will show you a list of all your Alchemical Items. In our case we only care about the Bland Potion we created.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/flZc5kEIwrKTkK6UPXUHLvamojR8uO1nukKnzCwh.png","live_wire_component":null},{"order":9,"content":"<p>From the Drop down beside it, called Use Options, we can select Use Item. See the image to the right or bottom for mobile.<\/p><p>Note: If this drop down looks cut off, you can scroll the inventory section you are on down, to then display the cut off section.<\/p><p>You can also list these items on the market for Gold as well as destroy the item if you no longer wish to use it.<\/p><p>Alchemical items do take up inventory space.<\/p>","content_image_path":"alchemy\/GEOxGoNvdEoIWXftYatUk6umZeC1Wh6HgjdGyb0o.png","live_wire_component":null},{"order":10,"content":"<p>Upon selecting Use item, you will see a very familiar modal to the one you saw when you clicked on the item in chat.<\/p><p>You can see this to the right or the bottom for mobile.<\/p><p>This modal shows you the same details as before but now you have an option to Use Item.<\/p>","content_image_path":"alchemy\/w1Tc594GnQOkB2eQ0BuaI9zKZ5HXV5ARd58H9Ij3.png","live_wire_component":null},{"order":11,"content":"<p>Now that we have used the item, at the top of our character sheet we will see a section called: Active Boons.<\/p><p>For mobile players, please expand the top character info section to get access to Active Boons.<\/p><p>We can see the Active boons image to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/YoXSNOraWKn1J17Nar0TnvC2pRtw4Gyau6txqKTD.png","live_wire_component":null},{"order":12,"content":"<p>As we can see above, we have single active boon that will last 10 minutes: Bland Potion.<\/p><p>We see the same information as before.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/ysvzEGcG0vOEiC5iDSZz4KK1w20kLbUDaFtJcm0L.png","live_wire_component":null},{"order":13,"content":"<p>When a boon wears off, we see this in the Server message section. Again, to the right or bottom for mobile.<\/p>","content_image_path":"alchemy\/QiAdAgojN2nvE2kf0AsC0HLnqtfIfNppfeSeAlJh.png","live_wire_component":null},{"order":14,"content":"<p>That’s all there is to Alchemical items.<\/p><p>Kingdom based items must be used on enemy kingdoms, by selecting that kingdom on the map (or moving to it on mobile and clicking View Details) and you will have an option to use items and\/or wage war.<\/p><p>Holy Oils, as stated before, can only be used while you are in Purgatory and can only be used on unequipped items that are in your inventory. All items have what’s called: Holy Stacks. Cheaper items have less, more expensive items have more allowing you to apply more oils to the item, all of which stack and stack with the item’s stat modifiers.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":22,"page_name":"player-vs-player","page_sections":[{"order":1,"content":"<p><strong><u>PVP is an optional<\/u><\/strong> aspect of Tlessa that allows players to obtain what are called Mythic items by killing other players.<\/p><p>These items are like uniques, such that you can only have one equipped and always come with 2 random enchants valued at 500 billion gold each. That means a Mythic that is listed on the marketplace has a minimum sale price of 1 trillion gold.<\/p><p>Like uniques, these items can be re-rolled and have their enchantments moved from the gear they are on to any gear you want. This is done through the Queen of Hearts.<\/p><p>You must be:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Level 301 or higher to participate<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;At the same location as another player – regardless of if they are logged in or not.<\/p><p>All PVP fights are done server side and the loser is moved away from the fight with a special flag attached to them so they cannot be targeted and constantly killed. Their location is also hidden in chat. This flag only lasts for 2 minutes.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Duelling Players<\/h2><p>Once you are level 301 or higher and are moving around on the map you will see a new option appear. See the image to the right or bottom for mobile<\/p><p>For those on mobile, you will need to dismiss the map section to then check the list of actions for an option called duel.<\/p>","content_image_path":"player-vs-player\/siE2pXh5RMQ2qNwZ9KRhiFuLpbeE46ATmdPTtI4g.png","live_wire_component":null},{"order":3,"content":"<p>When you open this section, you will see a drop down where you can select the player you wish to fight as you can see to the right or bottom for mobile.<\/p>","content_image_path":"player-vs-player\/qrpKn3z813mWWSnDQaApdkc4l8VGvrY9kIk7RemG.png","live_wire_component":null},{"order":4,"content":"<p>Here we can see (to the right or bottom for mobile) we only have one player to fight.<\/p>","content_image_path":"player-vs-player\/j7NR38LoXypU80AX2trbtqL3zyGlWqHimX1yXZjJ.png","live_wire_component":null},{"order":5,"content":"<p>Selecting them and clicking Fight will present you with a similar attack section as Celestials or manual combat.<\/p><p>See image to the right or bottom.<\/p>","content_image_path":"player-vs-player\/or2vt3qfyJ75xqC24T0imu5ew179gWkAQeA8hBkg.png","live_wire_component":null},{"order":6,"content":"<p>When you attack them, you’ll get the typical messages as seen in the image to the right or bottom mobile.<\/p>","content_image_path":"player-vs-player\/K3tdCitJWY0iAsuXAjoqee0KM3z7SsAVb6hsJeoE.png","live_wire_component":null},{"order":7,"content":"<p>What’s more, is the player – who might be oblivious to you attacking them, will instantly have their pvp section open, regardless of what they are doing – except for exploration and they will see who attacked them and how much damage was done.<\/p><p>In this case they are dead. So, what happens to you when you die? Do you lose items? Gold? Xp?<\/p><p>See image to the right or bottom for mobile<\/p>","content_image_path":"player-vs-player\/b05Nqt48JdmqqAfLyyrKJ9RZS5jkN1D0Ra2Juk8F.png","live_wire_component":null},{"order":8,"content":"<p>You are moved away from the fight; you must revive – and that’s it. You lose no items, gold, XP nothing.<\/p><p>As you can see from the image to the right or the bottom for mobile.<\/p><p>The winner has a small, very small chance with no looting bonus applied to receive a Mythic Item.<\/p>","content_image_path":"player-vs-player\/R1wqgSbmVHjNYSxPNI8leuIBk2CJ5gZTpJtUqrYB.png","live_wire_component":null},{"order":9,"content":"<p>The winner will see, as you can see to the right or bottom for mobile, that they have killed you. If they received a Mythic it would also be in their server message section.<\/p>","content_image_path":"player-vs-player\/EgkRceTyh3YKCucscg7HMjqDcPgUJpCe6z8ldIci.png","live_wire_component":null},{"order":10,"content":"<p>When the loser of PVP chats after being moved away, they will see, and so will everyone else, a skull where their location should be.<\/p><p>Even if their flag is removed, their past messages will show a skull.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"player-vs-player\/oD3kRO1G5aRt9fltgPVKKAjFjVLyPAsDyWUEzm08.png","live_wire_component":null},{"order":11,"content":"<p>When your safety net ends, you’re sever messages will update to show you, as you can see to the right or bottom for mobile.<\/p>","content_image_path":"player-vs-player\/Nd2nPqK2Q63Rqdfu0W51WOuf3AvLDQv7mAxj95Su.png","live_wire_component":null},{"order":12,"content":"<p>Chatting after this flag has been removed, will show your location again. But notice how, in the image to the right or bottom for mobile, we still show previous messages as hidden locations.<\/p>","content_image_path":"player-vs-player\/XP9wOeLnt0eJJuiv3rMNcvKI5jPzODxdPk2z0dx7.png","live_wire_component":null},{"order":13,"content":"<p><strong>PVP is optional<\/strong>, meant to be fun and <u>asking a player to stop targeting you is fair<\/u>. <strong>If the player refuses to and constantly stalks you and harasses you, this can see them banned for a day with subsequent bans and even a permeant bans to follow for repeated offences.<\/strong><\/p><p>It is one thing to go after someone, because they were rude, took all your kingdoms or even killed you in PVP, but it’s another to stalk them and make their game play experience suffer because you are mythic hunting. There are other ways to get Mythic Items, such as through – again, optional – Monthly PVP events when the participants are gathered and duke it out and the Celestial Kings are released afterword’s.<\/p><p>Players can also move at any time, as a result the PVP section will update appropriately to show who is left or to even tell you, as seen above, that there is no one left to fight.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":23,"page_name":"skill-information","page_sections":[{"order":1,"content":"<p>Tlessa has three types of skills to offer:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Trainable skills which are trained by killing monsters either manually or through exploration.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Crafting Skills which are only trained by <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">crafting<\/a> and <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a> items<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<a href=\"\/information\/kingdom-passive-skills\" rel=\"noopener noreferrer\" target=\"_blank\">Kingdom Passives<\/a> which are trained by waiting for the skill to update over a set number of hours.<\/p><p>Below you can see a list of trainable and crafting skills in the game. We will get to kingdom passives a bit later, but we do have a document on those here.<\/p>","content_image_path":null,"live_wire_component":"admin.skills.skills-table"},{"order":2,"content":"<h2>Trainable Skills<\/h2><p>Trainable skills are those that you can select to train. Players can do this by going to their character sheet and clicking train on a skill they wish to train.<\/p><p>Mobile players can access this by going to their character sheet and selecting the Skill Management option from the drop down.<\/p><p>As you can see, to the right or the bottom for mobile, there are a series of skills that you can train. Including one class specific skill that helps your class bonus fire off more often.<\/p><p>The most essential skills early on are Accuracy and Looting, specifically Looting after your character reaches level 10.<\/p><p>Some Skills, as you have maybe seen by clicking on them in the table above, have what’s called a skill bonus. In the case of this, the skill bonus is used in conjunction with the character roll to ascertain if they can do the action. In the case of Accuracy, the higher the bonus the higher the chance to hit.<\/p><p>Having a 100% in Accuracy for example means you never miss.<\/p>","content_image_path":"skill-information\/u8dqxuhqi0oW1SnvEGychwIyWJbEUa9KbYbgZmsk.png","live_wire_component":"null"},{"order":3,"content":"<p>You can see here (to the right or bottom for mobile), when we click Train, we have an option to sacrifice a portion of our XP towards the skill. For example, if you select 10% then every monster you kill would sacrifice 10% of the XP it would give you to train the skill.<\/p><p>Every time a skill levels the next XP needed to level it, is Skill Level * 100. Because most skills, except for Kingmanship go to 999, you will need about 99,900 XP to max out a skill.<\/p><p>However, each time you level a skill the amount of XP you gained is set back to 0 out of the new total needed.<\/p><p>There are various <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Enchantments<\/a> and even quest items to help with the leveling process of skills. The quest items, you get through doing <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a>, specifically those for The Helpless Goblin (Surface Quests).<\/p>","content_image_path":"skill-information\/uQZt7Wvs5YdAuwPA2P2GaADVoxHifyRD2AL9ePju.png","live_wire_component":null},{"order":4,"content":"<h2>Crafting Skills<\/h2><p>There are various crafting skills that you can level as well, as you can see to the right or the bottom.<\/p><p>You cannot sacrifice XP towards these, instead you will use the appropriate type of <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">crafting<\/a>, weapon, armour, spells, rings, <a href=\"information\/trinketry\" rel=\"noopener noreferrer\" target=\"_blank\">trinketry<\/a> or <a href=\"\/information\/aclchemy\" rel=\"noopener noreferrer\" target=\"_blank\">alchemy<\/a>.<\/p><p>Each one gains you different items and takes Gold or Copper Coins and Gold Dust as the <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currency<\/a>.<\/p><p>Every time you gain a level in these types of crafting the XP is random between 100 and 350 XP. Your XP will be reset back to 0 for that skill.<\/p>","content_image_path":"skill-information\/6RbyLSha1AlVLv5Bs0gbtHLOppCACWsh8313WRmj.png","live_wire_component":"null"},{"order":5,"content":"<h2>Kingdom Passives<\/h2><p>We talk more about these in <a href=\"\/information\/kingdom-passive-skills\" rel=\"noopener noreferrer\" target=\"_blank\">their own document<\/a>, and as you can see with the image to the right or bottom for mobile there are a series of skills laid out in a tree fashion that double in time required per level to a max level of 5.<\/p><p>These passives combined with you Kingmanship skill can reduce the cost of buildings, units, increase defence, unlock new buildings and units, and will apply to all existing and future kingdoms. You own, purchase, or take through war.<\/p>","content_image_path":"skill-information\/bEZBfQbaG58tcjSvih3EcxVEDFnzYEGGJsmjQ1MS.png","live_wire_component":"null"},{"order":6,"content":"<p>Skills, specifically those you can train, and the crafting section set of skills are essential to progressing your character.<\/p><p>Kingdom passives are not as essential but only become so if you want to get serious about owning, managing, and growing your empire.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":24,"page_name":"planes","page_sections":[{"order":1,"content":"<p>In Tlessa there are various maps, also known as Planes. As you can see to the right or bottom for mobile, a map is a plane, and a plane is a map.<\/p><p>All players start out on Surface.<\/p><p>You will complete quests and kill specific monsters that get you get you specific quest items that then allow you to use <a href=\"\/information\/traverse\" rel=\"noopener noreferrer\" target=\"_blank\">traverse<\/a> to move to these other planes.<\/p><p>Each plane has its own set of <a href=\"\/information\/monsters\" rel=\"noopener noreferrer\" target=\"_blank\">monsters<\/a>, <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">celestials<\/a>, and all of them, except for Purgatory, allow you to settle <a href=\"\/information\/kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">kingdoms<\/a>.<\/p><p>Some planes, such as Shadow Plane, Hell and Purgatory increase the monster’s strength while also reducing your own strength.<\/p><p>The Further down, from Surface, you go the harder the creatures become starting after Dungeons.<\/p><p>If an <a href=\"\/information\/npcs\" rel=\"noopener noreferrer\" target=\"_blank\">NPC<\/a> is not on Surface, for a quest, there will be explicit instructions on the NPC tab of the quest dialogue that tells you how to access the NPC. This is useful for handing in the quest as we teleport\/traverse you to the NPC’s location at the time of hand in.<\/p><p>Below you can see a list of planes and get additional details about them.<\/p><p>If you do the<a href=\"\/information\/guide-quests\" rel=\"noopener noreferrer\" target=\"_blank\"> Guide Quests<\/a> as a new player, we guide you through Surface into Labyrinth and finally into Dungeons.<\/p>","content_image_path":"planes\/wIfvFDeNkh9GpXZfuKRTsC67FOkGRdOclmKNT6zv.png","live_wire_component":"admin.maps.maps-table"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":25,"page_name":"crafting","page_sections":[{"order":1,"content":"<p>Crafting is the second most essential skill behind enchanting. It only requires gold, no resources, nothing. You can select the item you want to craft and simply hit craft to make the item. There is a chance to fail and when you are new and shiny to crafting, you will fail often.<\/p><p>But if you kill <a href=\"\/information\/monsters\" rel=\"noopener noreferrer\" target=\"_blank\">monsters<\/a> while crafting there are a chance, especially with early monsters to get valuable <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">quest items<\/a> that help increase the chance of successfully crating.<\/p><p>There are also valuable<a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\"> enchantments<\/a> that help with crafting.<\/p><p>As you level you will unlock more items to craft and the price only gets more and more expensive over time.<\/p><p>There is no automation of any kind for ether crafting or enchanting and there are a few different types of crafting:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Weapon (Consists of regular weapons, Staves, Hammers and Bows – the latter three are two handed weapons)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Armour<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Rings<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Spells<\/p><p>Each type, listed above, has its own crafting <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skill<\/a> section. For example, if you want to craft weapons, you will level the Weapon Crafting skill.<\/p><p>If you choose to craft Hammers, Bows, or Staves it still levels the Weapon Crafting Skill.<\/p><p>Players who do not craft are stuck with shop gear; shop gear only goes up to 2 billion gold while crafted items can go to 36+ billion gold (<a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">a player may have 2 trillion gold on them at any one time<\/a>.)<\/p><p>You can see below a list of items and the required skill level to craft the item and when the item becomes trivial.<\/p>","content_image_path":null,"live_wire_component":"info.items.craftable-items-table"},{"order":2,"content":"<h2>How to craft<\/h2><p>As mentioned, crafting is easy and essential to character progression. We can see in the image to the right or bottom for mobile, that we have a Craft\/Enchant drop down that has various types of crafting options.<\/p><p>For these purposes we will stick with Craft.<\/p><p>How mobile players access crafting is slightly different then how PC players access it. For mobile you will select the Crafting option from the actions drop down and then you will have the same blue drop down to select the crafting type from.<\/p>","content_image_path":"crafting\/PHg5kUXQkcFBnrqOgMlfZP6Li79o7HeGd4DFp4Wg.png","live_wire_component":"null"},{"order":3,"content":"<p>Once the craft section is open (see image to the right or bottom for mobile) you will see we have various types of crafting options mentioned above. There are 4 types of weapons you can craft that all level weapon crafting.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Regular Weapons (Weapons) which are useful to any one and any class.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Staves, which are useful for Arcane Alchemists and Heretics (Two handed)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Bows, which are useful for Rangers (Two handed)<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Hammers, which are useful for Blacksmiths (Two handed)<\/p><p>All these weapons can be equipped by anyone. However, some classes have special attacks that fire automatically if you have specific weapons equipped and level your class skill.<\/p><p>For example, Blacksmiths who equip a Hammer have a chance to do a devastating attack to their enemies called Hammer Smash.<\/p>","content_image_path":"crafting\/hDROgi8mzT3oxSg8FlgaCuVcldyUS04KB0kRRCUb.png","live_wire_component":null},{"order":4,"content":"<p>Let’s craft ourselves a stave. As you can see to the right or bottom for mobile, we have a list of staves to craft. You may not have as many as the image does, but over time you will unlock more.<\/p><p>You will want to pay attention to the Server Messages tab in the chat section when crafting to see if you succeeded, failed (and lost the investment) or if you have new items, or if the item is too easy to craft.<\/p><p>Remember all items have a skill level required to craft and a skill level when it becomes too trivial for you to craft.<\/p>","content_image_path":"crafting\/QIYNWLu4FwvDH5NkaxWwlKHwgp2wXg0W8j2bSKTc.png","live_wire_component":null},{"order":5,"content":"<p>Now that we have our item selected, all we have to do is hit craft and wait for the 10 second timeout before attempting again.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"crafting\/SirNZR4FdTy2xAWFU7XYTxuP0r4gliQljr08EK1u.png","live_wire_component":null},{"order":6,"content":"<p>In the image to the right or bottom for mobile, we can see we have crafted the item. You might fail and lose your investment, it’s a roll of the dice based on, in this case your Weapon Crafting Skill’s Skill Bonus.<\/p><p>As mentioned before there are various enchantments and a few quest items that will increase not just the skills skill bonus but also the XP per successful craft.<\/p><p>Some players often tend to make themselves, at later levels, a full set of crafting specific gear with enchantments to make the process easier.<\/p>","content_image_path":"crafting\/HKeMdaaIrsUphHhY8Xn00yE43765An86xsQx8dfB.png","live_wire_component":"null"},{"order":7,"content":"<p>That’s really all there is to crafting, you select what you want, you hit the craft button and you repeat the process.<\/p><p>A tip for new players is to keep the items you craft so you can turn around and then enchant the items with enchantments and then any item you don’t want you can disenchant to level both the disenchanting and enchanting skill.<\/p><p>You can also sell these items to the shop and after enchanting them, to the market.<\/p><p>Crafted items, as you saw above can be clicked on to see if it’s better than what you have on and possibly equip it.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":26,"page_name":"character-xp","page_sections":[{"order":1,"content":"<p>Character XP in Tlessa is straight forward until you reach Level 1000.<\/p><p>From level 1-999 characters need 100 XP to gain a level. This is easily accomplished by killing creatures. How ever, characters whos levels is 500 or higher get 25% less xp per kill. Characters level 750 or higher will get 50% less xp and characters level 900-1000 will get 75% less xp per kill as you reach the super soft, medium and hard cap.<\/p><p>This is where your journey can end, in terms of progression.<\/p><p>You could also complete a <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a> to unlock a quest item that lets you then gain levels up to 5000, with the same soft, medium and hard cap at Level: 2500, 3750 and 4000.<\/p><p>Its at this stage, level 1000+ your XP curve changes into the following:<\/p><p>If your desired level (N) is higher than 999:<\/p><ul><li>There's a starting point for XP at level 1000, which is 1000 XP.<\/li><li>As your desired level gets higher, the XP requirement increases faster, but not too dramatically.<\/li><li>The rate of this increase is controlled by a simple factor (b).<\/li><li>The factor (b) is calculated based on how much the XP should grow over a certain range of levels.<\/li><li>The higher you go beyond level 1000, the more the XP requirement grows, but it doesn't go crazy.<\/li><li class=\"ql-indent-1\">However, the XP requirement doesn't go above 1,000,000 XP, no matter how high you want to go.<\/li><\/ul><p>So, in simple terms, the math can be described like this:<\/p><ul><li>If N is big (more than 999), XP required starts at 1000 and increases a bit faster but stays reasonable, never going above 1,000,000.<\/li><\/ul><p>There is an artistic around the concept of not going about 1,000,000 as you can then further level your character by reincarnating them back to level 1, and re-leveling 4,999 levels again, then reincarnate and repeat over and over 100 times, where each time you do, you have a % penalty added to your XP.<\/p><p>This % will increase each time you reincarnate by an additional 5%.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-12T03:32:21.000000Z"},{"id":27,"page_name":"holy-items","page_sections":[{"order":1,"content":"<p>When it comes to gear progression, players will want to apply Holy Oils to their items, which can only be done in <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a> after completing the <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>: Purgatories Doors, which is a Surface quest.<\/p><p>To apply the oils, you need to craft them using <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> which can be unlocked by completing the I dream of Alchemy, which is. One Off quest on Surface.<\/p><p>You also need <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a>.<\/p><p>The formula for calculating the cost is dependent on the oil being applied.<\/p><p>You can search the <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> list for “Oil” and see all the oils that can be applied and what they do. There are two things an oil will do to your gear:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Increase Stats by a random % based on the Holy Level of the oil.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Increase Devouring Light % based on the Holy Level of the oil.<\/p><p>All oils have a level and the better the level, the better the stat and devouring increase.<\/p><p>When you apply an oil to an item, <strong>you cannot remove the oil, it's permanently on there<\/strong>.<\/p><p>Each item in the game, Armour, Weapons, Rings and Spells all have what’s called a Holy Stacks Amount. This is how many oils you can apply to that item. As you can imagine the higher the stacks, the more you can apply.<\/p><p>Characters also have Holy bonuses applied based on the total number of stacks on your equipment, we will get to that in a moment.<\/p><p>The Cost formula for applying an oil to an item is as follows:<\/p><p>((Items Holy Stacks) * 1000) * Holy Oil Level.<\/p><p>Items Holy Stacks does not mean how many you have left on the item. It refers to the <strong>total number of stacks that can be applied<\/strong>.<\/p><p>This can get expensive, 50k+ Gold Dust per oil to apply.<\/p><p><strong>There are 5 levels of Holy Oils in Tlessa:<\/strong><\/p><p>Level 1 applies between 1-3% for stats and 1-3% for Devouring Light\/Dark resistance.<\/p><p>Level 2 applies between 1-5% for stats and 1-5% for Devouring Light\/Dark resistance.<\/p><p>Level 3 applies between 1-8% for stats and 1-8% for Devouring Light\/Dark resistance.<\/p><p>Level 4 applies between 1-10% for stats and 1-10% for Devouring Light\/Dark resistance.<\/p><p>Level 5 applies between 1-15% for stats and 1-15% for Devouring Light\/Dark resistance.<\/p><p>Holy oils are useful for Purgatory where monsters can devoid you and void you. But if you have 100% on the Devouring Light\/Darkness resistance then the enemy wont be able to devoid or void you making the fight easier.<\/p><p>This also applies to PVP fights, where the other player cannot void or devoid you.<\/p><p>There are only 5 oils in Alchemy, all of them end with Oil in their name and the last one Heaven’s Guardian Oil is a level 5 Oil.<\/p><p>Each item in the game has its own Holy Item Stack Max, starting from one and going to twenty for max level crafted items.<\/p><p>This would mean each of your items that you have equipped, assuming they are all max level crafted items can have twenty oils applied per item, which then increases your holy bonus. This will increase your base damage, ac and healing power the more oils applied to your items.<\/p><p>Lets discuss further with some examples.<\/p>","content_image_path":null,"live_wire_component":"info.alchemy-items.alchemy-holy-items-table"},{"order":2,"content":"<h2>How to apply oils<\/h2><p>First you need to be in Purgatory, anywhere will do. Then you open the Craft\/Enchant drop down and, as you can see to the right or bottom for mobile, you now have what’s called: Purgatory Smith Work Bench.<\/p>","content_image_path":"holy-items\/bC9DoQTCb2jP5KUzCOw2uhh5GIgBGoLtaVfqoycp.png","live_wire_component":null},{"order":3,"content":"<p>Once you have that open you can select an unequipped item that is not in your set, again to the right or bottom for mobile.<\/p><p>You can apply oils to Uniques, Mythics, Enchanted Items and Regular items.<\/p><p><strong>You cannot fail at applying oils.<\/strong><\/p>","content_image_path":"holy-items\/bMgVuLO98Y3NDos7jaHrxjrmxF3hu6eLbjqX9fzU.png","live_wire_component":"null"},{"order":4,"content":"<p>Now that we have selected our item, let's select out oil. See image to the right or bottom for mobile.<\/p>","content_image_path":"holy-items\/rGOXzLfowpFfpbCfzTAQ7Z56JQm4m0OqY5b7OK8s.png","live_wire_component":"null"},{"order":5,"content":"<p>Next you will see to the right or bottom for mobile, the cost. Again, the formula is based off the total number of stacks that can be applied and the holy level of the oil. The higher the stacks and the higher the level the more chance of better stats and devouring light, but also the higher the cost.<\/p><p><strong><u>Again, these oils cannot be replaced, re-rolled or re-applied.<\/u><\/strong><\/p>","content_image_path":"holy-items\/7oxGnXC2HfdvgIxwd4PzprdV8FwR9zp9YBGAVZmf.png","live_wire_component":"null"},{"order":6,"content":"<p>When you craft an oil through <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a>, it will show up in your inventory as you can see to the right or bottom for mobile, under the usable item section.<\/p><p>These items do count towards your max inventory limit and cannot be moved to sets.<\/p>","content_image_path":"holy-items\/9gcgVoV4LDn67gqfOqD3a34aWOu7e4MWoJmb6Vap.png","live_wire_component":"null"},{"order":7,"content":"<p>If we click on the oil we selected above, in our inventory, we can see some details about it – to the right or bottom for mobile.<\/p><p>Here you can see the amount of stats you could gain and the amount of devouring light you could gain. Again, all random at the time of application.<\/p>","content_image_path":"holy-items\/StGm28p48xShboMuLujOXGHsbVCSunV7KoQh9WUh.png","live_wire_component":"null"},{"order":8,"content":"<p>Let’s go back to applying our oil. When you click Apply Oil the server message section will update, as you can see to the right or bottom for mobile.<\/p><p>There is a 10 second time out in between applying oils.<\/p>","content_image_path":"holy-items\/5xgtqlAObaMUj1nmw6BgOtSRFmzGJSyaU4IOJrvG.png","live_wire_component":null},{"order":9,"content":"<p>If we click the item, we can see – to the right or bottom for mobile – some stat increases on the item.<\/p>","content_image_path":"holy-items\/6CLpla8CJMcaZjBLqHVgED0iGx0g8gWnbFqHL7el.png","live_wire_component":"null"},{"order":10,"content":"<p>If we click the details button and scroll down to the Holy Information section, to the right or bottom for mobile, we can see that there is a holy stack applied to the item.<\/p>","content_image_path":"holy-items\/N2hjNG2fT8MN1KKcT1SHa7vSS0XeRYAATGNuRZlx.png","live_wire_component":null},{"order":11,"content":"<p>You can click the <strong>view information<\/strong> link and see to the right or bottom for mobile, the holy break down and each stack applied to the item.<\/p>","content_image_path":"holy-items\/xyGZXTL9ZKzvxcr5v9qdT1Hc9cgtQmmF8KWD50eI.png","live_wire_component":"null"},{"order":12,"content":"<h2>How these Effect your character<\/h2><p>Having a full set of Level 5 Holy Oils applied to your gear and applying the max amount of oils is beneficial to your character and can be seen on the character sheet if we click on the: Additional Information” Button – see image to the right or bottom for mobile.<\/p><p>If you are on mobile, click the plus icon on your character sheet to expand the top section to see this button.<\/p>","content_image_path":"holy-items\/nyhYpDi7bDnXJKOMW9j6sDJrh556chtv5v4nvnZm.png","live_wire_component":null},{"order":13,"content":"<p>If we open this and head to the Holy tab, see image to the right or bottom for mobile, we can see a total breakdown of how these effects out character.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy Base – the total % of the stacks applied.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy Stacks – the total applied and the total you can apply. Some character classes, like Ranger, have less stacks (240 as opposed to 280) they can apply because they are better suited with duel handed weapons over single handed.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy Attack Bonus – Applied to your attack bonus based on the stacks you have applied.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy AC Bonus – Applied to your AC based on the stacks applied.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Holy Healing – Applied to your healing based on the stacks applied.<\/p>","content_image_path":"holy-items\/MuebHyQmygODgTObsSLI86f3X2AZz8POQgJvQyBk.png","live_wire_component":null},{"order":14,"content":"<h2>Final Thoughts<\/h2><p>Having Holy Oils applied to your items makes fighting harder creatures easier.<\/p><p>When you apply Holy Oils to uniques and Mythics, the color of their name will not change, but applying to other enchanted gear WILL change the color of the item to a sky blue.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":28,"page_name":"where-to-start","page_sections":[{"order":1,"content":"<p>The core loop of the game is simple – and will grow over time as new features are added:<\/p><p>- Fight monsters, either manually or using <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">exploration<\/a> to get to level 1000<\/p><p>- <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">Craft<\/a> items and <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Enchant<\/a> them. (get both of these to level 400)<\/p><p>- <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Disenchant<\/a> items to get <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a> – get this to level 400.<\/p><p>- Complete <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">Factions<\/a> to get starter <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">uniques<\/a>. There are 5 levels to every faction.<\/p><p>- Complete <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a> to unlock new features and <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">planes<\/a>.<\/p><p>- Unlock <a href=\"\/information\/mercenary\" rel=\"noopener noreferrer\" target=\"_blank\">Mercenaries<\/a> and utilize the <a href=\"\/information\/slots\" rel=\"noopener noreferrer\" target=\"_blank\">slots<\/a> to gain more currencies to avoid the currency wall.<\/p><p>- Complete the quest Reach for the Stars (Labyrinth, one off quest) to <a href=\"\/information\/character-xp\" rel=\"noopener noreferrer\" target=\"_blank\">level past level 1000<\/a>.<\/p><p>- Get to Hell to interact wit the Queen of hearts and get top end uniques.<\/p><p>- Get <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Hell Forged<\/a> gear<\/p><p>- Get to Purgatory<\/p><p>- Level <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> to 200<\/p><p>- Apply <a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\">holy oils<\/a> to all your items – max out your Holy Stacks.<\/p><p>- Get Purgatory Chains gear after farming copper coins.<\/p><p>- Craft <a href=\"\/information\/trinketry\" rel=\"noopener noreferrer\" target=\"_blank\">Trinkets<\/a><\/p><p>- Get to Max Level<\/p><p><strong>Time to complete:<\/strong> Days\/weeks if you are hard core. Months if you are casual.<\/p><p>This is everything, if you do this list you will have made it to end game.<\/p><p>This is not an idle game. There is an idle feature for farming factions and currencies: Exploration. But this game requires more and more interaction to get to “end game.”<\/p><p>For example, there is no automation with Crafting and Enchanting or Trinket Crafting or even Alchemy.<\/p><p>Players have to actually click buttons every now and then to complete the above list, and some times you are clicking those buttons for a while to get to where you need top be to move on to the next item in the list.<\/p><h2>Enable the guide<\/h2><p>If you are new and just started, consider – if you have not – enabling the <a href=\"\/information\/guide-quests\" rel=\"noopener noreferrer\" target=\"_blank\">guide<\/a>. We walk you through some of this, we start you out simple and progress as time goes on introducing you to various game features.<\/p><p>There may not be a guide quest for every feature, but there is this help section that should answer all your questions and chat it’s self which will answer the rest!<\/p><p>The guide is the most essential thing a new player can have at their disposal, there are explicit instructions for both mobile and PC players.<\/p><h2>Take your time<\/h2><p>Some players can get through the content in no time, because they play a lot. That’s ok. Some players take months to get off Surface plane to the next one: labyrinth. That’s ok too.<\/p><p>This is a marathon, not a race. There are no cash shops and no way for you purchase anything that would give you an unfair advantage over another player, just length of play time.<\/p><p>Explore the features, take your time with each one. Read through the dark and forbidding quest line stories that all link together to tell and over arching story.<\/p><h2>Known when to use exploration<\/h2><p>Exploration is how we automate the tediousness of manual fighting. The important part to know is when to use it.<\/p><p>If you are farming currencies, levels or skill levels that’s one thing. But if you are using it to get to end game, you are not going to get very far.<\/p><p>The list above has aspects of actually interacting with the game and if all you do is buy shop gear and use exploration, sure you will get to level 1000, have some nice gold and lots of items, but you have missed out on 95% of the game.<\/p><p>The idea of your typical session should be:<\/p><p>- Set exploration to level and train a skill.<\/p><p>- Craft till your inventory is full.<\/p><p>- Enchant crafted items.<\/p><p>- As items from for your exploration, click on them in the Server message tab.<\/p><p>- Investigate these items and either move them to a set to keep for after your exploration or disenchant them.<\/p><p>This can take a while, again Guide Quests do help guide you in the right direction, but you have to go in that direction to progress.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":29,"page_name":"chat-commands","page_sections":[{"order":1,"content":"<p>When it comes to chatting in Tlessa, there is a couple rules to follow for chat which you can read all about <a href=\"\/information\/rules\" rel=\"noopener noreferrer\" target=\"_blank\">here<\/a>.<\/p><p>How ever there are a few commands that you can enter into chat. For example, if you want to know what a particular <a href=\"\/information\/npcs\" rel=\"noopener noreferrer\" target=\"_blank\">NPC<\/a> does you can message them like so: \/m NPCName: any message here.<\/p><p>They will then spit out a predefined messages, that tells you a bit about what they do. You never need to directly access or interact with an NPC, aside from doing <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a>, which auto <a href=\"\/information\/movement\" rel=\"noopener noreferrer\" target=\"_blank\">teleports<\/a> you to the NPC, even across <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">planes<\/a> – assuming you have access.<\/p><p>Another command has to do with <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a>. Celestials are creatures that have a higher chance to spawn once a week. These creatures are harder then monsters you can fight in the list of monsters and can appear at any time. However, once a week you have a higher chance to make one spawn just by moving around on the map.<\/p><p>These creatures can drop valuable <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Shards<\/a>, used in <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> – which is a skill you can unlock by doing a quest.<\/p><p>To see if there are any Celestials around you can type: \/pc This will spit out the location of any public Celestials.<\/p><p>If you have done the quest: Hunting Expedition – first quest on Surface, you will get a quest item that allows you to then type: \/pct. This allows you to teleport and traverse across planes to the celestial. Again this assumes you have access to the plane the Celestial is on.<\/p><p>The final chat command is: \/m PlayerName: message – or you can click on the player name in the chat box to private message them. The Creator can read all private and public messages, remember the rules.<\/p><p>Review:<\/p><ul><li>\/m PlayerName: message – allows you to private message a player<\/li><li>\/m NPCName: any message – allows you to see what that NPC is and what they do.<\/li><li>\/pc – allows you to see the location of any public celestial.<\/li><li>\/pct – allows you, assuming you have the quest item, to travel to the public celestial, also allows you to travel to the privately conjured celestial that you conjured. Will traverse across planes.<\/li><\/ul>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":30,"page_name":"character-stats","page_sections":[{"order":1,"content":"<p>When it comes to Tlessa, your stats are vital. There are two that you should focus on, one is called the To Hit Stat and the other is called the Damage Stat. For example, on your character sheet, you can see these stats. To the right (or bottom for mobile) is an image. For mobile players when you visit the character tab, you can expand the top section to see these details.<\/p><p>All characters, regardless of race or class need to train Accuracy to be able to hit anything, but you also have a stat, for example – focus – to be able to also hit.<\/p><p>To do optimal damage you will want to raise the damage stat, in this case: Charisma – or chr.<\/p><p>Raw vs Modified<\/p><p>There are two types of stats in Tlessa, Raw and Modified. On the game tab, at the top – which for mobile, you can expand, you will see a series of stats – see image to the right or bottom for mobile.<\/p><p>These stats are your modified.<\/p>","content_image_path":"character-stats\/KDjMfvZGLSzWLF8cbQcAzXA4cO3CIqUusmEZ96wa.png","live_wire_component":null},{"order":2,"content":"<h2>Raw vs Modified<\/h2><p>There are two types of stats in Tlessa, Raw and Modified. On the game tab, at the top – which for mobile, you can expand, you will see a series of stats – see image to the right or bottom for mobile.<\/p><p>These stats are your modified.<\/p>","content_image_path":"character-stats\/LVH4O2tCrLoHnJJm9dmN0Boz4jAlxqREjDK5u2N3.png","live_wire_component":null},{"order":3,"content":"<p>For your character sheet tab, you can expand the character section, if on mobile, and see a button a called (for both PC and mobile) Additional Information. See image to the right or bottom for mobile.<\/p>","content_image_path":"character-stats\/97Y8GiVFgyxn9R2a5fpGGCLemeCdtHAEqLhDlIhA.png","live_wire_component":"null"},{"order":4,"content":"<p>If you click this Additional Information Button, the first tab you will see is the stats tab where we show your raw stats, that is – with no equipment. And your modified stats – that is with equipment on.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"character-stats\/c936zrqhCIvYEfGrkA8FlWJJpbYRygmXdUBhGmBb.png","live_wire_component":null},{"order":5,"content":"<h2>What is Raw stats for?<\/h2><p>Raw stats are for nothing. If you unequipped all your equipment this is what your stats would be, they grow as you level effecting your modified stats over time.<\/p><h2>Ok, Whats Modified for?<\/h2><p>Modified stats, as stated before, come from base equipment. <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Enchantments<\/a> attached to said equipment, <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Uniques<\/a> or Mythics you have equipped, <a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\">Holy Oils<\/a> applied to said items and of course Boons from <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemical<\/a> items that you can craft.<\/p><p>All of these combined with your characters equipment raise your stats. The higher your stats the better to hit, the better damage you do. All equipment – even at a base level – with no enchantments, no uniques, no mythics – basically shop gear – can raise your stats.<\/p><p>Body gear, will always raise the stats higher then other gear, so if you are lost for what to equip, body and then weapon.<\/p><p>Enchantments and so on will raise those stats even higher. The higher the stat, the harder the critter you can fight.<\/p>","content_image_path":null,"live_wire_component":null},{"order":6,"content":"<h2>Final thoughts<\/h2><p>When it comes to gear, your drop rate from levels 1-10 (or looting skill is under 10%) are insane, you will get a lot of gear when you are first starting out, it’s all random – there are a ton of enchantments that can do a lot of things and the gear you get when starting out are all randomly generated with random enchantments when they drop from monsters.<\/p><p><a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">Crafting<\/a> and Enchanting will help you fine tune what type of gear, what type of enchantments. Alchemy comes in handy later with the concept of what types of Oils to apply to further increases the stats as well as items you can use on your self that last for a limited time to further increase stats and <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skills<\/a>.<\/p><p>This is a stats driven game, the higher the stats, the better the chance to kill harder creatures and thus get better rewards. The drops for equipment do scale as you get off the starting <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">plane: Surface<\/a>. In fact the gear – as you work your way down to Purgatory will scale to a max crafting level of 300, leaving you to craft the last 100 levels to get the best gear before moving on to the <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Hell Forged and Purgatory Chain gear<\/a>.<\/p><p>It takes time, effort and no real world money to get this far. All gear is randomly generated when it drops. Could be good, could be bad, but does scale with you to a specific point per plane.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":31,"page_name":"class-skills","page_sections":[{"order":1,"content":"<p>In Tlessa every class has one <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skill<\/a> that as it’s leveled over time will increase specific attributes about your character like damage, healing and Armour class.<\/p><p>Class skills, as they are leveled will apply these extra bonuses over time. Below is a table of class skills. Your class specific skill appear in your skills list on the character tab at the bottom called: Skills. For mobile players, on the character sheet you will select Skill Management.<\/p><p>The difference between class skills and regular skills is these are more geared towards your class, be it a physical, caster or more “ranged” class, like Rangers.<\/p>","content_image_path":null,"live_wire_component":"info.skills.class-skills"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":32,"page_name":"movement","page_sections":[{"order":1,"content":"<p>When its comes to interacting with the map in Tlessa, you have a few options on how to move around it. Be it teleport, traversing from one plane to the next. Directional movement or setting sail.<\/p><p>If you are on mobile you you can access the map, by selecting the Map Movement options.<\/p><p>Moving around the map allows to to move to other locations, find quest items at some of these locations, cross the seas, with the right quest item – and find a nice place to settle down and own a kingdom – if that’s your thing.<\/p><p>You can see the map, with the movement options to the right or bottom for mobile.<\/p>","content_image_path":"movement\/ISbFN51CBOXNQUsBtDSpizHRpR3RkY55txJf2yuM.png","live_wire_component":null},{"order":2,"content":"<h2>Movement Timeout<\/h2><p>When it comes to moving, there is a timeout that is applied between movements:<\/p><p>- 10 seconds between directional movements<\/p><p>- Variable timeout between 1-12 minutes for teleport\/set sail.<\/p><p>There is a skill: Quick Feet – which can reduce the movement timeout for teleport to a minimum of 1 minute.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<h2>Whats the point of moving around the map?<\/h2><p>It’s really meant to just allow one to role play and “explore” the world around them and as stated before you might want to find a empty space on the map to settle down and start a kingdom if that’s your thing.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":33,"page_name":"traverse","page_sections":[{"order":1,"content":"<p>When it comes to traveling across planes there is a slight requirement. Each plane requires a <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">quest item<\/a> to access it. For example to go from Surface to Labyrinth, you need to kill a <a href=\"\/information\/monsters\" rel=\"noopener noreferrer\" target=\"_blank\">Labyrinth Fiend<\/a> on Surface to get the Key of Labyrinth to drop, from there you can use the traverse option in the <a href=\"\/information\/movement\" rel=\"noopener noreferrer\" target=\"_blank\">map movement section<\/a> to select the Labyrinth plane and move to it.<\/p><p>New planes, means new maps, means new locations and monsters. Some <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Planes<\/a> like Shadow Planes, Hell and Purgatory make the monsters even stronger and can make you, the player, weaker. This means you need to focus on your gear through <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">crafting<\/a> and <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a> to overcome the new challenges.<\/p><p>The other benefit to traversing is that you can get better gear from drops, assuming your looting skill is high enough.<\/p><p>Each plane will allow you to get better gear – all randomly generated – through killing monsters. Each plane caps the level of gear you can get with Purgatory being level 300 crafting gear.<\/p><p>When you are ready to traverse you can click the “Traverse” button at the bottom of the map movement options. You can see the modal to the right or bottom for mobile.<\/p><p>For mobile players you will have to select Map Movement from the main actions sections and then select the traverse option under the map.<\/p><p>There is a 10 second movement with traversing.<\/p>","content_image_path":"traverse\/EaB2rGeOzZmqCVbDDleoMnNemKmD4qDL3BvQMNnD.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":34,"page_name":"set-sail","page_sections":[{"order":1,"content":"<p>Setting sail allows you to access two things:<\/p><p>- Other locations and parts of the map across large bodies of water until you kill a <a href=\"\/information\/monsters\" rel=\"noopener noreferrer\" target=\"_blank\">Pirate Master<\/a> and get a <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">Flask of Fresh Air<\/a>, which lets you walk on water.<\/p><p>- Access to the <a href=\"\/information\/market-board\" rel=\"noopener noreferrer\" target=\"_blank\">Market<\/a>, which you can get to through the hamburger menu at the top right and selecting Market.<\/p><p>When you are on a port, which is a blue ship icon on the map, the Set Sail option will be come available for you in the <a href=\"\/information\/movement\" rel=\"noopener noreferrer\" target=\"_blank\">map movement options<\/a>.<\/p><p>If you are on mobile, you will select Map Movement from the main actions drop down list and then if you are on a port location, you can you tap on the Set Sail button to open the modal which you can see to the right or bottom for mobile.<\/p><p>This allows you to select a new port to go to. Some ports have a quest item that can drop once you arrive at the location.<\/p>","content_image_path":"set-sail\/2e1L4scwu1sW4xhvQrfHhZGxl0Q3FmwEgZXA60gb.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":35,"page_name":"locations","page_sections":[{"order":1,"content":"<p>There six types of locations in the game, which you can see on the map image to the right or the bottom for mobile.<\/p><p>- Red icons are enemy kingdoms<\/p><p>- Blue icons (look the same as red enemy kingdoms) are your kingdoms<\/p><p>- Yellow icons (look the same as red\/blue) are NPC kingdoms.<\/p><p>- Pink Arches are locations and one per plane can be special locations.<\/p><p>- Blue ship icons are ports that you can set sail from.<\/p><p>Each location on the map, which for mobile players can be accessed from the main action section and selecting “Map Movement”, can be - for PC players only – clicked on to see more information, attack the red enemy kingdoms or teleport to. For the yellow NPC kingdoms you can click on them and purchase them.<\/p><p>For mobile players, you cannot tap on the locations but if you are on a location, you can tap on the “View Location Details” while on a location to view it’s details.<\/p>","content_image_path":"locations\/U68jRy2eZz4Lk6mMTqt8KoGF2nzl9hRXUoOy1VFE.png","live_wire_component":"info.locations.regular-locations"},{"order":2,"content":"<h2>Easy Way to get to locations<\/h2><p>One of the easiest way to move from location to location is via teleport, which from Map Movement for mobile players or the Teleport movement action, will give you a list of coordinates, enemy kingdoms, your kingdoms, npc’s and locations.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"locations\/1dNdLH8pjlkL8WwqyjjntaW5OOwMABvYVHyHvHOR.png","live_wire_component":null},{"order":3,"content":"<h2>Point of Locations?<\/h2><p>These give the players some where to go, or places to settle, or enemy kingdoms to attack. In the case of ports, players who cannot walk on water can move from one part of the map to the other.<\/p><p>As stated before, there is a special location per plane, that can drop quest items from the monsters killed. These locations can also have stronger monsters to fight.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":36,"page_name":"special-locations","page_sections":[{"order":1,"content":"<p>Special locations are locations on the map where the monsters, for that plane, are slightly stronger then ones you are use to fighting.<\/p><p>An example of a special location can be seen to the right or bottom for mobile.<\/p><p>These places drop specific <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">quest items<\/a> and there is one special location per <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">plane<\/a>. There is one caveat to these locations: <strong>You cannot use <\/strong><a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\"><strong>exploration<\/strong><\/a><strong> here to get the quest items to drop<\/strong>, they must be obtained by manually fighting monsters in these locations.<\/p><p>The quest items you get from these locations can be used in <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a> that further unlock aspects of the game.<\/p>","content_image_path":"special-locations\/fuX2l7gTdt17YAKtulKFpho4mDzky5aQkyYPgnVl.png","live_wire_component":"info.locations.special-locations"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":37,"page_name":"market-board","page_sections":[{"order":1,"content":"<p>There is one place in Tlessa where players can trade with each other for gold. This place only accepts items that have <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchantments<\/a> or holy oil applied to them. <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Uniques<\/a> and Mythics can also be sold here.<\/p><p>The market board is a public trading hall for all players across all <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">planes<\/a>. Players can generally sell their items for what ever price they wish, some items like Uniques or Mythics have set minimum prices that you cannot sell for less then. For example a Unique that’s worth 50 billion gold will not let you sell it for less then 50 billion gold.<\/p><p>The main catch is you have to be a <a href=\"\/information\/locations\" rel=\"noopener noreferrer\" target=\"_blank\">port location<\/a>, a blue ship icon on the map, to access the market board.<\/p><p>Once there you can click the top hamburger menu icon in the top left to expand the menu and click on market to either sell or buy items.<\/p><p>For example, to the right or bottom for mobile, you can see that the player is on a blue ship icon location – otherwise known as a port.<\/p>","content_image_path":"market-board\/QdMTGdpxiBc5d9gwAOGvB7kj6yRneBaEueUgTgJ6.png","live_wire_component":null},{"order":2,"content":"<p>When you visit the market, by clicking the hamburger menu at the top and selecting market – and clicking Visit Market, you will see the – to the right or bottom for mobile – the market listing section.<\/p><p>You can see there is a chart of the items that have sold and what they have sold for, and a list of items at the bottom that you can purchase.<\/p><p>You can compare the item to what you currently have equipped to see if its better or not before buying the item.<\/p>","content_image_path":"market-board\/Zb8q3p6l8O3wCrmubR919Ob55DhQdi23aa5LR3nt.png","live_wire_component":null},{"order":3,"content":"<h2>Selling Items<\/h2><p>When you want to sell items there are two ways to do it, from the Server Messages – in the chart section – when the item drops or from your inventory.<\/p><p>For the purposes of this document we will sell the item from our inventory, however, these same steps can be followed when the item drops while fighting monsters.<\/p><p>First, we want to head to our inventory on the Character Sheet tab. If you are mobile, you can head to the same tab: Character Sheet and select Inventory Management to manage your inventory.<\/p><p>Lets sell a unique to the market, as you can see the item in our inventory to the right or bottom for mobile.<\/p>","content_image_path":"market-board\/WEIUX0SCLrylcBcHSCUDJuoapffLpO5039CzLKQM.png","live_wire_component":null},{"order":4,"content":"<p>Lets now click the item to see not only the details but the actions, the one we care about is list. You can see this to the right or bottom for mobile.<\/p>","content_image_path":"market-board\/BNtnIU3r7Cri8GgtQ1zpbybmkYBYoDOTlz6i5Gnf.png","live_wire_component":null},{"order":5,"content":"<p>Here, at the bottom, you will click\/tap the list button. This will then open a new modal that lets you list the item for a predefined price. In this case – to the right or bottom for mobile, you can see we already have a predefined minimum price of 100 Billion Gold.<\/p><p>You can of course list the item for more then this, but not less then this.<\/p><p>The chart you see above the listing price, is to show you what the item was sold for in the past to give you an idea of what you want to sell the item for.<\/p>","content_image_path":"market-board\/51MFlKlspuU8Dal7Ev26TL5Zz8m92K6lDHE7wqDN.png","live_wire_component":null},{"order":6,"content":"<p>Now that we have listed the item how do we see our listings? You can click the hamburger menu at the top left, select market and select view listings.<\/p><p>Here you can see, to the right or bottom for mobile, your listings. You can remove the listing or edit the listing if you find that your item is not moving fast enough.<\/p>","content_image_path":"market-board\/8nqdgy9jlocXt9utmcOv3EWBGtR1QZ1ARBa9xtIf.png","live_wire_component":null},{"order":7,"content":"<p>When it comes to editing your listing, it is similar to listing an item. As you see to the right or bottom for mobile, the editing page is similar to that of listing an item from your inventory or chat. Editing your item will lock the item to prevent other people from buying the item while you are editing the listing. After listing it will go back to the market with the new price.<\/p>","content_image_path":"market-board\/RSCZ6IcUoeStmtVlsKtSCq78vsfhsl95qb25JIbY.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":38,"page_name":"guide-quests","page_sections":[{"order":1,"content":"<p>Tlessa has a way of helping new players through the game. This can be enabled when registering or through the character <a href=\"\/information\/settings\" rel=\"noopener noreferrer\" target=\"_blank\">settings<\/a> while the character is under level 10.<\/p><p>Should you choose to reset your character, which again can be done through the settings section, you can also choose to enable the guide quests.<\/p><p>Guide quests are designed to hold players hands with explicit instructions and a bit of story as well as reward the player with gold and item after completing the quest.<\/p><p>We start off with having you kill a creature to get to level 2, move on to crafting, enchanting and quests as well as quest items.<\/p><p>There are quests for kingdoms to guide you through some of that process and then we move on to getting you off the Surface plane to Labyrinth to explain what it means to traverse.<\/p><p>All the stories for the guide quests link together to tell a little over arching story.<\/p><p>The key difference between guide quests and regular quests is that they can be ignored and do not really unlock additional features aside from teaching new players the ropes of the game.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Accessing the Guide Quests<\/h2><p>When a new player registers and chooses to enable the guide quests, they will see a pop up that appears after logging in. We only show this pop up once, after that you can access the guide quests from the button in the navigation as seen to the right or bottom for mobile.<\/p>","content_image_path":"guide-quests\/2KpEda0XAIHybeeYfskar1z0jv05u9i4244rMHkB.png","live_wire_component":null},{"order":3,"content":"<p>Clicking on the button will show you the guide quest so you can access the information needed. You can see this to the right or bottom for mobile. As you might be able to notice the Hand In button is disabled. This becomes enabled once you have completed all the requirements.<\/p><p>The first section is the requirements and the the guide quest, followed by two tabs, the story – which is optional to read and the instructions tab.<\/p>","content_image_path":"guide-quests\/ubXFcAl1FJ0Eyk3mZw8qaBypzMWRxu1b6CMcXJ4U.png","live_wire_component":null},{"order":4,"content":"<p>If you switch over to the instructions tab, to the right or bottom for mobile, you will see that we have a section that has explicit instructions on how to complete the quest.<\/p><p>If there are instructions for mobile, you will see both PC and Mobile instructions to complete the quest.<\/p><p>This section can also have links to the help document, which will open in a new tab for you to read more information on the part of the game you are being introduced to.<\/p>","content_image_path":"guide-quests\/cilMCMhRcoNAYVzyFz4rUktR22NNLAGlx5fG6jyn.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":39,"page_name":"trinketry","page_sections":[{"order":1,"content":"<p>There is one set of gear that will help with monsters in <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a> as well as with <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">optional PVP<\/a>. These are called trinkets.<\/p><p>Players may only have two trinkets equipped at any one time. These cannot have <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchantments<\/a> or <a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\">holy oils<\/a> applied, this also includes <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">uniques<\/a> and mythic enchantments.<\/p><p>Trinkets offer two pieces of stats: <a href=\"\/information\/ambush-and-counter\" rel=\"noopener noreferrer\" target=\"_blank\">Ambush and Counter<\/a>.<\/p><p>Ambush, in its simplest form let you get the attack on the enemy or the enemy to get the attack on you – these cannot be blocked and use your weapon damage to ambush the enemy before you click one of the five attack buttons.<\/p><p>There is also ambush resistance to allow the enemy to resit your ambush, and the trinkets also allow you to have an ambush resistance to resist the ambush attempt by the enemy.<\/p><p>The second aspect of trinkets is Counter, which allows you or the enemy to counter the others attack directly after they attack. The attack is done with your weapon in the case of your counter. Much like ambush there is also a chance to resist the counter.<\/p><p>Creatures in purgatory have a chance to counter and ambush and resist both, but how do you get these items? Can you buy them? Sell them?<\/p>","content_image_path":null,"live_wire_component":"info.items.craftable-trinkets"},{"order":2,"content":"<h2>Crafting Trinkets<\/h2><p>The only way to get trinkets is to:<\/p><p>- First get access to purgatory through a series of <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a> – you must complete Purgatories Doors to get access,<\/p><p>- Complete the quest in Hell: The Magic of Puergatory to be able to collect one of the currencies you need: Copper Coins.<\/p><p>- Kill creatures in Purgatory to get <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Copper Coins<\/a>.<\/p><p>- Gather Gold Dust through <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">disenchanting<\/a> enchanted items.<\/p><p>- Craft them.<\/p><p>There is a crafting <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skill<\/a> called trinketry and below you can see a list of trinkets.<\/p><p>Once you have met the requirements, you can start crafting them. First you must select the Trinketry crafting option from the craft\/enchant section. You can see this to the right or bottom for mobile.<\/p><p>If you are on mobile, you will select Craft from the actions drop down on the main Game Tab, and then you will see the craft\/enchant drop down.<\/p>","content_image_path":"trinketry\/rEu2CEIvUTTFghoYEGirphc0SZbIZlFA4M1ubHzU.png","live_wire_component":null},{"order":3,"content":"<p>Once you open the trinket section, you can select a trinket to craft, you will only have one to craft at first, see the table above to see the crafting levels required.<\/p><p>See the image to the right or bottom for modal.<\/p>","content_image_path":"trinketry\/64lfBbwhFuOeaHMto0zZ8bmruSfI6RB3ozdKcWQ6.png","live_wire_component":null},{"order":4,"content":"<p>Once you have crafted an item you will see the server message update as you can see to the right or bottom for mobile.<\/p>","content_image_path":"trinketry\/YbGg4MZ2ULSrdFlw8JCZ0W5rNu3UCJa2IhxjAxuA.png","live_wire_component":null},{"order":5,"content":"<p>Clicking on this will show you the item stats, as you can see there are four:<\/p><p>- Ambush chance<\/p><p>- Ambush Resistance<\/p><p>- Counter Chance<\/p><p>- Counter Resistance.<\/p><p>You can see this to the right or bottom for mobile.<\/p><p>Having two trinkets will stack the chance and resistance. Although, you can only have a max of 95% for both of chance and resistance.<\/p>","content_image_path":"trinketry\/wK9L61wrDnEeWGacwtptqBvANHLxJWluDqcWEONE.png","live_wire_component":"null"},{"order":6,"content":"<p>Once you equip the item, lets head over to the Character Sheet tab and, for mobile – expand the top section – you will see the Additional Information button.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"trinketry\/EWrmXfgiHFSW9mUAWbW9n1AQ2DkNU6CacIbtQkYL.png","live_wire_component":null},{"order":7,"content":"<p>Clicking this will bring up a modal with additional information such as <a href=\"\/information\/character-stats\" rel=\"noopener noreferrer\" target=\"_blank\">stats<\/a>, holy, <a href=\"\/information\/voidance\" rel=\"noopener noreferrer\" target=\"_blank\">voidance<\/a> and ambush and counter.<\/p><p>What we care about is the ambush and counter tab, so lets head over there and you can see the image to the right or bottom.<\/p><p>Here you can see your current ambush and counter information based on the trinkets you have equipped.<\/p>","content_image_path":"trinketry\/QtyUb3tedllwLVcxInvA1oQMo9KxAM35R5mI5nD8.png","live_wire_component":null},{"order":8,"content":"<h2>Selling Trinkets<\/h2><p>While crafting you may end up with a lot of trinkets. So what do you do with the ones you don’t equip? You cannot enchant them to then disenchant them and as you may have seen above, you cannot sell them to the shop.<\/p><p>You can list them to the <a href=\"\/information\/market-board\" rel=\"noopener noreferrer\" target=\"_blank\">market<\/a> for the Gold Dust cost x 100 gold.<\/p><p>If you want you can also destroy them instead of listing them to the market.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":40,"page_name":"monthly-pvp-event","page_sections":[{"order":1,"content":"<p>Tlessa offers players a way to test their strength against another player, or in this case set of players, through the Monthly Pvp Event<\/p><p>Every month, at the end of the month, a new button will appear in your actions section. This is completely optional, and you do not have to participate.<\/p><p>Those who do get a prize for losing and the winner gets a mythical prize.<\/p><p>To join click the Join Pvp Button (see image to the right, bottom for mobile), select the attack style and click join.<\/p><p>Between 8am GMT-6 and 6:30 GMT-6 you will have the option to join and change your attack type.<\/p>","content_image_path":"monthly-pvp-event\/VZKu9Ml8JQvw6jUzpICSPxUh8HPzlHSI3xDYC7jR.png","live_wire_component":null},{"order":2,"content":"<h2>6:30 GMT-6 – FIGHT!<\/h2><p>At 6:30 GMT-6, there is a 15-minute window for you to get ready. You MUST be logged in to participate, registering will not guarantee you a spot, only being logged in during the event, are you able to participate.<\/p><p>After the 15-minute timer is done, you will be teleported to the Arena which is a new location that players cannot enter.<\/p><p>Your screen will refresh so that all dialogues and so on are closed. You will be told when you are being moved and of the 15-minute window you have left to prepare.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<h2>During the Attack<\/h2><p>Once the fighting starts, everything is automated, you wont be able to move or attack creatures. All players will be re-ordered from lowest level to highest, then they fight.<\/p><p>For example, the defender, if defeated will see the following – to the right or bottom for mobile, which indicates they have been attacked. As per the usual <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">PVP<\/a> fight – they will be moved away from the arena and have a two minute timeout from being attacked again.<\/p><p>The winner of said fight, will move on to fight the next player and because they, the winner, has defeated the other player – they have a chance, for every win, to get a Mythic item – which is better then a 100 billion Unique and can even be re-rolled and have it’s enchantments moved to your gear through the <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Queen of Hearts<\/a>.<\/p>","content_image_path":"monthly-pvp-event\/tuUCgZ7xGNRT1vYtCrB4ILuEZhpt5yDpwiPEclAl.png","live_wire_component":"null"},{"order":4,"content":"<h2>After the Event<\/h2><p>Once the event the last player standing gets fifty-billion gold and a Mythic Unique. A global message goes out congratulating that player.<\/p><p>After which 4 <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestial<\/a> Kings: Surface, Labyrinth, Dungeons and Shadow Planes will spawn. This is first killed first serve concept, like other Celestials.<\/p><p>These kings are balanced for their planes and are the strongest of their plane for Celestials.<\/p><p>Players who manage to kill one have a chance to get a Mythic Unique, the roll is the same as for killing a player, how ever you get to apply a max of 15% of your looting skill towards the chance.<\/p><p>Celestial kings cannot be conjured and cannot spawn when celestials spawn weekly.<\/p>","content_image_path":"monthly-pvp-event\/Zqr5IC2qeCnfKAnM7RVPCAIUWKovBgpNTcnlb3Cd.png","live_wire_component":"null"}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":41,"page_name":"shop","page_sections":[{"order":1,"content":"<p>When it comes to equipment and where to purchase it, there is a general shop in the game that sells equipment such as weapons, amour, rings and spells.<\/p><p>The equipment you can buy here only goes to a max price of 2 Billion gold, however, player can <a href=\"\/information\/crafting\\\" rel=\"noopener noreferrer\" target=\"_blank\">craft<\/a> higher then that – around 36 Billion in gold, making crafting better then shop gear.<\/p><p>The shop also allows you to sell items from your inventory, clearing up space in your inventory for more items.<\/p><p>New players will have the drop rate in their favor to get them some randomly <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanted<\/a> gear, around their level to begin with until the player is level 10 or their looting is 10%.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<h2>Accessing the shop<\/h2><p>When a player wants to buy new gear, they can open the menu through the hamburger menu at the top and select the shop, as seen to the right or bottom for mobile.<\/p><p>Here you can either buy or sell items. All items you can sell must be in your inventory and not in a set or equipped.<\/p>","content_image_path":"shop\/orpK883HXSDOT6mUD6lNLPuhN3NQRmv8SyRtqKiz.png","live_wire_component":null},{"order":3,"content":"<h2>Buying equipment<\/h2><p>When it comes to buying equipment, you want to select buy from the menu above. Here you can see that there are a series of items, see image to the right or bottom for mobile, and the ability to compare or buy them.<\/p><p>You can also filter the items from the filter drop down by type or search for a specific item.<\/p>","content_image_path":"shop\/xMnH9tks8GhvF34Jne5qWWogd8oKPXRFUO1W84Bn.png","live_wire_component":null},{"order":4,"content":"<h2>Comparing items<\/h2><p>When buying items you can click the compare button to compare the item to what you currently have equipped.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"shop\/LvoytQOC1fQvwiPhjbjcU8ZERWfyjSsH8riIwJfj.png","live_wire_component":null},{"order":5,"content":"<p>You can also, as you see to the right or bottom for mobile, that you can click on the View item Details and view more details about the item.<\/p>","content_image_path":"shop\/NQqIv0A9ZSaGV79r7JEUtfY7RFV3DhmoM3LK8oYM.png","live_wire_component":null},{"order":6,"content":"<h2>Selling Items<\/h2><p>There are three ways to sell items from your inventory in the game, One is to use the shop and click on sell and see a list of your items that are not equipped and not in a set that you can sell. You can see this to the right or bottom for mobile.<\/p>","content_image_path":"shop\/hMQkpWIvJlsZtTYF7GAUQsMjMsBrCOFxcpC782SB.png","live_wire_component":null},{"order":7,"content":"<p>Another way to sell items is to head to the Character Sheet tab and select Sell All from the actions. For mobile players, you will go to the character sheet and select Inventory Management from the drop down.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"shop\/PwQ36J47V2kfT2ceBKWfilz05fWxc1NiUVexxj0H.png","live_wire_component":null},{"order":8,"content":"<p>The final way to sell items is to click on the item in your inventory, again for character on mobile, head to the character sheet tab, click Manage Inventory and from there you can tap on the item so see the image to the right or bottom for mobile.<\/p><p>Here you will have a sell action. This same action will appear on items that drop from enemies and appear in the Server messages tab of the game section.<\/p>","content_image_path":"shop\/a1YMwBsqePDwov04GJOI45Nyw891JWx6AM5Zstdv.png","live_wire_component":null},{"order":9,"content":"<h2>Final Thoughts<\/h2><p>The max gold you will get back from any single item is 4,000,000,010 Gold, this includes <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">uniques<\/a> and mythics that you sell to the shop, where the enchantments can go above 2 Billion gold.<\/p><p>You cannot sell <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy Items<\/a>, <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">Quest Items<\/a> or <a href=\"\/information\/trinketry\" rel=\"noopener noreferrer\" target=\"_blank\">Trinkets<\/a> to the shop.<\/p><p>Some items such as <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Hell Forged<\/a> and <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory Chains<\/a> with enchantments as well as uniques and Mythic items should be sold on the market to make the most gold back.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":42,"page_name":"equipment-sets","page_sections":[{"order":1,"content":"<p>Tlessa offers a way for players to store gear like mythics or <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">uniques<\/a> or other sets of gear they wish to equip or even treat sets as stash tabs.<\/p><p>The difference between a stash tab and a set is that one cannot be equipped but the other can be equipped, provided it follows a set of rules:<\/p><p>- Hands: 1 Weapon and 1 Shield. Or 2 Weapons. Or 1 Two handed Weapon<\/p><p>- Armour: 1 of each type<\/p><p>- Rings: 2 Rings<\/p><p>- Spells: 2 Spells<\/p><p>- Trinkets: 2 Trinkets<\/p><p>- Uniques: 1 Unique or 1 Mythic<\/p><p>For the last one: Uniques, you cannot have 1 Unique Glove and another Glove, this would make the set unequipped and thus become a stash tab. The Unique or Mythic can be of any type.<\/p><p>You can see to the right, or bottom for mobile, that sets are stored in the inventory section. To access this head to the Character Sheet and if on mobile, select Inventory Management from the drop down on that tab.<\/p><p>From here you can select the Sets tab to view your sets.<\/p>","content_image_path":"equipment-sets\/M1hPmYgdRS3em76xCJGOGrkfSKn1sLdx4dfxpwQ7.png","live_wire_component":null},{"order":2,"content":"<p>The Sets tab has two primary drop downs, one is the list of your sets, every character has 10 sets that can hold an unlimited amount of items unless you are looking to turn them into sets of equipment in which you intend to equip or if they are treated as stash tabs, can hold an unlimited number of items.<\/p><p>Sets do not count towards your inventory limit in the same way the quest items tab also does not count towards your inventory amount. Equipped items also do not count towards your inventory limit.<\/p><p>You can see to the right or the bottom for mobile the image for the list of sets.<\/p>","content_image_path":"equipment-sets\/bFKU6gAQXQEpu9Q5UwBVRFlKmmpLDQD8zG5CCunJ.png","live_wire_component":null},{"order":3,"content":"<p>One thing to note is that there is different colors in the list of sets, for example – as seen to the right or bottom for mobile, we can see 2 different colors:<\/p><p>The swords colored Gold means you cannot equip the set as it violates the rules, again this is fine it’s just that we now treat this as a stash tab.<\/p><p>The background of Equipped is set to green, this means the set is currently equipped, more on equipped set in a moment.<\/p>","content_image_path":"equipment-sets\/PsOg4wB31imuQrDZeyTbWuZslL5SwOcon7eZkgZO.png","live_wire_component":null},{"order":4,"content":"<p>The other primary drop down is the actions drop down, which you can see to the right or the bottom for mobile.<\/p><p>You can rename a set what ever you like with in a twenty character limit.<\/p><p>You can also empty the contents of the set assuming you have contents to empty or the set is not equipped.<\/p><p>Finally, assuming you are allowed and the set does not violate the above rules, you can equip the set, which will replace all equipped items with that set’s items.<\/p><p>This allows the player to have multiple types of sets of equipment, Maybe you have one for Armour crafting, one for enchanting and one for combat.<\/p>","content_image_path":"equipment-sets\/dn4xgfzMjtumHjGqEJBLjhRVZ5f9hvbBcjr2E4Vt.png","live_wire_component":null},{"order":5,"content":"<h2>Moving Items to Sets<\/h2><p>When an item drops or you are managing your inventory you will see an action in the items details modal, which you can see to the right or bottom for mobile.<\/p><p>This allows you to move an item to the set of your choosing, any set accept that which is currently equipped.<\/p>","content_image_path":"equipment-sets\/oyxrRe6Dgo4coFtBmrUlt24NT47saoo6aI2h8kYt.png","live_wire_component":null},{"order":6,"content":"<p>As you can see to the right or the bottom for mobile, you can click on move and select the set, we even give you the rules so you know that if you are moving an extra glove to equipment set that you might make it unequippable.<\/p>","content_image_path":"equipment-sets\/CjqMeJInxl87UWQ3cothVvBXNK0JjZDEDP7p1IhP.png","live_wire_component":null},{"order":7,"content":"<h2>Equipping Sets and Replacing Items<\/h2><p>There are two ways you can equip sets, one is to equip all the items you want and click save as set on the equipped tab which will save all the items you have to a set of your choosing, assuming that set is empty.<\/p><p>See the image to the right or the bottom for mobile.<\/p><p>The other way is to head to the sets tab and select a set that is equippable and click Equip Set from the actions drop down as shown above.<\/p><p>If you do the second approach while having items equipped those items will be unequipped and either placed back into your inventory or if you have another set equipped, it will be unequipped.<\/p><p>If you find a new item that is better then what you have equipped or maybe you created the item through crafting and enchanting and you have a set equipped, you can choose to equip that item.<\/p><p>This will replace the item of that type in the already equipped set and put the item, from the set, into your inventory. This allows you to replace items in your set on the fly while it’s equipped.<\/p>","content_image_path":"equipment-sets\/rYvMEZEzWo2s9ynVXq8hIhPAypDZkurGVoi5vnD5.png","live_wire_component":null},{"order":8,"content":"<h2>Final Thoughts<\/h2><p>Sets are valuable to players who want to hold onto specific gear, save specific equipment as specific sets for specific use cases such as crafting, enchanting, fighting and so on or to experiment with different enchantments.<\/p><p>You get ten sets as as stated before they can hold unlimited number of items.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:13.000000Z","updated_at":"2023-08-08T18:45:13.000000Z"},{"id":43,"page_name":"equipment","page_sections":[{"order":1,"content":"<p>When it comes to managing your equipment in Tlessa the core war to do it is through the inventory system.<\/p><p>You can access this through the Character Sheet tab. For players on mobile you will select Inventory Management from the drop down on this tab.<\/p><p>From there you will see to the right or bottom for mobile, the inventory image.<\/p><p>There are a few ways to get gear in Tlessa:<\/p><p>- The <a href=\"\/information\/shop\" rel=\"noopener noreferrer\" target=\"_blank\">shop<\/a>, which only sells items up to a maximum of Two Billion gold.<\/p><p>- <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">Crafting<\/a> which allows you to craft items up to 36 Billion Gold.<\/p><p>- Buying Specialty gear from the <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Hell Forged Shop in Hell or Purgatory Chains in Purgatory<\/a>.<\/p><p>- Random drops from enemies.<\/p><p>- Purchasing items from the <a href=\"\/information\/market-board\" rel=\"noopener noreferrer\" target=\"_blank\">market<\/a> from other players.<\/p><p>- <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Uniques<\/a> such as those from The Queen of Hearts and from <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">factions<\/a>.<\/p><p>- Mythics from <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">pvp<\/a> and <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a><\/p><p>In the inventory you can manage things like <a href=\"\/information\/equipment-sets\" rel=\"noopener noreferrer\" target=\"_blank\">sets<\/a>, your equipment, <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">alchemy<\/a> items and view your quest items.<\/p>","content_image_path":"equipment\/NuWPdnAHAEN3c74va5K91aT0a3Ck1GxTncEbbYNc.png","live_wire_component":"null"},{"order":2,"content":"<p>As you can see above we have some items, and we want to equip the item, so how do we do that?<\/p><p>First click on the item and you will see – to the right or bottom for mobile – the item we wish to equip. We can see some basic stats about the item, actions below the item and even, in this case, a comparison tab.<\/p><p>The item details will also show affixes and what they effect when you equip the item.<\/p>","content_image_path":"equipment\/PWQAjOez66NobnUCyEm6MxdFDdZCArJWLei0f92E.png","live_wire_component":null},{"order":3,"content":"<p>If we click on the comparison tab we can see the comparison of this item against what you currently have equipped.<\/p><p>See the image to the right or bottom for mobile.<\/p><p>This comparison tab will also show information about attached affixes and how it effects the item in relation to the item you want to equip,<\/p>","content_image_path":"equipment\/Cbnkp0WJdQcKi2Xk1U227AmwEQSWMEd4zWahKJma.png","live_wire_component":null},{"order":4,"content":"<p>If we want to equip the item, we should click the equip button to bring up a new modal – see image to the right or bottom for mobile – you will see that we have two options, left or right hand.<\/p><p>In the case of things like rings or spells you will see ring one\/two or spell one\/two. For Armour, with the exception of shields, you wont get to select the position as it’s already selected for you such as body, leggings, feet, sleeves, gloves and helmets.<\/p>","content_image_path":"equipment\/Iyfw0OceLVkUIAH87XJKK22na0WJKqtewvP4ojq4.png","live_wire_component":null},{"order":5,"content":"<p>Once the item is equipped we can click on the equipped tab and see what we have equipped, in this case we already have some items equipped, see image to the right or bottom for mobile.<\/p><p>The items we have equipped in the image, is from what we call a set. If we would have equipped the item above, we would have replaced an item in the set we have equipped. Read more about sets here to understand their uses.<\/p>","content_image_path":"equipment\/yjXrVfaAkgSSwjhHLQ4jblvsYw1gTnub1GXTxgdL.png","live_wire_component":null},{"order":6,"content":"<p>With the equipment section, as you saw above, we can see what items we have equipped. We can even unequip the item, but if the item is in a set, you will unequipped the whole set. If the item is not in a set it will just be removed and placed back in your inventory.<\/p><p>One thing we can do here is click on the item and, as you can see to the right or bottom for mobile, let you see the item details including attached affixes and holy oils that you attached.<\/p><p>If you want to see item details out side of the equipped section you can click the Details buttons in the item modal (see above where we have actions in the item modal) to see the same details.<\/p>","content_image_path":"equipment\/SfbkojlcQuH4y8aXAGlIs0nEb0nQ47xJD2xJ048d.png","live_wire_component":null},{"order":7,"content":"<h2>Final Thoughts<\/h2><p>Managing your equipment is meant to be straight forward, you have items in your inventory which take up a specific amount of space, one item takes one inventory space and characters only have 75 spaces in their inventory. Alchemy items also take up space in your inventory.<\/p><p>The only things that do not take up space is quest items, equipped items and sets.<\/p><p>There are a lot of items in the game, including those that are randomly generated such as those from drops. Each item affects your character in it’s own way. Some effect your character in good ways and bad ways, for example an item might have really good stats but might effect the wrong skill or a skill you don’t need. Its all apart of how random drops are created.<\/p><p>You can craft and enchant items to effect your stats, apply holy oils to the items and even move uniques and mythic enchantments to those items to make them even more powerful.<\/p><p>Equipping items is easy, knowing what to equip is the learning curve.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":44,"page_name":"npcs","page_sections":[{"order":1,"content":"<p>NPCs are characters in the game that you inadvertently interact with. Be it through <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">The Queen of Hearts<\/a> <a href=\"\/information\/crafting\" rel=\"noopener noreferrer\" target=\"_blank\">Crafting<\/a> section to roll and purchase new uniques or when you purchase an <a href=\"\/information\/npc-kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">NPC kingdom<\/a>.<\/p><p>Some you interact with through the quest system when completing <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a>.<\/p><p>NPC’s can be interacted with by typing:<\/p><p><strong>\/m NPCName: message<\/strong><\/p><p>The NPC will then spit out a predefined message which you can see to the right or bottom for mobile.<\/p><p>Players do not need to message the NPC to complete actions or initiate actions, all the actions can be found through out the game, such as applying <a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\">Holy Oil<\/a> to items in purgatory, Accessing the Queen of Hearts in Hell or <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Conjuring Celestials<\/a>.<\/p><p>NPC’s are designed to give the world a little more life, but are also more background characters who tell a story when completing quests.<\/p><p>Below you can see a list of NPCs and basic data about them.<\/p>","content_image_path":"npcs\/1byJjdYigWGmL0nniTMMoC4h2cakf7OoCndweTIh.png","live_wire_component":"admin.npcs.npc-table"}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":45,"page_name":"npc-kingdoms","page_sections":[{"order":1,"content":"<p>In Tlessa when a kingdom is abandoned or neglected for longer then 90 days, the kingdom will fall into ruin. During this time the kingdom will turn from blue to yellow, or red to yellow.<\/p><p>A yellow kingdom is up for grabs, any one, any where can purchase the kingdom or wage war on the kingdom and take it for their own.<\/p><p>As you can see to the right or the bottom for mobile, there are a series of yellow kingdoms. Each one of these is a NPC kingdom, probably abandoned by their owner or neglected over time and fallen into ruin.<\/p>","content_image_path":"npc-kingdoms\/IJk5MTEox2tGNFwFOqKryns3WkpC4ypgqNRTV8PL.png","live_wire_component":null},{"order":2,"content":"<p>When you click on one, or if you are on mobile and visit a NPC kingdom and click View Location Details, you will see some details about the kingdom, as you can see to the right or bottom for mobile.<\/p><p>Here you can purchase the kingdom.<\/p><p>The same rules for purchasing an NPC kingdom apply to settling a kingdom, its 10,000 Gold * the amount of kingdoms you currently own across all planes.<\/p><p>If you own no kingdoms and you purchase a NPC kingdom, it will be free, much like settling a kingdom.<\/p><p>You can also see that you have the option to attack the NPC kingdom and take it by force.<\/p><p>If the kingdom was abandoned due to neglect, it could still retain all it’s walls, building levels and units. Those units and the associated defense bonuses will still defend and fight for the kingdom when you attack it, best to save your units and just purchase the kingdom.<\/p>","content_image_path":"npc-kingdoms\/CblJt5OCuS0Q2b5u2ZmSvu09xINgbWZ6VdAR5Rdo.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":46,"page_name":"kingdom-passive-skills","page_sections":[{"order":1,"content":"<p>There are two forms of skills for Kingdoms when it comes to kingdoms that give bonuses. One is the Kingdmanship <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skill<\/a> which give bonuses to:<\/p><p>- Unit Recruitment – to help reduce the time.<\/p><p>- Building Time – to reduce the time a building will take<\/p><p>- Unit Movement – to help reduce the time units take to move between one location to another either for attacking or reinforcing other kingdoms.<\/p><p>This skill can be found on your Character Sheet tab under the skill section. For mobile players you will go to your Character Sheet tab and select Skill Management from the drop down.<\/p><p>The Kingmanship skill is one you can train, like Accuracy, while fighting monsters and sacrificing a percentage of XP..<\/p><p>The second set of skills can only be trained over a course of hours, these are called passives and can be found in the same manner, accept when looking at your list of skills you will select the tab: Kingdom passives.<\/p><p>Here you can see a tree like structure, similar to quests, that show you all your kingdom related passives. You can see this to the right or bottom for mobile.<\/p><p>Each one of these takes real world hours to level. The max level for most skills is 5, meaning it can take a couple days to max all of them out and because it’s a tree like structure you must work your way down from the top.<\/p><p>Blue means you can train the skill and red means you need to level the parent to the appropriate level.<\/p><p>Each skill doubles its time when you level it, thus each additional level takes longer and longer to level.<\/p><p>Below is a table of all the passive skills.<\/p>","content_image_path":"kingdom-passive-skills\/ZGGpoc75aznN40iHd9WvLUSf6rciQhU6IehDyvaz.png","live_wire_component":"admin.passive-skills.passive-skill-table"},{"order":2,"content":"<p>When you click on a passive in the tree, you can see some basic information along with the ability to train the passive.<\/p><p>As you can see to the right or bottom for mobile.<\/p>","content_image_path":"kingdom-passive-skills\/agBpW95GkqdTnBJlRLZ4BqdUIFpHyaPnGd7B06sW.png","live_wire_component":null},{"order":3,"content":"<p>Once you click train you will see a timer bar at the bottom of the skill tree which will show you how much time you have left until the skill is done training. You can log out and come back at a later time and this skill will either still be training or be done training.<\/p><p>You can see this to the right or bottom for mobile.<\/p><p>If you are logged in and the skill finishes training you will see a server message appear in the chat section under the Server Messages tab to tell you which skill has finished training.<\/p>","content_image_path":"kingdom-passive-skills\/gO83vZ58MPYDZCfW17NemV5jR4bXkMWmXskbqlzn.png","live_wire_component":null},{"order":4,"content":"<p>Should you want to cancel the skill that's currently training, click the skill name again in the tree and click Stop Training.<\/p><p>If the skill would take 10 hours to train, and you cancel at the 5 hour mark, you will have to start all over again for training when you decide to train the skill again, we do not keep track of elapsed time when you decide to cancel.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":47,"page_name":"items-and-kingdoms","page_sections":[{"order":1,"content":"<p>When you want to attack kingdoms, there are two ways to do it, via items that you can craft through <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> or through full on attacking.<\/p><p>In this document we will discuss how to use items on kingdoms, be they <a href=\"\/information\/npc-kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">NPC kingdoms<\/a> or <a href=\"\/information\/attacking-kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">Enemy kingdoms<\/a>.<\/p><p>To use an item you must first find a kingdom you wish to use it on, as you can see to the right or bottom we have an enemy kingdom on our map.<\/p><p>If you are on PC you can click on the kingdom to initiate using items, or if on mobile you can move to the kingdom it’s self and then click View Location Details to initiate the process.<\/p><p><strong><u>The core reason you would use items on a kingdom that is not your own, which is the only way you can use an item, is to damage the kingdom.<\/u><\/strong><\/p><p>Damaging the kingdom can make it easier to then attack and send in Settlers to take the kingdom.<\/p><p>Items will damage both units and buildings in a 50\/50 split. That is if you use one item to do 100% damage to a kingdom it will do 50% to the building and 50% to the units.<\/p><p>The only thing holding you back is the enemy kingdom defense. If the kingdoms defense is over 100%, we deduct 5% from the damage you would do, for every 5% over 100% of the defense the kingdom has.<\/p><p>For example if a kingdom has 325%, your items damage will be reduced by a maximum of 45%. You can of course use multiple items on a kingdom.<\/p><p>If a kingdom has a defense bonus of 101% your damage will be reduced by 5%.<\/p><p>We will discuss this more below.<\/p>","content_image_path":"items-and-kingdoms\/AUMcZ4bjFUvBOl1G2xDflwplPDPb9fRC3dTuceE8.png","live_wire_component":"info.alchemy-items.alchemy-kingdom-items-table"},{"order":2,"content":"<p>Lets click on or move to and View Location Details of the kingdom if you are on mobile. Once you do, you will see the image to the right or bottom, this is what an enemy kingdom looks like.<\/p><p>You can see the defense break down and the various aspects that make up the defense of the kingdom as well as the kingdoms Treasury and Gold Bars to see if its worth taking the kingdom on.<\/p><p>You will also see a red button called Attack, which is how we initiate the item dropping process.<\/p>","content_image_path":"items-and-kingdoms\/rHc78ubhLQlwZOQPdeUuG31yq6wzv2ozXidwWd02.png","live_wire_component":null},{"order":3,"content":"<p>Clicking on the attack button will show us, to the right or bottom for mobile, a new dialogue. Here you can see that we can either use items or attack the kingdom by sending in units.<\/p><p>For the purposes of this document, we want to use items on the kingdom.<\/p><p>Before we do that, we need to understand what items we can use on the kingdom, these are items that are considered kingdom damaging items, which you can see a list of below, and can only be crafted via alchemy.<\/p>","content_image_path":"items-and-kingdoms\/uC5VauwwjSsTdSTCf6rUd2a4vCKCqzQjabtgHPRs.png","live_wire_component":null},{"order":4,"content":"<p>For example, here is an item that we will use on the kingdom it’s self. You can see this to the right or bottom for mobile.<\/p><p>This item does 100% damage to the kingdom, but remember, that’s 50% to the buildings and 50% to the units. If you wanted to wipe everything out and make it super easy to take, you would need to use at least two of these items.<\/p><p>If we look above to the image of the enemy kingdom, we see their defense is only 28% So we suffer no damage reduction when using the items.<\/p>","content_image_path":"items-and-kingdoms\/4MIkkCQL74oj1TNHYX2H2FhB6RF6xkljRB9twmzp.png","live_wire_component":null},{"order":5,"content":"<p>Lets go back to attacking the kingdom with an item. Let’s click the attack button and select the item we want to use, you can see this to the right or bottom for mobile.<\/p>","content_image_path":"items-and-kingdoms\/1F7uzOKhT0PtFVF1zBN33BHHDtBxtnodL2zTy166.png","live_wire_component":null},{"order":6,"content":"<p>Now that you selected the the item to use, you can see the total damage we will do the kingdom it’s self.<\/p><p>See image to the right or bottom for mobile.<\/p><p>Now click use items, you can of course select multiple items at a time to use.<\/p>","content_image_path":"items-and-kingdoms\/bd5vBXkdBmhI1QOiOBLaayIabxzyuTwVzqj9fVQ4.png","live_wire_component":null},{"order":7,"content":"<p>Once an item has been used a couple things will appear:<\/p><p>First a global message goes out to every one, letting them know the devastation that you have wrought upon the kingdom.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"items-and-kingdoms\/iK58dsEcC41yCmYpB6tQyQASGuUse7hKSGa1jYhb.png","live_wire_component":null},{"order":8,"content":"<p>Next you will see a log has been generated, which you can also see to the right or bottom for mobile. A small scroll icon will appear beside your kingdoms tab. One will also be generated for the defending kingdom owner, unless it is a NPC kingdom.<\/p>","content_image_path":"items-and-kingdoms\/MuGfyOXnfufhFPZNQHlX9KqCs8VDieM3qwDxJm4a.png","live_wire_component":null},{"order":9,"content":"<p>If we head over to the kingdom tab and click on it you will see that you have a log, which is seen to the right or bottom for mobile.<\/p>","content_image_path":"items-and-kingdoms\/Ue5Cme4xF5aJJsOWOvaiCWq4tstXzeCXGuL1dwpt.png","live_wire_component":null},{"order":10,"content":"<p>Let’s open the log and view the details of it.<\/p><p>See image to the right or bottom for mobile.<\/p><p>This log will show you the damage you have done, it will look that same for the defending kingdom.<\/p><p>Because some buildings durability cannot evenly be divided by 50%, you will sometimes see buildings that took 1% over or under the 50% of the damage used.<\/p><p>The defending kingdom will see their own morale loss in their log. Using items to destroy buildings and units can effect the morale of the kingdom and if it’s low enough you can send in settlers to take the kingdom.<\/p>","content_image_path":"items-and-kingdoms\/18euKqA6AGpC01v1Bw0vCFl2hXPGJrIvylsPTtro.png","live_wire_component":null},{"order":11,"content":"<h2>Final Thoughts<\/h2><p>The idea behind items and using them on enemy kingdoms, is to reduce the morale, reduce the buildings and units and make it easier for you to send in your own units and settlers to attack and therefor take the kingdom as your own.<\/p><p>Using items increases the chances of you taking the kingdom. It does not damage things like Treasury or Gold Bars.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":48,"page_name":"attacking-kingdoms","page_sections":[{"order":1,"content":"<p>You might have settled a kingdom and now you have some units, some buildings, some passives trained and you are ready to set out and start taking over other peoples kingdoms.<\/p><p>How exactly do you do this?<\/p><p>If you are on mobile, you will have to be on a enemy kingdom, which you can see to the right or bottom for mobile as the red icons on the map.<\/p><p>If you are on mobile and on the enemy kingdom, you can click View Location Details to view the enemy kingdom details and have access to attacking it.<\/p><p>If you are on PC, you can click on any enemy kingdom or even NPC kingdom, which you can also see as yellow icons on the map to attack the kingdom.<\/p>","content_image_path":"attacking-kingdoms\/DK4zFtGZFV4aXVCd6c7mvE6nkmlK5FudRrDtOczS.png","live_wire_component":null},{"order":2,"content":"<p>If you click on a enemy kingdom and do not see the attack button, as with the kingdom image to the right or bottom for mobile, this will indicate the kingdom it’s self is still under protection and cannot be attacked.<\/p><p>If you, yourself, have a kingdom under protection, you cannot attack from it.<\/p>","content_image_path":"attacking-kingdoms\/oXjv3FY0rpnAMUHoTDX5xtsDxHQ0Wx2nVgLwH59G.png","live_wire_component":null},{"order":3,"content":"<p>Kingdoms you can attack will have the red Attack button, as you can see to the right or bottom for mobile.<\/p>","content_image_path":"attacking-kingdoms\/P0GbcU0ONUjcO6QQ0ZPXB4keSC1GgLkmcF2JvEZv.png","live_wire_component":null},{"order":4,"content":"<p>From here if you click Attack, and select the Send Units tab, you will have an option to select which kingdoms you want to send units from. You can send units from multiple kingdoms.<\/p><p>You can see this to the right or bottom for mobile.<\/p><p>The only kingdoms that will show here, in this drop down list, are those that you own on the current plane you are attacking from. You cannot attack cross plane.<\/p><p>Only your non protected kingdoms will show here.<\/p>","content_image_path":"attacking-kingdoms\/nPTnQz43frJ5T3y28C0K15brwNxHqdBI0wJ1YWLd.png","live_wire_component":null},{"order":5,"content":"<p>Once you have selected your kingdoms you will now see, to the right or bottom for mobile, a set of units along with the inputs to allow you to state how much you want to send. If you selected multiple kingdoms, you will have multiple sections with multiple inputs.<\/p>","content_image_path":"attacking-kingdoms\/Y2St8JFCZTsF8X7TGxNMmjcBkUINST34wwgc9VUO.png","live_wire_component":null},{"order":6,"content":"<p>Now lets send the units to attack, once you click Send Units, you will see a global message go out in the Chat tab, which you can see to the right or bottom for mobile.<\/p>","content_image_path":"attacking-kingdoms\/sSHoOmVHQ3md0awnPnKB5rAz6GTg8DRPPtUyM9cN.png","live_wire_component":null},{"order":7,"content":"<p>The defender will also see a message in their server message section, which you can see to the right or bottom for mobile.<\/p><p>You will also have a similar message in your Server Message tab tel;ling you that you launched an attack. In All, three messages go out, two server messages and one global message.<\/p><p>No emails will go out alerting the defender of an incoming attack.<\/p><p>Both of these will tell you which kingdom is being attacked and who is attacking the kingdom.<\/p>","content_image_path":"attacking-kingdoms\/gCSgM5C6bPZmtAlfHcDAAPVyfB5Cte1vUQuEtBGB.png","live_wire_component":null},{"order":8,"content":"<p>For the Attacker, they can head to their kingdoms tab and see, to the right or bottom for mobile, any kingdoms that are both moving, the green path icon, and attacking – the red axe icon.<\/p>","content_image_path":"attacking-kingdoms\/niNCjISICCCuNBPKAtQ9EjjqTHH03yJyQhmBvV81.png","live_wire_component":null},{"order":9,"content":"<p>If you click on this kingdom and head to the unit movement section, you will see that you have units in movement towards the kingdom. You can of course cancel this if you wish and your units will return back to your kingdom.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"attacking-kingdoms\/jgD2WgOXVt1nK6wK6cIlRPnb52jbS3BAMz4yVNe2.png","live_wire_component":null},{"order":10,"content":"<p>Once the attack lands, your kingdom logs will update, you can see this to the right or bottom for mobile.<\/p><p>Your kingdom tab will update to show a scroll, clicking on this will show the same scroll on the log section, which will not go away until you open or delete the unopened logs in your kingdom log section.<\/p>","content_image_path":"attacking-kingdoms\/EH6mgOjS8A6WKqy36PP4OrqjUp7AoLf6uoeoe9vn.png","live_wire_component":null},{"order":11,"content":"<p>If we then open the log, for the attacker, we will see some details including how much damage we did to the opponents buildings, units and your own units.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"attacking-kingdoms\/e210A3knvoxvbNK5WCwbAk94iy6EoK0vrxXzULuv.png","live_wire_component":null},{"order":12,"content":"<p>The defender will also get a log that details the kingdom buildings damage, the units damaged and the percentage of your units that were lost.<\/p><p>An example of this can be seen to the right or bottom for mobile.<\/p>","content_image_path":"attacking-kingdoms\/Fc4SsZYjNrFD71e33jaL6WNy4uVFFVDJIh4RMepe.png","live_wire_component":null},{"order":13,"content":"<h2>Sending In Settlers<\/h2><p>Settlers are a unit you can recruit from the Settlers Hall, which is a building you can upgrade to gain access to them.<\/p><p>Settlers can either reduce the morale of the kingdom, or outright take the kingdom. If you only send a settler unit and no other units, they will trip on a rock and die.<\/p><p>Settlers must be sent with other units, such as spearmen, swordsmen or other non siege based military units.<\/p><p>Sending multiple settlers will not reduce the morale more then one settler would, in other words, you can send 10 settlers but only one will reduce the morale or only one will take the kingdom, the other 9 will be lost.<\/p><p>- If the settler only reduces the morale that unit will be lost.<\/p><p>- If the settler takes the kingdom he is now the “duke” or “mayor” of that kingdom<\/p><p>- If the units you sent all die, then the settler will also die – assuming he was the last unit standing.<\/p>","content_image_path":null,"live_wire_component":null},{"order":14,"content":"<h2>Final Thoughts<\/h2><p>Attacking kingdoms lets you take other players kingdoms, lets you show off your strength of your armies and gets you more land, more kingdoms, more treasury as you get everything from the kingdom when you send settlers.<\/p><p>Attacking kingdoms can be done anytime, anywhere for any reason.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":49,"page_name":"kingdoms","page_sections":{"0":{"order":1,"content":"<p>Tlessa offers a way of passive pvp. The way this is done is through kingdoms. Kingdoms can be settled by any one, any time, any where (with some exceptions).<\/p><p>As you can see to the right or bottom for mobile, the map is full of three types of kingdoms:<\/p><p>- Red kingdoms are <a href=\"\/information\/attacking-kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">enemy kingdoms<\/a><\/p><p>- Yellow kingdoms are <a href=\"\/information\/npc-kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">NPC kingdoms<\/a><\/p><p>- Blue kingdoms are your kingdoms.<\/p><p>You can settle a kingdom if:<\/p><p>- It is two spaces in any direction away from pink arches or blue ship icons as these are locations players can enter.<\/p><p>- If you have no kingdoms, the cost will be 0.<\/p><p>- If you have kingdoms, even across planes, the cost will be 10k * the amount of kingdoms you own in gold.<\/p><p>You can also purchase NPC kingdoms, but clicking on a NPC kingdom (on PC) and clicking purchase.<\/p><p>For mobile players, you will have to be on the NPC kingdom to then tap on View Location Details to then purchase the kingdom.<\/p><p>The purchasing cost of NPC kingdoms is the same as settling a kingdom, 0 Gold if you have no kingdoms or 10k * Kingdom amount for each additional kingdom.<\/p><p>Your very first kingdom will be protected for 7 days from being attacked in any form. Any additional kingdom you settle beyond your first will not have protection.<\/p><p>You must manually walk your kingdoms every so often or they can fall into neglect and become NPC kingdoms.<\/p><p>- If a kingdom is not walked for 30 days, that is physically moving your character to that kingdom, you will loose 10% morale every hour on that kingdom on the 30<sup>th<\/sup> day.<\/p><p>- If a kingdom has not been walked for 90 days or more then the kingdom will fall into ruin and become a NPC kingdom.<\/p><p>Every hour kingdoms update, this means we update the treasury, the morale and heal some of the buildings from damage caused by war.<\/p><p>Kingdoms do not and never will, reset. Once you settle a kingdom, the only way to lose it, is through war or neglect or abandonment.<\/p><p>These are the basics of kingdom management, now lets get into the aspects of managing a kingdom.<\/p>","content_image_path":"kingdoms\/WHYPJM8yEyGvj5bqcHy9ce3dOVsnizkLSyzV6PUq.png","live_wire_component":null},"1":{"order":2,"content":"<p>When you want to view your kingdoms, you have a Kingdoms tab that you can click on which will show you all the kingdoms you have for that plane.<\/p><p>You cannot manage kingdoms cross plane.<\/p><p>Here, as you can see to the right or bottom for mobile, you can see we have two kingdoms.<\/p><p>One is currently under our seven day protection and the other one is not.<\/p><p>As stated before kingdoms under protection cannot be attacked and they cannot attack other kingdoms.<\/p>","content_image_path":"kingdoms\/1p6IerCSBiqgPhIoMs68Rlp3FMDr5ONAif9Of8Xp.png","live_wire_component":null},"2":{"order":3,"content":"<p>If we want to manage our kingdom we simply just have to click o the kingdom name and now we will see the following information, to the right or bottom for mobile.<\/p><p>We have basics of the kingdom such as the name, location, treasury and gold bars.<\/p><p>We also have a defense break down section and resources our kingdom has. We can also accumulate resources and treasury every hour during the update.<\/p><p>We also see we have some actions we can do on this kingdom:<\/p><p>- Changing the name<\/p><p>- Calling for reinforcements from other kingdoms on the same plane that you own.<\/p><p>- Buying additional population.<\/p><p>- Managing Gold Bars<\/p><p>- Managing your Treasury<\/p><p>- Abandoning the kingdoms<\/p><p>Buying additional population.<\/p><p>Buying additional population comes with a caveat. Your kingdom has a maximum population it’s allowed to have with out you upgrading the Farm building, which we will get into later.<\/p><p>If you buy more population, which is done with gold, then you are allowed to have and the kingdom hourly reset comes about you will anger the The Old Man who will:<\/p><p>- Attempt to take the cost of the additional population * 10,000 Gold out of your treasury.<\/p><p>- If you do not have the treasury he will attempt to take the cost out of your Gold Bars.<\/p><p>- If you do not have the Gold Bars, he will attempt to take it out of your own characters pockets.<\/p><p>- If you do not have the gold, he will destroy the kingdom completely.<\/p>","content_image_path":"kingdoms\/DjiYhb0N6Uuo8HwvgvqbiWrRMJEbLgmFcUicMca8.png","live_wire_component":null},"5":{"order":5,"content":"<h2>Managing Gold Bars<\/h2><p>Gold bars requires you to unlock the Goblin Bank Passive which then unlocks the Goblin Bank building, which you then have to level to level 5 before you can purchase Gold bars.<\/p><p>What are Gold Bars? It’s 2 Billion Gold turning into a bar that you can have 1000 of which also add to your kingdoms defense.<\/p><p>The treasury of a kingdom can only have 2 billion gold and a character can only have 2 trillion gold on them at any one time, so Gold Bars allow you to store excess gold and give your kingdom a defense bonus boost per gold bar.<\/p>","content_image_path":null,"live_wire_component":null},"6":{"order":6,"content":"<h2>Abandoning Kingdoms<\/h2><p>You can abandon a kingdom even if its protected, this will turn it into a NPC kingdom that any one can take.<\/p><p>If you have Gold Bars, the kingdom is under attack or you have units moving towards it from calling for reinforcements, you wont be able to abandon the kingdom.<\/p><p>If you are attacking another kingdom, you wont be able to abandon it.<\/p><p>If you abandon the kingdom you wont be able to settle another one for 15 minutes.<\/p>","content_image_path":null,"live_wire_component":null},"7":{"order":7,"content":"<h2>Managing Buildings<\/h2><p>On your kingdom details section, as seen above in the image you have a couple additional tabs to the right hand side. Buildings, Units and Unit Movement.<\/p>","content_image_path":"kingdoms\/QfiVOJusBqJufstBT1Y9iBVps5hRLsOD1cVhbN8R.png","live_wire_component":null},"8":{"order":8,"content":"<p>We can click on a building to see its details and we have three options, as you can see to the right or bottom for mobile:<\/p><p>- Upgrade with gold<\/p><p>- Upgrade with resources<\/p><p>- Repair Buildings<\/p><p>Upgrading with gold will allow you to use your gold to upgrade the building as many levels until max. If you need additional population that will be calculated into the cost.<\/p><p>You can see this to the right or bottom for mobile.<\/p><p>The time it takes to upgrade is determined on the building and any passives you have leveled and the skill level of your kingmanship skill.<\/p><p>Upgrading with resources will only use the current kingdom resources which will replenish every hour, by a specific amount determined behind the scenes. You cannot upgrade further then your resources or population allow when upgrading with resources.<\/p><p>Finally, you can repair the building for the cost in resources if the building is damaged. If the building has no durability left – you will not be able to upgrade the building till you repair it.<\/p><p>When you upgrade or repair a building, the timer for how long until the building is finished, will show in the table list of the buildings for that kingdom.<\/p>","content_image_path":"kingdoms\/sFFF2gO6mjSogPYmSb0jeqcnBCuB43ou5xqUpkI8.png","live_wire_component":null},"9":{"order":9,"content":"<p>As you can see in the list below there are a series of buildings that your kingdom can upgrade. Should any of the buildings in the list, be colored red it means that you need to unlock the building through leveling the appropriate kingdom passive, such as Calvary Training Grounds, Cannoneer Shop and Goblin Coin bank.<\/p><p>You can see these locked buildings to the right or bottom for mobile.<\/p><p>If you click on them building it will tell you what you need to do in order to unlock the building. The passives you would need to train are named after the building you wish to unlock.<\/p>","content_image_path":"kingdoms\/k5KzwmwZQ8KKEorZlX1Mt7uJ5iJuBUiJV4WgChbn.png","live_wire_component":"admin.kingdoms.buildings.buildings-table"},"10":{"order":10,"content":"<h2>Managing Units<\/h2><p>While you are looking at the kingdom details for a specific kingdom, one of the other tabs is your units.<\/p><p>You can see this to right or bottom for mobile.<\/p><p>As you can see some of the units are locked, this could because of a couple reasons:<\/p><p>- You need to level the appropriate building up to the required leveling, which you can see in the list below of units.<\/p><p>- You need to unlock the building through the kingdom passives and then, in some cases, level the building before being able to recruit the unit.<\/p>","content_image_path":"kingdoms\/XD4mBzerJXA1oG5rRlNpuUEvxoltCH7GGhx4A2sO.png","live_wire_component":null},"11":{"order":11,"content":"<p>As you can see to the right or bottom for mobile, you have options for recruiting units when you click on a unit that you can recruit.<\/p><p>There are two ways you can recruit units:<\/p><p>- Through resources<\/p><p>- Through gold<\/p><p>Neither of which will allow you to recruit more units then you have population for. This is where you can purchase more population as discussed above.<\/p><p>You can recruit a total of one million units and purchase two million population.<\/p><p>One thing to keep in mind is that with out leveling the kingmanship recruiting vast amounts of units could take days, months even years to recruit them.<\/p><p>Kingmanship allows the time for recruiting as well as moving the units to be reduced by a percentage based on the skill level.<\/p><p>Some passives skills will also reduce the cost of units in terms of population needed.<\/p><p>Below we have a list of units you can recruit and the requirements for recruiting those units.<\/p>","content_image_path":"kingdoms\/SIxwkG5VC6EmaNhTOcMawTLHYyR7gbMftQYlP0lT.png","live_wire_component":"admin.kingdoms.units.units-table"},"12":{"order":12,"content":"<h2>Kingmanship and Passives<\/h2><p>When it comes to managing your kingdoms there are two important systems to take into consideration that effect all your kingdoms, weather you lose all your kingdoms and settle new ones or retain your existing kingdoms.<\/p><p>Kingmanship is a <a href=\"\/information\/skill-information\" rel=\"noopener noreferrer\" target=\"_blank\">skill<\/a> you can train by killing monsters and sacrificing a portion of your XP towards the skill to level it over time.<\/p><p>This skills will effect your unit recruitment time, building time reduction and unit movement time reduction.<\/p><p>Your <a href=\"\/information\/kingdom-passive-skills\" rel=\"noopener noreferrer\" target=\"_blank\">passives<\/a> can effect multiple things such as new buildings that get unlocked, how much population is required for upgrading buildings or recruiting units and defense bonuses which of course apply to all your kingdoms.<\/p>","content_image_path":null,"live_wire_component":null}},"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":50,"page_name":"events","page_sections":{"0":{"order":1,"content":"<p>Tlessa offers events, with more being added over time. These events play out sometimes weekly, some times monthly and all reward the player for participating.<\/p>","content_image_path":null,"live_wire_component":null},"2":{"order":2,"content":"<h2>Celestial Spawn Event<\/h2><p>Every week on Wednesday at 1pm GMT-6 Celestial creatures have an 80% chance to spawn regardless of plane. <strong>This event last 24 hours<\/strong>.<\/p><p>Players who completed the first Surface <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>, Hunting Expedition, can use a command in chat called \/pct.<\/p><p>Typing that in and hitting enter will instantly teleport you to the celestials location and plane, provided you have the quest items to not only go to the plane but the location the celestial is at.<\/p><p>Killing celestials rewards you with gold and items as well as <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">shards<\/a>, which are used in <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a>.<\/p>","content_image_path":null,"live_wire_component":null},"3":{"order":3,"content":"<h2>Currency Drop Event<\/h2><p>Every week on Sundays at 8am GMT-6, every monster can drop 1-10 Gold Dust, Shards and Copper Coins regardless of plane. <strong>This event runs for 24 hours<\/strong>.<\/p><p>You will need to complete the <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>: The Magic of Purgatory in Hell to get Copper Coins. These <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currencies<\/a> will drop from any monster on any plane, excluding celstials.<\/p>","content_image_path":null,"live_wire_component":null},"4":{"order":4,"content":"<h2>Monthly PVP event<\/h2><p><a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\">Every month at 8am GMT-6 players can choose to participate in PVP<\/a>. They can do this by clicking the new Join PVP button that appears in the action section, or from the action drop down for mobile players.<\/p><p>This event is completely automated, once you select to join you will select your attack.<\/p><p>Starting at 6:30PM GMT-6 those players, not in exploration, will be teleported to the PVP arena on surface and be ordered by lowest to highest level.<\/p><p>From here each player will fight. The loser gets a 50 Billion <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Unique<\/a> and 2 Billion Gold for participating, the last person standing gets 500 Billion gold and a <a href=\"\/information\/gear-progression\" rel=\"noopener noreferrer\" target=\"_blank\">Mythic<\/a>.<\/p><p>All of this is automated, so you don’t have to be logged in, however, after the fight the Celestial Kings spawn, there are 1 for each plane: Surface, Labyrinth, Dungeon and Hell.<\/p><p>These have a small chance to drop Mythics when killed.<\/p>","content_image_path":null,"live_wire_component":null}},"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":51,"page_name":"slots","page_sections":[{"order":1,"content":"<p>Tlessa has a system that allows players to gamble for <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currencies<\/a>. All players regardless of level have access to the slots, which can be seen in the action section (to the right or bottom for mobile) or in the actions drop down for mobile players.<\/p><p>Slots allow you to play for Gold Dust, Shards and Copper Coins, with a small caveat: Players who have not completed the <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>: The Magic of Purgatory in Hell will not get any copper coins even if they match on them.<\/p>","content_image_path":"slots\/ieWBKJy0aHuGYZphhKROMH2XcUUVQFLjw1OwTHbz.png","live_wire_component":"null"},{"order":2,"content":"<h2>Playing Slots<\/h2><p>When you open the slot section you will see, to the right or bottom for mobile, Icons and a spin button. It costs 1 million gold per spin.<\/p><p>To win anything from the slots you must <strong>match two or three<\/strong> on the following:<\/p><p>- Gold Dust<\/p><p>- Copper Coins<\/p><p>- Shards<\/p><p>If you match two, you will get <strong>250 of that currency<\/strong>.<\/p><p>If you match three, you will get <strong>500 of that currency<\/strong>.<\/p>","content_image_path":"slots\/IjGae94OgtH6Nufzo00YpCCe8FG1Wljr1cyjTbOI.png","live_wire_component":"null"},{"order":3,"content":"<h2>Utilizing the Mercenary System<\/h2><p>Gambling is no fun unless you unlock the <a href=\"\/information\/mercenary\" rel=\"noopener noreferrer\" target=\"_blank\">mercenary<\/a> feature and level them up.<\/p><p>By default the prizes are low, but with the mercenary system you can level up specific mercenaries that give bonuses to the currency they are named after and get even more rewards, which you can see to the right or bottom for mobile.<\/p><p>For example, with mercenaries if you have a max level, max reincarnated Child of gold dust and the Child of gambling you can get up to:<\/p><p>72k For matching all three or 36K for matching two.<\/p>","content_image_path":"slots\/ek3kWwBqja2JSiinhF49oIRZau0zCLVssIy6c3aP.png","live_wire_component":"null"},{"order":4,"content":"<h2>Final thoughts<\/h2><p>Slots are a fun and easy way for players to get some currencies while their character is in Exploration, pair it with the Mercenary system and currency farming will be made even easier with more rewards.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":52,"page_name":"mercenary","page_sections":[{"order":1,"content":"<p>Tlessa has a way for characters to gain more <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currencies<\/a>, quicker and faster through the use of Mercenaries, which lives on your Character Sheet – as you can see to the right or bottom for mobile.<\/p><p>Mercenaries require players to unlock them through a <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a> in Labyrinth. The quest line is easy to new players who have access to Labyrinth.<\/p><p>The quest line starts with the quest: The story of the children.<\/p><p>After you complete this quest line you will have unlocked mercenaries. It is suggested players do this as quickly as they can to farm valuable currencies such as Gold Dust, Shards and (if you have completed the quest The magic of Purgatory in Hell) Copper Coins.<\/p>","content_image_path":"mercenary\/qSEplYQjQ1lovEAMK8xc6ncdsRhlgb3cytjCx4Y3.png","live_wire_component":"null"},{"order":2,"content":"<h2>The Children<\/h2><p>There are four mercenaries you can purchase, each for 10 million gold.<\/p><p>- Child of gold dust – increases gold dust as you level them<\/p><p>- Child of shards – increases shards as you level them<\/p><p>- Child of copper coins – increases copper coins as you get them.<\/p><p>- Child of gambling – Increases rewards when using the slots – stacks with the other children.<\/p><p>When you purchase a mercenary, you can see them in the table, as shown above, and you can also click on the name, as show to the right or bottom for mobile, to see the details.<\/p>","content_image_path":"mercenary\/1ihzLnfxbSKtVZs98z45UGvJBLKZtI1LKHoIJlRw.png","live_wire_component":null},{"order":3,"content":"<h2>Leveling up the mercenaries<\/h2><p>As you fight monsters, mercenaries will gain 25XP per kill. If you have 4 of them, all 4 will gain the 25XP per kill.<\/p><p>It requires 1000 XP to level them one level.<\/p><p>The best way to level them is through <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a>.<\/p><p>Leveling a mercenary, increases the bonus given, which is then applied to any action, with the exception of quest rewards, that would give you that currency.<\/p><p>For example if you purchase the Child of gold dust and do a lot of enchanting, leveling this mercenary means you get even more gold dust per disenchant.<\/p><p>There are 100 levels for each mercenary, meaning a grand total bonus of 100% for the currency the child adds a bonus to.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":4,"content":"<h2>Reincarnating your mercenaries<\/h2><p>All mercenaries can be reincarnated, this means when a mercenary reaches level 100, you can click the name to see the details and the reincarnate button will be enabled for you.<\/p><p>It costs 500 shards to reincarnate a mercenary and they can be reincarnated 10 times.<\/p><p>This means, which you reincarnate, that the mercenary in question is reset to level one, you will then repeat the leveling process again to now get a total bonus of 200%<\/p><p>Repeat this 9 times to get a total bonus of 1100%<\/p>","content_image_path":null,"live_wire_component":null},{"order":5,"content":"<h2>Final Thoughts<\/h2><p>mercenaries are a great way to help with the currency wall a lot of players will eventually encounter. The grind that is required is rewarded by giving you more and more currencies through any action – again with the exception of quest rewards – to get even more of that currency type.<\/p><p>Pairing mercenary system with <a href=\"\/information\/slots\" rel=\"noopener noreferrer\" target=\"_blank\">slots<\/a>, gives you even more currencies when you match 2 or 3 of the currency type.<\/p><p>This is because the Child of gambling and the Child of (currency name here) will stack giving you a grand total of 2200% when you spin, match and get your currency reward.<\/p><p>Using mercenaries and slots, or mercenaries and Gold Mines special location or even Purgatory Dungeons will give you more currencies then you know what to do with.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":53,"page_name":"reincarnation","page_sections":[{"order":1,"content":"<p>Tlessa allows players to reincarnate their character, therefor setting the character level back to level one to re-level the character. This is useful for growing your character overtime, beyond stats and gear.<\/p><p>A player can reincarnate as many times as they want, provided they have completed the quest line, which starts in Hell: The story of rebirth.<\/p><p>Upon completing the quest line, players will be able to use the big blue Reincarnate button on the Character Sheet (for mobile players, expand the top section of the character sheet and scroll down).<\/p><p>Reincarnation is useful for handling <a href=\"\/information\/ranked-fights\" rel=\"noopener noreferrer\" target=\"_blank\">Ranked Fights<\/a>.<\/p><p><strong>Players also need to complete<\/strong>:<\/p><p>- Reach for the stars in Labyrinth – which is a one off <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest<\/a>.<\/p><p>- Be the current months max level to reincarnate. (not level 1000, the level changes after you complete the above quest.)<\/p><p>Every month the level in Tlessa increases by 100 (until we eventually hit 9,999) as a result the max level cap increases and you have to be at that new level to reincarnate.<\/p><p>Players who have reincarnated once or more, have to also make their way back to max level to do it again.<\/p><p><strong>What does this feature do?<\/strong><\/p><p>When you reincarnate, which costs: <strong>50,000 Copper Coins per reincarnation,<\/strong> your character is:<\/p><p>- Set back to level 1<\/p><p>- We take 20% of your base stats (with no modifiers) at the level you reincarnate and add them to your level 1 stats. This caps out at 999,999.<\/p><p>- You will gain an xp penalty of 5% every time you reincarnate, this stacks.<\/p><p>Lets say you are level 4800 and want to reincarnate, assuming your raw stats are roughly 4700, we take 20% of that and add it to your base raw stats at level 0ne, which is ~1000 stat points.<\/p><p>This means instead of starting at level 1 with base stats of 10-20, its now 950-1020.<\/p><p>This also means you need 100 + 100 * 5% to gain a level.<\/p><p>Repeat this step – assume you reincarnate at 4800 again, and now you have starting stats that are roughly 2k and now need: 100 + 100 * 10% to gain a level.<\/p><p>Reincarnating your character, essentially, allows you to grow their stats over time higher and higher and allows you to take on stronger and stronger critters.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<h2>When should I reincarnate?<\/h2><p>As stated, when ever you want. The most optimal way is to get to the max level before the end of the month, reincarnate on the first day of the next month and repeat.<\/p><p>How ever, since the stats cap at 999,999 – you can do this at level 2000, 3000, 1000, 500 – When ever you want.<\/p><p>This is because we take the 20% and then add that to your new stats when you reincarnate, and then take 20% of those stats + the levels on top and now you have more stats to carry over, rinse and repeat.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":3,"content":"<h2>What about when you max your stats?<\/h2><p>Lets assume you have reincarnated to the point where you have reincarnated as far as you are allowed, your stats are now 999,999 – however there is still levels to gain, should you gain them if you gain no stat points?<\/p><p><strong>Yes.<\/strong><\/p><p>When players have maxed out their reincarnation and still have levels to gain, they will instead gain stat and damage stat modifier bonus per level. The % per level is: 0.02% per level for the damage stat and 0.01% per level for the other stats.<\/p><p>Over time, as the levels increase per month you can slowly grow your stats.<\/p><p>On your character sheet is a orange button called Reincarnation, clicking this will show you the stat mod and damage stat mod % you have gained as you level, however as state – this only increases once you have maxed out reincarnation, but still have levels to gain.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":54,"page_name":"ambush-and-counter","page_sections":[{"order":1,"content":"<p>Ambush and Counter is a system within Tlessa where you can counter and enemies hit or ambush the enemy before your attack.<\/p><p>Ambush and Counter are useful in PVP situations such as dueling and is also useful in <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a>, the late to end game plane where creatures have a higher chance to ambush and counter you.<\/p><p><a href=\"\/information\/trinketry\" rel=\"noopener noreferrer\" target=\"_blank\">Trinkets<\/a>, are the only items you can craft – which require you to have access to Purgatory to help negate the enemies ability to counter or ambush you as well as give you a chance to counter and\/or ambush.<\/p><p>Trinkets are items which players may have two of equipped and cannot apply <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Enchantments<\/a>, <a href=\"\/information\/holy-items\" rel=\"noopener noreferrer\" target=\"_blank\">Holy Oils<\/a> or <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Unique Enchantments<\/a> to.<\/p><p>Trinkets provide two useful aspects:<\/p><p>Ambush and Counter as well as Stats.<\/p><p>Ambush and Counter will stack to a maximum of 95%, making it easy to cap the first aspect of trinkets, where as the stats cap out at 100% stacked.<\/p><p>You will craft these more for the added stats then the Ambush and Counter.<\/p>","content_image_path":null,"live_wire_component":"info.items.craftable-trinkets"},{"order":2,"content":"<h2>What does it mean to ambush or counter?<\/h2><p>Put simply, to ambush means to attack before you physically click the attack button of choice, you plot and scheme and get the first jump – same goes for the enemy, they can plot and scheme and get the first attack before you even click a button.<\/p><p>Counter allows you or the enemy to counter the attack of the other, directly after the hit – regardless of health left – a dead enemy can technically counter you as their dying act, as you can them.<\/p>","content_image_path":null,"live_wire_component":null},{"order":3,"content":"<h2>Additional Information<\/h2><p>When you want to see what your chances are for Ambush\/Counter you can head to your character sheet and click Additional Info, from here you can click the Ambush and Counter tab to see your resistance to being ambushed or countered when attacking monsters as well as your chance to ambush and counter.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"ambush-and-counter\/UxXE27JZzWejC3hZVUzImOjgU3mFqVek3aDBtoLx.png","live_wire_component":"null"},{"order":4,"content":"<h2>Trinkets<\/h2><p>As mentioned, you can only craft trinkets, you cannot buy them. You can list them on the market board how ever. You cannot sell them to the shop but can list or destroy.<\/p><p><a href=\"\/information\/equipment-sets\" rel=\"noopener noreferrer\" target=\"_blank\">Sets<\/a> may only contain two trinkets to be a valid equippable set.<\/p><p>As you can see to the right or the bottom for mobile, trinkets come with stats on them.<\/p>","content_image_path":"ambush-and-counter\/hjhUzrXHkFHoWlWQmiULhcv2GUzq6xxmND2Pw6LZ.png","live_wire_component":null},{"order":5,"content":"<p>If you have trinkets equipped, the comparison tab will show you a break down of weather the trinket is good or bad for you. (See image to the right or bottom for mobile)<\/p>","content_image_path":"ambush-and-counter\/TXvk1XdDx92Mtv2oLPgPVlhlD8uZaTBIn76hFXjC.png","live_wire_component":"null"},{"order":6,"content":"<h2><strong>Final thoughts<\/strong><\/h2><p>Ambush and counter are only found on trinkets and only craftable once players can reach purgatory, because of the currency required to craft them.<\/p><p>To craft them effectively, because of their steep cost, you will want to max out your Mercenaries and farm low level creatures in <a href=\"\/information\/special-locations\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatories Dungeons<\/a> for 3x the <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Copper Coin<\/a> drop rate plus the <a href=\"\/information\/mercenary\" rel=\"noopener noreferrer\" target=\"_blank\">Mercenary<\/a> bonus.<\/p><p>It takes time to craft them. There are Quest items that help with trinkers, if you start the quest: The story of Kalix on shadow plane you will end the quest line with a item that will help you craft trinkets faster.<\/p><p>If you die in an ambush and revive, the enemy cannot re-ambush you, but can counter you.<\/p><p>To the right (or bottom for mobile) you can see that with no trinkets, the enemy has a high chance to kill me with an ambushed<\/p>","content_image_path":"ambush-and-counter\/JhdnNBKbMyAfIVrHzM9W7onQX1J0l3c8muVBwv6E.png","live_wire_component":"null"},{"order":7,"content":"<p>Where as with trinkets, the chance of death becomes lower and lower. Especially if you mix Resistance Reduction enchantments with trinkets, as they will reduce the enemies ability to counter and ambush you.<\/p><p>See image to the right or bottom for mobile for the player ambushing the enemy.<\/p>","content_image_path":"ambush-and-counter\/hpugNmZbrOa8chDEsU74TQVJHgMobwDk3Zrlz2on.png","live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":55,"page_name":"class-ranks","page_sections":[{"order":1,"content":"<p>Tlessa has a system that allows players to switch their classes, not only that but alas level those classes to unlock special abilities and buffs at specific levels.<\/p><p>This system can be largely ignored but is most beneficial for end game content. The system does require a bit of grind but over all is very straight forward to use.<\/p><p>On your character sheet you will see an orange button called class ranks, for mobile players go to your character sheet and expand the top section, from there scroll down.<\/p><p>Clicking this button will show you a modal as such (to the right or bottom) that shows you all the classes, which ones are active, which ones are locked and the ability to switch to the class.<\/p>","content_image_path":"class-ranks\/W1cp3wCEBsRVISm6vogUX1DIqlz43bt3jWOrYuP7.png","live_wire_component":null},{"order":2,"content":"<p>If you click on the class name in the table, you will be shown details about the class, including its masteries and, if you scroll down, you will be able to open the class specials modal.<\/p><p>To exit out of this information section, click or tap the red minus circle you see in the image to the right or bottom for mobile. Clicking the x will close the entire class ranks modal, where as clicking the red minus will close the opened section.<\/p>","content_image_path":"class-ranks\/6jKVckxX6S9cPlmSJTm69XmVdkUGRvcmhmNuuPAS.png","live_wire_component":null},{"order":3,"content":"<p>Scrolling down, as you can see to the right or bottom, will show you more information about the class, as specified above.<\/p><p><strong>What are masteries?<\/strong><\/p><p>The masteries you see in the image above, are weapon masteries for a class. Each class is more proficient then another in a specific type of weapon or weapons. This means they have a higher starting level then other classes, such as Heretic who has a starting level of 5 in Damage Spells and Staves. What this mean if they have 5% extra damage when using those weapons.<\/p><p>Masteries are leveled by you having that weapon type equipped and killing monsters. You will get 10,000 XP per kill, and need 1,000,000 XP to level the mastery. Masteries cap out at level 100, meaning you would get 100% extra damage for using that specific type of weapon in combat.<\/p>","content_image_path":"class-ranks\/Bm70ZlxVq94PJKcbSA86kaN2Az5pYCstAHtbdmcl.png","live_wire_component":null},{"order":4,"content":"<h2>Specialties<\/h2><p>If you click the blue Manage Specialties button from above, you will be presented with a new modal (you can close this one through the X to get back to your class details).<\/p><p>See image to the right or bottom for mobile.<\/p><p>This modal shows you a list of specialties and the level the class has to be for you to equip the specialty. Each class has its own list of specialties.<\/p>","content_image_path":"class-ranks\/6GFgROrnBt4weZP7QQSWgnFFZuc6qJTvlC7AqX7t.png","live_wire_component":"admin.class-specials.class-specials-table"},{"order":5,"content":"<p>Clicking on a specialty name will show you more information about that specialty. Much like weapon masteries, these are also leveled the same way – by you killing monsters, getting 10,000 XP per kill and needing 1,000,000 XP to level the specialty with it capping at level 100.<\/p><p>To get back to the list of specials, click the red minus icon at the top right of the modal. This will close the description section.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"class-ranks\/WOEMbnn0lLHuejdZdqDbLPULR2reUCJiA2g13aFi.png","live_wire_component":null},{"order":6,"content":"<p>Clicking the equipped specialties tab will show you all your currently equipped specialties. Players may equip a maximum of 3 specialties from any class, mixing and matching is allowed.<\/p><p>Of the three equipped only ONE may be a damage based specialty, usually unlocked near the end of the class leveling experience, but some classes can have them unlock earlier.<\/p><p>Leveling these specialties allows the power of the special ability to grow over time and become unimaginably strong.<\/p><p>You can see an example of equipped specials to the right or bottom for mobile.<\/p>","content_image_path":"class-ranks\/KhgcGSGg4cgXZvUlGpfFbyCdgWCQGRbwb1lCkLQ0.png","live_wire_component":null},{"order":7,"content":"<p>Clicking on the equipped special name will show you the progress you have made, for example if you see the image to the right or bottom you can see the special is maxed out and gives me 500% extra damage. Specials do stack with each other.<\/p>","content_image_path":"class-ranks\/iBwvcp8OhiXsc3SoNM0Q0ouOyvaBZZVvt1daC0n0.png","live_wire_component":null},{"order":8,"content":"<h2>Final Thoughts<\/h2><p>While this feature can technically be ignored by new players, for the majority of the game, it does come in handy when progressing through end game and dealing with Rank Fights where the enemies get insanely tough, health and stat wise.<\/p><p>Class Ranks can be ignored till mid to late game, you will – essentially – just level the class you picked and unlock new abilities over time.<\/p><p>All of which will be told to you in your Server message section in game.<\/p><p>Class ranks are designed to give players another avenue of character growth and development by allowing you to pick your specials and unlock new ones over time.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":56,"page_name":"ranked-fights","page_sections":[{"order":1,"content":"<p>Tlessa’s end game consists of you growing your character through class ranks, equipment and levels to take on some of the strongest creatures which cap out at 650 Billion health by the time the game reaches Rank 50.<\/p><p>Your whole goal is to kill these creatures in one hit and be the first one to the current highest rank for that month.<\/p><p>These creatures are designed to either be killed during your turn or you die and they move away.<\/p><p>Players will have to head to the Underwater Caves, as you can see to the right or bottom for mobile, on Surface – at any time they think they are ready – and take o these creatures.<\/p><p>Players who reach the end of the critter list for a rank will be rewarded with:<\/p><p>- 1 Legendary Item<\/p><p>- 2 Billion Gold<\/p><p>- 10,000 XP<\/p><p>A player who is first to kill the last critter on the highest rank for that month, will get:<\/p><p>- 1 Mythic<\/p><p>- 1 Trillion Gold<\/p><p>- 100,000 XP<\/p>","content_image_path":"ranked-fights\/XEktanOnWM5cDGyxhT1OfSGTHRPeq88Jq3sWm0e9.png","live_wire_component":null},{"order":2,"content":"<p>When you arrive at the Underwater Caves your fight section will update as you can see to the right or bottom for mobile.<\/p><p>Mobile players fight section will also update to reflect the rank selection.<\/p><p>By default all players start on Rank 1.<\/p><p>As you go further down the rank list the monsters health and stats will get stronger and stronger.<\/p><p>Characters will want to make use of Reincarnation and Class Specialties, specifically mixing and matching to boost the damage as high as possible, while also doing additional damage.<\/p>","content_image_path":"ranked-fights\/V5Y9uN1yPmJDQBS7TTzS1x4Qdd12PinLRZXNdCQO.png","live_wire_component":null},{"order":3,"content":"<p>Players can select a rank at any time, Tlessa started off with a maximum of 10 ranks and over time will grow to 50 ranks, where creatures have ~650 Billion in Health and stats.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"ranked-fights\/JxMUVRTPBSxe0MNkmLMQMXt8Q2AwdFxzwuKFaU0U.png","live_wire_component":null},{"order":4,"content":"<p>For example, here’s a character who is attempting to take on a Rank 1 God of Lizardkin (see to the right or bottom for mobile.) Players will want to make sure they have the best gear and have made use of other systems to unlock more power for their character.<\/p>","content_image_path":"ranked-fights\/2XxOI6f3u7GPUNuPRtLDSRY2w7UMhqBUMVjrarJn.png","live_wire_component":null},{"order":5,"content":"<h2>Server Side Fights Only (Clicking Required)<\/h2><p>Ranked fights are all done on the server and cannot be used for exploration. The location will not let you explore and if you are exploring you wont be able to enter the location.<\/p>","content_image_path":null,"live_wire_component":null},{"order":6,"content":"<h2><strong>Rank Tops<\/strong><\/h2><p>Players can open their side bar menu and see a new page under the Tops section (see image to the right or bottom for mobile).<\/p>","content_image_path":"ranked-fights\/EIlqon2E5m9u1yp4q6RrKOiQ5hMxNrv27QojiXfJ.png","live_wire_component":null},{"order":7,"content":"<p>Here, to the right or bottom, you can see a chart and I have selected a rank. Now the data for this image is all generated, but the idea is simple you can see who is where on the lists.<\/p>","content_image_path":"ranked-fights\/nMOhEGW0AHJjsnC6iDlrRiMfMbBPUsaO9t6MGuVJ.png","live_wire_component":null},{"order":8,"content":"<h2><strong>Final Thoughts<\/strong><\/h2><p>Ranked fights are Tlessa’s main end game system and will take players many hours to achieve top ranks as they will want to have access to Purgatory for the currencies, make use of Mercenaries, Buy Purgatory chain gear, apply holy oils, enchantments and then - if not already – start investigating class ranks to unlock new buffs and specials.<\/p><p>Ranked fights make use of every system you have interacted with to build towards players being able to take on the strongest of the strongest creatures so far!<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":57,"page_name":"some-clicking-required","page_sections":[{"order":1,"content":"<p>Tlessa offers a way to help make the progression easier on players through whats called exploration.<\/p><p>Exploration is a system that allows you to let the game fight monsters for you, in a sense it is the main idle mechanic of the game.<\/p><p>The issue is that players fall into a trap thinking if all they do is explore, they will get all the best loot, the best gear and so on and so forth, that is not the case. You are missing out on 95% of the game if you do this and will go no where progression wise.<\/p><p>New players are encouraged to enable the guide, which yes does make use of exploration, but also other features in conjunction with exploration.<\/p><p>Where the clicking comes in, is in crafting and enchanting, alchemy, holy oils, interacting with the queen of hearts, completing quests,traversing, moving, setting sail, PVP, celestial fights, ranked fights, managing your inventory, class skills, class ranks, class specialties and kingdom management if you so desire.<\/p><p>The most important aspect out of all of what I just mentioned is Crafting and Enchanting. These are time consuming but if done right can take a couple hours at most.<\/p><p>There is no automation with crafting and enchanting and while the games shop does go to Two Billion in gold, a player can craft well beyond the shop and enchant well beyond what will drop for them.<\/p><p>Players who make it this far are also completing quests to unlock more game features such as the ability to level past level 1000 to current months cap.<\/p><p>There is a difference between using exploration to take the monotony out and hoping or thinking it will play the game for you. Sure you will get gold, gear, xp and maybe some of that gear is good for you. But if you are not interacting with the rest of the game to grow your character and explore what else is out there you are missing out on the experience Tlessa has to offer.<\/p><p>I have built a lot of systems into this game, systems that can largely be ignored, most are explained through The Guide when you are new, each and every one of them plays together to push you towards end game content – Ranked Fights.<\/p><p>Tlessa offers a lot of ways for you to grow your character, carefully explaining what each and every one does and how it plays with your character and how you can use it.<\/p><p>There's the surface – exploration – and then the ocean – some clicking required aspect. Come play in the ocean, the beach is offly boring.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":58,"page_name":"goblin-shop","page_sections":[{"order":1,"content":"<p>At some point in the game, you will find you have more gold then you know what to do with. You could set up a series of kingdoms and then deposit your gold as gold bars, allowing you to amass vast amount of gold.<\/p><p>However, should your kingdoms survive and your vast wealth remains in your hands, you have nothing to spend it on, you grow more kingdoms, deposit more gold bars and now you have trillions of gold.<\/p><p>This is where the Goblin Shop comes into play for more late game gold sink.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<p>You can access the shop by opening the menu and selecting Goblin Shop. You can see this to the right or bottom for mobile.<\/p>","content_image_path":"goblin-shop\/4PUbefHaMC81n2COsrcCUqIeSDbY69fv3UTZJ6tg.png","live_wire_component":null},{"order":3,"content":"<p>From here you will see a list of items that requires a currency you have been hiding your vast wealth in: Gold Bars.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"goblin-shop\/PxivYxuldgeCLU767jOlUWiZHEFu2FmlpVJptddg.png","live_wire_component":null},{"order":4,"content":"<p>Since a kingdom can hold 1000 gold bars, and some items can cost more then 1000 gold bars a player will need to have more then one kingdom for the more expensive items, because of the limited space on the planes, war will be fought for precious land.<\/p><p>When an item is purchased, regardless of the price we will check two things:<\/p><p>- Do you have a kingdom who’s gold bars are greater then the cost of the item, that kingdom will just absorb the cost of the item.<\/p><p>- If the cost is, for example 2000 gold bars, this will be split over all kingdoms who’s gold bars sum to a total of 2000. This will work for variable kingdom amounts holding variable gold bar amounts for variable item cost, it will always evenly distribute the cost over the kingdoms gold bars.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":59,"page_name":"gems","page_sections":[{"order":1,"content":"<p>Gems are items that can be socketed into weapons and armour. Gems also have their own bag that <strong>does<\/strong> <strong>count<\/strong> towards inventory count.<\/p><p>The entire purpose of gems is for the elemental resistance and damage, known as atonement.<\/p><p>Gems are not bought, instead they are crafted through Gem Crafting, which only has 100 levels, and 4 tiers.<\/p><p>- <strong>Tier 1<\/strong>: 1-25% for each element, 1000 Gold Dust, 250 Shards, 100 Copper Coins. (Level 1-25)<\/p><p>- <strong>Tier 2<\/strong>: 5-50% for each element, 5000 Gold Dust, 500 shards, 250 Copper Coins. (Level 25-50)<\/p><p>- <strong>Tier 3<\/strong>: 10-75% for each element, 10,000 Gold Dust, 1,000 Shards, 500 Copper Coins. (Level 50-75)<\/p><p>- <strong>Tier 4<\/strong>: 20-100% for each element, 50,000 Gold Dust, 2,500 Shards, 1,000 Copper Coins. (Level 75-100)<\/p><p>When you craft a gem, there are three elements attached:<\/p><p>- Fire<\/p><p>- Ice<\/p><p>- Water<\/p><p>These work in a circle:<\/p><p>Fire → (beats) → Ice → (beats) → Water → (beats) → Fire.<\/p><p>These are also known as atonement. When you craft a gem the elements are randomly assigned numbers based on the tier selected.<\/p><p>The highest element, will be your attacking element – which means you’ll do x% of your own damage as that element in addition to all your other attacks, but only during PVP and raids. Let’s look at a quick example:<\/p><p>Fire: 25%<\/p><p>Water: 30%<\/p><p>Ice: 10%<\/p><p>In this example you will, with no other gems attached, do 30% of your attack as a water element attack. You will have 25% resistance against fire and 10% against ice based element attacks.<\/p><p>If you attack a fire attuned character or raid monster, you will do 60% damage against them because your water is: Super Effective against fire atonement.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<h2><strong>Crafting Gems<\/strong><\/h2><p>You can start crafting gems once you have access to <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a> and therefor have access to <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Copper Coins<\/a>. You will need to complete:<\/p><p>- Purgatories Doors (Surface <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">Quest<\/a>)<\/p><p>-<strong> The Magic of Purgatory (Hell Quest)<\/strong><\/p><p>Once these two quests are complete, you can then begin crafting gems, as you can see to the right or bottom for mobile, we can select the gem crafting option from the Craft\/Enchant drop down.<\/p><p>You can see this to the right or bottom for mobile.<\/p>","content_image_path":"gems\/2B0u2fazwpN1e99ARnNbkgey9wyHDyrXDw8e4w12.png","live_wire_component":"null"},{"order":3,"content":"<p>Here, to the right or bottom for mobile, you can see, once we select the gem crafting that we first select a tier.<\/p><p>All gems are randomly rolled based off the information above about each tier. No gem will ever have the same % rolled on it. That is if one element is 100% no other element will be 100% when the roll happens.<\/p>","content_image_path":"gems\/MsAn9NiYDZ3U4xDEK7DOHTkTVTatFt5j6YTZeeGo.png","live_wire_component":"null"},{"order":4,"content":"<p>When you select a tier, the cost will be shown below.<\/p><p>See image to the right or bottom for mobile.<\/p>","content_image_path":"gems\/Oc5VyQryE2fPQMW034zzaSGAJzD90zaB59LwhCdc.png","live_wire_component":null},{"order":5,"content":"<p>When you craft a gem, you will see a server message and a timer appear – as you can see to the right or bottom for mobile.<\/p><p>Keep in mind that there is no enchantments for Gem Crafting, and the first few levels can be extremely difficult, that's why there’s three new potions in <a href=\"\/information\/goblin-shop\" rel=\"noopener noreferrer\" target=\"_blank\">The Goblin Shop<\/a>:<\/p><p>- Artificers Brew<\/p><p>- Carrot Stew<\/p><p>- Artificers Glasses<\/p><p>You <strong>will want one of these to start gem crafting.<\/strong><\/p>","content_image_path":"gems\/ZMzv68cIJiA78s3PDnK7KHbXCrDNjPbrl1TfjS5x.png","live_wire_component":"null"},{"order":6,"content":"<p>Clicking on the server message will show you, to the right or bottom for mobile, the result of your craft.<\/p>","content_image_path":"gems\/Pr4hPzdISBwLIUxLuIAXkRWTdYvuVIrNGs7aKAB8.png","live_wire_component":null},{"order":7,"content":"<p>You can see the gems you crafted in your inventory, if you head over to your character sheet, under the Type drop down for the inventory tab you will see a Gem Bag selection. See image to the right or bottom for mobile.<\/p><p>(If you are on mobile, click Inventory Management from the drop down on the character sheet, then you will see the drop down as described above.)<\/p>","content_image_path":"gems\/41vRO9H0aAppoGktsSd3uSEkbMd4B2kPpt0ZcSuu.png","live_wire_component":null},{"order":8,"content":"<p>When you select the gem bag you will see your gems as you can see to the right or bottom for mobile.<\/p><p>Gem Bag <strong><u>DOES<\/u><\/strong> count towards your inventory max, in conjunction with inventory and usable items.<\/p>","content_image_path":"gems\/KGLAjYd7PEsX9XqAjAU6LvQN4wZiRTY4s54QY2tj.png","live_wire_component":"null"},{"order":9,"content":"<p>Gems can be sold to the shop for 15% of the currency requirements required to make the gem of that tier. You can either sell them individually or all at once, as you can see to the right or bottom for mobile.<\/p>","content_image_path":"gems\/Ec6XnlbqFIcMHUOTeZl31HWtsWqMvaJAUxNlfEPG.png","live_wire_component":null},{"order":10,"content":"<p>Finally, you can see, to the right or bottom for mobile, the gem crafting skill. For mobile players, when on the character sheet – select Skill Management from the drop down, then click the crafting tab.<\/p>","content_image_path":"gems\/TaE2cNAJmZt1LWZt15aFhg3e7N8DK8BrBaWkhRM7.png","live_wire_component":null},{"order":11,"content":"<p>This skill is similar to all other crafting skills, with the exception that there are no affixes (enchantments) or other ways to boost the skill for crafting outside of the listed items above that you can buy from The Goblin Shop and can be used on your self to gain a limited buff for crafting gems.<\/p><p>(see image to the right or bottom for mobile)<\/p>","content_image_path":"gems\/lVuiIAE1DqTirsLkpolZmonLkKc3zrNN1nLUaPf2.png","live_wire_component":null},{"order":12,"content":"<h2>Character Atonement<\/h2><p>When you equip gems to your gear your atonement will be calculated based on the average of the gems.<\/p><p>For example, if you have 7 Gems that contain a Fire value of 0.05, we will take all 7 and average it out, but also cap it at 75%.<\/p><p><strong>Note:<\/strong> In the event that you manage to have, for example, a gem where all the elemental atonement's are a flat 75% across the board and because of how we take the first highest atonement, any gem where all values are 75% are automatically fire gems. That is if you have one gem equipped of this type, the elemental atonement your character would be: Fire.<\/p><p>Raid Bosses and Raid Critters are capped at 75% as well.<\/p><p>You can see your character atonement data by clicking on the orange Elemental Atonement button which you can see to the right or bottom for mobile.<\/p>","content_image_path":"gems\/Kzg0kkibHAts9Y2KpV0OlbciO0HaJFAQXusS5DPo.png","live_wire_component":"null"},{"order":13,"content":"<p>As you can see, to the right or bottom for mobile, clicking on the button will show you the atonement values, again averaged, and the highest attacking element.<\/p><p>Whats important is that an element that beats another element will do double damage, where as a element that is weak to another element will do half damage and elements that are not weak or not strong will do regular damage.<\/p><p>For example, if you are Fire, going up against Ice, you will do double the damage. If the attacker is Ice and you are Fire, they will do half damage.<\/p><p>If you are Water and the attacker is also water, they will do regular damage.<\/p><p>In regards to defense – if we use the above examples:<\/p><p>Fire will do double damage to ice, but ice’s % will reduce the fire damage.<\/p><p>Ice will do half damage to fire, but fires % will reduce the ice damage.<\/p><p>Since Water will do regular damage up against Water, the defenders Water % will reduce the Water damage coming in.<\/p><p>In other words, your highest atonement is also your defense if it is opposite of the element.<\/p>","content_image_path":"gems\/gH9QYQLEkJgUKxjmKjC2rhjlu3gZypiVROG3Jg59.png","live_wire_component":null},{"order":14,"content":"<h2><strong>Final Thoughts<\/strong><\/h2><p>Gem crafting is more of a “late” game mechanic. You see the ability to get Gold Dust (<a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Disenchanting<\/a> items), Shards – The Gold Mines (<a href=\"\/information\/special-locations\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Location<\/a>) or <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Celestials<\/a> and <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Copper Coins<\/a> which requires you to be in purgatory or complete the above quests as listed and then use Slots in conjunction with Mercenaries to get more currencies.<\/p><p>Gem crafting goes hand in hand with the <a href=\"\/information\/seer-camp\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Seer Camp<\/a>, which allows players to create sockets on their items, and atone them selves to a specific element.<\/p><p>The entire purpose of Gems is to participate in <a href=\"\/information\/raids\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Raids<\/a>, where creatures use elemental attacks and have resistances. It is also used in <a href=\"\/information\/pvp\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">PVP<\/a>.<\/p><p>For more information on what exactly atonement's are and how they are used, check out the <a href=\"\/information\/seer-camp\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(0, 0, 128);\">Seer Camp<\/a> documentation.<\/p>","content_image_path":null,"live_wire_component":"null"}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-28T04:01:29.000000Z"},{"id":60,"page_name":"seer-camp","page_sections":[{"order":1,"content":"<p>The Seer Camp is the place where you use your gems to socket them into items, replace gems in items, remove gems in items or add\/re-roll sockets on items.<\/p><p>Sockets can only be applied to Weapons and Armour.<\/p><p>Lets go over all this together.<\/p>","content_image_path":null,"live_wire_component":null},{"order":2,"content":"<p>First, lets start with sockets.<\/p><p>Items in the game by default do not have sockets, with the exception of raid rewards. When you create an item, buy and item from the shop – it wont have sockets attached, that’s where the Seer Camp comes into play.<\/p><p>Players will need access to <a href=\"\/information\/planes\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory<\/a> in order to use the Seer Camp and will also need to own <a href=\"\/information\/kingdoms\" rel=\"noopener noreferrer\" target=\"_blank\">kingdoms<\/a>, as the actions of the camp requires Gold Bars.<\/p><p>When you open the Craft\/Enchant menu you will see a new option, when in Purgatory, to use the Seer Camp – see image to the right or bottom for mobile.<\/p>","content_image_path":"seer-camp\/hYWkce5dzosZ8EU5lR1VrlNu3Uun38z9t3mtMrs4.png","live_wire_component":null},{"order":3,"content":"<p>Selecting this, allows you to then select an action, see image to the right or bottom for mobile.<\/p>","content_image_path":"seer-camp\/3BkmeYHIZJdgkCJV8V9WKo3d3BEdOFGfGbqBfCBA.png","live_wire_component":null},{"order":4,"content":"<p>Lets create sockets on an item. First, you’ll select the appropriate action, select an item and then be able to re-roll or create sockets on an item. You can see this to the right or bottom for mobile.<\/p><p>Couple things to know is that:<\/p><p>- The cost is steep, 2,000 Gold Bars. This requires you to have two kingdoms with 1000 gold bars which is roughly 4 trillion gold<\/p><p>- The items sockets may be any number, higher or lower to a max of 6 sockets, ie: a 4 socket item re-rolled could roll with 1 socket. A 1 socket item can re-roll with 1 socket.<\/p><p>- Items with gems attached, cannot be re-rolled<\/p><p>In the image attached (right or bottom for mobile), we can see that in this case, we had 3 sockets attached and we re-rolled with 3 sockets.<\/p>","content_image_path":"seer-camp\/6kQxqeeGhh7jga85EvXh9EaUvhnpgDYcLCVi2wtC.png","live_wire_component":null},{"order":5,"content":"<p>Weather and item has or doesn’t have sockets attached, or even gems, you can always see the items socket information on a particular item by either clicking details, when viewing an item from the server messages, or by viewing the item in a set.<\/p><p>To the right or bottom for mobile, you will see the basic socket information. In this case you can see we have no gems attached.<\/p>","content_image_path":"seer-camp\/CGG1qei0I5tFJsZzyI6Ca3ULHDUHm37qcRPF9bWb.png","live_wire_component":null},{"order":6,"content":"<h2><strong>Managing Gems<\/strong><\/h2><p>When attaching a gem to an item you can select only items that have one or more sockets. From here you can select a gem to attach, as you can see to the right or bottom for mobile.<\/p>","content_image_path":"seer-camp\/89lI88HOhtyJoTMvFRZQMCzfXPdgXoLNBtgnv8Lp.png","live_wire_component":null},{"order":7,"content":"<p>When you selected the gem and go to attach it, you will be presented with a window, which you can see to the right or bottom for mobile, that allows you to socket the gem – if you have the space on the item, or to replace gems on the item.<\/p><p>In this case, lets socket the gem – which will cost 500 God Bars (Equal to 1 trillion gold).<\/p>","content_image_path":"seer-camp\/ptGKJbzCyh6zkObJURYKVPQ2SSEAtX4vC0fXmj2G.png","live_wire_component":null},{"order":8,"content":"<p>When we have attached an item to a gem, we will get a server message that allows us to click on the item to see equipment options as well as details about the item.<\/p><p>Remember before how we discussed the socket information on items, well now, if you look to the right or bottom for mobile, we can click the View Attached Gems button to see the attached gem details.<\/p><p>You will also notice the Elemental Atonement on the item, which comes from the gem attached.<\/p><h2><strong>What is Elemental Atonement?<\/strong><\/h2><p>This means the item is attuned to a specific element, while resisting the other elements to a degree.<\/p><p>Each item, that has gems attached will take the highest element of all the gems attached and use the highest to do damage.<\/p><p>For example, in the image attached (right or bottom for mobile.), this item is atoned to the fire element and does 19% of your (total and combined) damage as Fire. If you are attacking an Ice Attuned enemy, you will do 38% of your damage. This is because Elemental Atonement works a circle:<\/p><p>Fire → (beats) → Ice → (beats) → Water → (beats) → Fire<\/p>","content_image_path":"seer-camp\/Hkd28chuPPRWkedOmJ7lD4dGWCWUokmKGD6uyV5Z.png","live_wire_component":null},{"order":9,"content":"<p>When you have this item, from above, equipped – or any item with gems attached, you will be able to click on a new button called: Elemental Atonement, which you can see to the right or bottom for mobile. For mobile players, on your character sheet – expand the top section to get access to these buttons.<\/p>","content_image_path":"seer-camp\/rbGYyTiD8IadoDbKAqhR7ioOnfzfJFqMcoSJAElg.png","live_wire_component":null},{"order":10,"content":"<p>If you click it a window like this, to the right or bottom for mobile, will appear. This will tell you, your characters over all Elemental Atonement. This is the calculation of every gem attached. Again – we take the largest elemental % as your damage, and the rest are your resistances.<\/p><p>A characters Atonement Damage may not raise above 100% regardless of the amount of gems equipped. A characters resistances may rise as high as 6 X 6 = 24. This means your max resistance is 2400%.<\/p><p>The way the elemental resistance works is we take your resistances and subtract it from the enemy's enemies elemental resistance. If the enemy is a Ice atoned enemy and you are a fire atoned character, and the enemy has fire resistance of 50%, but your fire attach is 68%, that means:<\/p><p>68 – 50% = 18%<\/p><p>But they are ice, so: 18 * 2 = 36% of your weapon damage will be done as Fire damage to the enemy.<\/p>","content_image_path":"seer-camp\/PkY4NeB9p5P3T2zw6LkyEPdpcv687wi7L1w91TOP.png","live_wire_component":null},{"order":11,"content":"<h2><strong>Replacing Gems on an Item<\/strong><\/h2><p>When you want to replace gems on an item, all you have to do is select the Attach Gem from the Seer Camp Options, select the item, the gem and then go through the process of adding a gem to an item. What you will notice is that, while yes you can add gems, you can also replace existing gems when the modal comes up.<\/p><p>The image to the right, or bottom for mobile, shows you the items atonement changes when you switch out a specific gem.<\/p><p>The cost is 500 Gold Bars to replace a gem (1 trillion gold)<\/p>","content_image_path":"seer-camp\/H3vDSX1MlzFY63ZVKcduFzqDG8qwJpaAYT88hKu5.png","live_wire_component":null},{"order":12,"content":"<h2><strong>Removing Gems from an Item<\/strong><\/h2><p>Removing gems costs only 10 Gold Bars (10 Billion Gold) per gem attached.<\/p><p>When removing gems all you have to do is use the Seer Camp, select Remove Gem and then select the item with the gem or gems you want to remove.<\/p><p>From here a modal will appear when you select the item.<\/p><p>The image to the right or bottom for mobile will show you the result of removing a single gem, with the option to remove all gems.<\/p>","content_image_path":"seer-camp\/Kh8dxVwEg6rlJ0CvLmuSO6PqMYaKnIzcu4hA4wOO.png","live_wire_component":null},{"order":13,"content":"<p>How ever, if you scroll down in the modal, as you can see to the right or bottom for mobile, you can remove a specific gem.<\/p>","content_image_path":"seer-camp\/kU6LOkFoLNYgvFfFjJxarzsyoP8VW6Jm1kw9NZEv.png","live_wire_component":null},{"order":14,"content":"<h2><strong>Comparing Items with Gems Attached<\/strong><\/h2><p>when you find items, or create items and add sockets to them and then attach gems, you will see a new tab in the item comparison window, which you will see if you click on an item in the server messages chat window, or when you craft items.<\/p><p>When two items have gems attached and you are comparing them, as you can see to the right or bottom for mobile, we show you the atonement adjustment of the gems attached to both items.<\/p>","content_image_path":"seer-camp\/0eL1pIwJmfCF2SbQp4ROnB8PBSoqXOTcORLd24ll.png","live_wire_component":null},{"order":15,"content":"<h2><strong>Final Thoughts<\/strong><\/h2><p>The core purpose of the Seer Camp is to add or re-roll sockets on an item, add, remove or replace gems on an item. Gems are what give your character Elemental Atonement. Elemental Atonement allows you to do Damage of one element (the highest) and use the rest as resistances.<\/p><p>Gems are expensive and so is the Seer Camp. Characters will want at least 2-5 kingdoms and be making money hand over fist to achieve their desired goals.<\/p><p>Gems and the Seer Camp are not something one has to worry about until they have access to Purgatory and are interested in either <a href=\"\/information\/pvp\" rel=\"noopener noreferrer\" target=\"_blank\">PVP<\/a> or <a href=\"\/information\/raids\" rel=\"noopener noreferrer\" target=\"_blank\">Raids<\/a>.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-08T18:45:14.000000Z","updated_at":"2023-08-08T18:45:14.000000Z"},{"id":61,"page_name":"mythical-items","page_sections":[{"order":1,"content":"<p>Mythical items are orange in your inventory, as you can see to the right or bottom for mobile.<\/p><p>Mythical Items are more powerful then the most expensive <a href=\"\/information\/random-enchants\" rel=\"noopener noreferrer\" target=\"_blank\">Uniques<\/a> and are randomly rolled. You can re-roll aspects of Mythics by using The Queen of Hearts in Hell.<\/p><p>Characters can only have one mythic in an equippable set and only have one equipped. You cannot have a unique and a mythic equipped or in the same set to be equipped.<\/p><p>You can also use The Queen of Hearts in hell to move the enchantments on Mythical items to other items, making them Mythic.<\/p><p>Mythics can be gained from 3 sources:<\/p><p>- Rare random drop from Purgatory Dungeons in Purgatory<\/p><p>- Rare drop from Monthly PVP, Guaranteed if you are the winner.<\/p><p>- Rare drop from Celestial Kings which spawn after the monthly pvp event.<\/p>","content_image_path":"mythical-items\/2EuDTTLR1eoj7R88DYY6QXodXn9yPo1UJyQuIaHv.png","live_wire_component":null}],"created_at":"2023-08-12T00:59:57.000000Z","updated_at":"2023-08-12T00:59:57.000000Z"},{"id":62,"page_name":"hell-forged-set","page_sections":[{"order":1,"content":"<p>Hell forged set is base gear which is better then Top End Crafted base gear and is considered the next step in a characters gear progression.<\/p><p>Base gear referring to, gear with no enchantments or holy oils applied.<\/p><p>Hell Forged can only be purchased in Hell. All you need is access to the plane.<\/p><p>To purchase the gear you will need to pay:<\/p><p>- 150 Billion Gold<\/p><p>- 1000 Shards<\/p><p>- 10,000 Gold Dust<\/p><p>You will also need a level 400 crafted item of the type you want to buy. For example, if you want to buy a body piece, you will need a level 400 Crafted body piece to trade. For this reason it is advised players craft the body, apply the enchantments and holy oils as desired and then use that piece of gear to trade for the Hell Forged, as you will get back the Hell Forged with the same enchantments and holy oils applied.<\/p>","content_image_path":null,"live_wire_component":"info.items.hell-forged"}],"created_at":"2023-08-12T01:37:28.000000Z","updated_at":"2023-08-12T01:37:28.000000Z"},{"id":63,"page_name":"purgatory-chains-set","page_sections":[{"order":1,"content":"<p>Purgatory Chains Gear can only be obtained if the character is in Purgatory and has a piece of <a href=\"\/information\/hell-forged-set\" rel=\"noopener noreferrer\" target=\"_blank\">Hell Forged<\/a> of the same type you want to purchase.<\/p><p>This gear is better then base Hell Forged gear.<\/p><p>To purchase Purgatory Chains, you need:<\/p><p>- 250 Billion Gold<\/p><p>- 2,500 Shards<\/p><p>- 25,000 Gold Dust<\/p><p>- 1,000 Shards<\/p><p>And as mentioned one matching piece of Hell Forged gear.<\/p><p>It is suggested that players Craft the top tier item, enchant it, apply holy oils use it to trade for Hell Forged and then trade that piece of gear for Purgatory Chains.<\/p><p>This way all you previous enchants and oils will move on over to the new gear piece.<\/p>","content_image_path":null,"live_wire_component":"info.items.purgatory-chains"}],"created_at":"2023-08-12T01:40:17.000000Z","updated_at":"2023-08-12T02:07:56.000000Z"},{"id":64,"page_name":"pirate-lord-leather-set","page_sections":[{"order":1,"content":"<p>Pirate Lord Leather can only be obtained as a random drop from participating in a raid: The Smugglers Are Back!<\/p><p>This gear is better then <a href=\"\/information\/purgatory-chains-set\" rel=\"noopener noreferrer\" target=\"_blank\">Purgatory Chain<\/a> gear and can only be obtained by participating in dealing damage to the Raid Boss. However, only those in the top 10 for damage dealt will get a piece of gear, and only after the raid boss has been killed.<\/p>","content_image_path":null,"live_wire_component":"info.items.pirate-lord-leather"}],"created_at":"2023-08-12T01:41:14.000000Z","updated_at":"2023-08-12T02:09:23.000000Z"},{"id":65,"page_name":"ancestral-items","page_sections":[{"order":1,"content":"<p>These items are items of immense power and therefor can only be obtained by being the one who kills the <a href=\"\/information\/raids\" rel=\"noopener noreferrer\" target=\"_blank\">Raid<\/a> Boss.<\/p><p>These items have what are called: Item Skills that can be managed through the manage skills section on the item.<\/p><p>These item skills, when leveled by killing creatures, will slowly help you gain even more power.<\/p><p>A character may only have one ancestral item equipped at a time or in a set. These are artifact items and have their own placement.<\/p><p>Each item has it’s own set of stats, meaning each item is for a specific class.<\/p>","content_image_path":null,"live_wire_component":"info.items.ancestral-items"}],"created_at":"2023-08-12T02:04:52.000000Z","updated_at":"2023-08-12T02:09:55.000000Z"},{"id":66,"page_name":"raids","page_sections":[{"order":1,"content":"<p>Raids are special events, that last for 2 weeks and can be found on the characters <a href=\"\/information\/events\" rel=\"noopener noreferrer\" target=\"_blank\">Event Calendar<\/a>.<\/p><p>When a raid kicks off there is a bit of a story from the raid that plays out and then the locations on one or more maps will become corrupted. One or more of them may have a raid boss at them.<\/p><p>When a player visits a corrupted location, their monster list will change such that they now have Raid Critters to fight.<\/p><p>Thee creatures give out more XP then even <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a> and even stronger then Purgatory Monsters.<\/p><p>If you are at a location with the Raid Boss, the boss will be at the top of the list.<\/p><p>This boss cannot be taken down alone and instead requires the collective player base to come together and take the boss down.<\/p><p>The player who kills the Raid boss gets a a special item called an <a href=\"\/information\/ancestral-items\" rel=\"noopener noreferrer\" target=\"_blank\">Ancestral Item<\/a>, where as the top ten players to do the most damage, will get a piece of gear that is better then Purgatory Chains.<\/p><p>Raids also have quests, usually two branches, one is the story and the other is a continuation of the story, with a cosmetic reward.<\/p><p>Lets break raids down a bit more.<\/p>","content_image_path":null,"live_wire_component":"null"},{"order":2,"content":"<h2><strong>The Raid Starts<\/strong><\/h2><p>When a raid starts, players will see the chat section update, which you can see to the right or bottom for mobile.<\/p><p>This is the small bit of story that announces the raid.<\/p>","content_image_path":"raids\/MQpAME3vdGUFJnPRnI6b6nABX6EHOwbizozdkSgy.png","live_wire_component":null},{"order":3,"content":"<p>This is then followed by, see to the right or bottom, the new announcement section updating to tell you about the raid and where you can find critters and the boss.<\/p>","content_image_path":"raids\/OGiihk1x58XMaCL89eiPxGHyrvce85DwZX4dCA4I.png","live_wire_component":null},{"order":4,"content":"<h2><strong>Raid Quests<\/strong><\/h2><p>Raids also come with, as mentioned, quests. You will find these in the quest section, regardless of plane, under the new tab: Raid Quests, which you can see to the right or bottom for mobile.<\/p><p>Raid quests serve two purposes: Tell story and unlock cosmetic reward.<\/p><p>Sometimes there may be a third branch that tells a connected story and unlocks a new feature only accessible during that raid.<\/p>","content_image_path":"raids\/gYke8K0xtDevdDxaYgha3mJPs7MFZV1XIddR33B1.png","live_wire_component":null},{"order":5,"content":"<h2><strong>Corrupted Locations<\/strong><\/h2><p>When a character clicks on a location on the map with corrupted locations, as you can see to the right or bottom for mobile.<\/p>","content_image_path":"raids\/q4c2tFosVdKkiS15kTDZ31H7oRjQhirRA7jwoO4I.png","live_wire_component":null},{"order":6,"content":"<p>If the location is corrupted the details of the corruption will be spelled out for you in the details modal, which you can see to the right or bottom for mobile.<\/p>","content_image_path":"raids\/mwGT1NN0uICoDFp6JRFX18dpqtOq4bPeaXT6cWyj.png","live_wire_component":null},{"order":7,"content":"<p>If you use the Teleport modal, you will be able to see if the location is corrupted when traveling to it, which you can see to the right or bottom for mobile.<\/p>","content_image_path":"raids\/kdVh1PCHfgnEmjSpvDArH9UPfUIoeBiK9eXv7qwY.png","live_wire_component":null},{"order":8,"content":"<p>If you try and <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">explore<\/a> at a corrupted location, you will fight regular critters. Raid Critters and the Raid Boss cannot be fought using automation.<\/p>","content_image_path":null,"live_wire_component":null},{"order":9,"content":"<h2><strong>Raid Critters<\/strong><\/h2><p>When players are at a location that is corrupted they can select raid critters to fight as show to the right or bottom for mobile.<\/p>","content_image_path":"raids\/5xtJnSZ3wD9gshvxqbAtClscG8eORE31P7DlHmdj.png","live_wire_component":null},{"order":10,"content":"<p>When you select a monster, above the Attack buttons you will find a new link called Elemental Atonement. When clicked on you will see the modal to the right or bottom for mobile.<\/p><p>This details what the monsters element is. All raid critters will have the same Elemental Atonement but their values might be slightly different.<\/p>","content_image_path":"raids\/4JPTAPugfADKjm6PVJ9U013JARal60sADIHxP3Mb.png","live_wire_component":null},{"order":11,"content":"<p>Raid critters and bosses also have special attacks, a single special attack that deals damage to the player. The only defense you have against this is your armor class.<\/p>","content_image_path":null,"live_wire_component":null},{"order":12,"content":"<p>Raid critters can hit hard, see the image to the right or bottom for mobile. Raid Bosses can an will hit harder and will probably kill you, but players get 5 attacks on a raid boss per day.<\/p><p>Raid critters have billions of health, but Raid bosses have Trillions.<\/p><p>Characters will want to make sure they have top notch gear, class ranks with specials equipped, gems and sockets to counter the elemental damage from Raid critters and to have at least reincarnated a few times for the raid boss.<\/p>","content_image_path":"raids\/ZOl9QVYSFc3cSaaStHjaXnNXwGG4fuHsAGrxOwuH.png","live_wire_component":null},{"order":13,"content":"<h2><strong>Raids are open to everyone.<\/strong><\/h2><p>You might, no you will, die. That’s ok. Even a low level character can deal damage to a Raid Boss, even though not much, but they can participate to.<\/p><p>The character who kills the raid boss will get a Ancestral Item. A unique artifact that has a skill tree attached to it.<\/p><p>When a raid boss dies, the top ten players who dealt the most damage will be rewarded with a random piece of gear as a reward.<\/p><p>The raid boss will re-spawn an hour later for players to try and take it down again.<\/p>","content_image_path":null,"live_wire_component":null},{"order":14,"content":"<h2><strong>Final Thoughts<\/strong><\/h2><p>Raids generally come with new content, including monsters, quests, cosmetic feature or item and a new Raid boss. But on top of that they also usually come with other features, perhaps a new map, new classes, new quest line that unlocks a new uber boss, who knows.<\/p><p>Raids are competitive, but also meant to be fun and enjoyable pieces of content for end game players looking for a challenge.<\/p>","content_image_path":null,"live_wire_component":null}],"created_at":"2023-08-15T02:38:33.000000Z","updated_at":"2023-08-15T02:45:48.000000Z"}]