[{"id":1,"title":"Player Feedback","description":"Thank you for taking the time to provide feedback on Planes of Tlessa! Your input will help me, The Creator - make a better game for everyone involved. This survey is geared towards new players starting out, but everyone and all feedback is welcome!","sections":[{"title":"General Game Play","description":"I want to understand your overall experience with the game play, including how you find the learning curve and general enjoyment.","input_types":[{"type":"radio","label":"How would you rate your overall experience with the game play?","options":["Excellent","Good","Average","Poor"]},{"type":"markdown","label":"If you selected \"Poor,\" please explain why (Optional):"},{"type":"radio","label":"How challenging did you find the learning curve?","options":["Too easy","Just right","Too hard"]},{"type":"markdown","label":"If you selected \"Too hard,\" please explain why (Optional):"},{"type":"checkbox","label":"Which aspects of the game play do you enjoy the most? (Select all that apply)","options":["Combat","Exploration","Storyline","Character progression","Other"]},{"type":"markdown","label":"If you selected \"Other\" in the previous question, please specify (Optional):"},{"type":"radio","label":"How satisfied are you with the variety of content in the game?","options":["Very satisfied","Satisfied","Neutral","Dissatisfied","Very dissatisfied"]},{"type":"markdown","label":"If you selected \"Dissatisfied\" or \"Very dissatisfied,\" please explain why (Optional):"}]},{"title":"Guide Quests","description":"I am interested in your experience with the Guide Quests. Do they make sense, and are they helpful?","input_types":[{"type":"radio","label":"Are the guide quests clear and easy to follow?","options":["Yes","No"]},{"type":"markdown","label":"If you selected \"No,\" please explain why (Optional):"},{"type":"radio","label":"How satisfied are you with the rewards from guide quests?","options":["Very satisfied","Satisfied","Neutral","Dissatisfied","Very dissatisfied"]},{"type":"markdown","label":"If you selected \"Dissatisfied\" or \"Very dissatisfied,\" please explain why (Optional):"},{"type":"radio","label":"How helpful did you find the guide quests overall?","options":["Very helpful","Helpful","Neutral","Unhelpful"]},{"type":"markdown","label":"If you selected \"Unhelpful,\" please explain why (Optional):"}]},{"title":"Crafting & Enchanting","description":"You might be new, and you might not have touched much of these systems with what you have gotten from the shop and or drops. But I am still curious about your feedback for these two systems. Is it intuitive, and do you understand how it works?","input_types":[{"type":"radio","label":"How intuitive do you find the crafting system?","options":["Very intuitive","Intuitive","Neutral","Confusing","Very confusing"]},{"type":"markdown","label":"If you selected \"Confusing\" or \"Very confusing,\" please explain why and how we can make the crafting system better (Optional):"},{"type":"radio","label":"How intuitive do you find the enchanting system?","options":["Very intuitive","Intuitive","Neutral","Confusing","Very confusing"]},{"type":"markdown","label":"If you selected \"Confusing\" or \"Very confusing,\" please explain why and how we can make the enchanting system better (Optional):"},{"type":"radio","label":"Has the Guide Quests helped you at all in your crafting\/enchanting journeys?","options":["Yes","No","Haven't got there yet"]},{"type":"markdown","label":"If you said \"No\", please explain why (Optional):"}]},{"title":"UI of the Game","description":"In this section I want to understand your experience as a new player or returning player with the UI of the game it's self.","input_types":[{"type":"radio","label":"Which platform do you play on the most?","options":["Desktop","Mobile (Includes Tablets)"]},{"type":"radio","label":"Are links and buttons and tabs clear to you?","options":["Yes","No"]},{"type":"radio","label":"Do you understand how to fight a monster?","options":["Yes","No"]},{"type":"radio","label":"Do you understand how to revive when you are killed?","options":["Yes","No"]},{"type":"radio","label":"Do you understand how to craft or enchant items?","options":["Yes","No"]},{"type":"radio","label":"Do you understand how to move around the map [Desktop]","options":["Yes","No","I play on mobile"]},{"type":"radio","label":"Do you understand how to move around the map [Mobile]","options":["Yes","No","I play on desktop"]},{"type":"radio","label":"If you use a screen reader is the game easy to navigate regardless of platform","options":["Yes","No","I do not use a screen reader"]},{"type":"radio","label":"How do you find the accessibility of the game?","options":["Excellent","Good","Poor"]},{"type":"markdown","label":"Do you have any other UI Feedback to help Tlessa improve? (Optional)"}]},{"title":"Final Thoughts","description":"Thank you so much for taking the time to fill out this survey. Your feedback is invaluable to Tlessa in my efforts to make this the best PBBG out there. I just have a couple final questions for you before giving you that shiny Mythic!","input_types":[{"type":"radio","label":"Would you recommend this game to your friends?","options":["Yes","No"]},{"type":"radio","label":"How did you hear about Tlessa?","options":["Reddit","Discord","Other"]},{"type":"markdown","label":"If you selected other can you tell me where you heard about Tlessa? (Optional)"},{"type":"markdown","label":"Final thoughts? Anything you wish to let me know that wasn't covered here? (Optional)"}]}],"created_at":"2024-08-20T23:25:47.000000Z","updated_at":"2024-08-23T18:17:29.000000Z"}]