

[{"id":1,"page_name":"rules","page_sections":[{"content":"<p>The rules are simple and straightforward.&nbsp;You can either follow them or suffer the consequences.<\/p><p>There are two forms of punishment in the game.&nbsp;One is being silenced,&nbsp;and the other is being banned.<\/p><p>A player can be silenced for 10,&nbsp;20 or 30 minutes.&nbsp;If the player is not online,&nbsp;and they will be emailed that they can speak again&nbsp;(assuming they have those settings enabled).<\/p><p>Players can be silenced via&nbsp;<strong>The Creator<\/strong>&nbsp;or through chat throttling&nbsp;(see below).<\/p><p>A player can be banned for 1 day,&nbsp;1 week or&nbsp;“For ever”.&nbsp;A banned player may request to be unbanned via the&nbsp;“banned unfairly?”&nbsp;form that can be accessed via the login screen.&nbsp;However,&nbsp;<strong>they can only make this request if they have been banned forever<\/strong>.<\/p><p>A player will be emailed if they have been banned and when&nbsp;(or if)&nbsp;the ban lifts.&nbsp;You cannot turn these emails off.&nbsp;You will also always be given a reason as to why you were banned.<\/p><p>Once the player fills out the form,&nbsp;any future requests will be ignored by the system.&nbsp;You will receive an email,&nbsp;regarding your request one way or the other.<\/p><p><strong>All decisions are final<\/strong>.<\/p><p>With that out of the way let's go over some rules of Tlessa.<\/p><h2>Core Rules<\/h2><ol><li>There is to be no RMT (Real Money Trade) of any kind in-game. This includes but not limited to: Items, characters, kingdoms, playing your character, managing your kingdoms.<\/li><li>Taking advantage of game bugs, including accessing parts of the game you are not allowed to, and failure to report said bugs can and will get you banned.<\/li><li>Hacking, Cheating, Scripting bots to play for you will also get you banned.<\/li><li>Third party tools of any kind will also get you banned.<\/li><li>Accessing other characters information and not reporting it as a security flaw will get you banned.<\/li><li>No racial slurs or other attacks on anyone for any reason other than playful banter in-game (see Free speech above)<\/li><\/ol><h2>Being Banned and Multiple Accounts<\/h2><p>Tlessa will let you have 10 accounts.&nbsp;<strong>DO NOT ASK FOR MORE<\/strong>.&nbsp;The emails must be unique.&nbsp;This game doesn't really support tunes,&nbsp;as you can't trade between players without using the market board.<\/p><p>Characters may log into multiple accounts,&nbsp;but may only send one request per client to the server at a time.&nbsp;This is called Multi Boxing.<\/p><p>Players may not use scripts or third party tools to manage multiple accounts.<\/p><p>Should one of the 10 characters be banned,&nbsp;even for a day or a week or god forbid,&nbsp;forever&nbsp;-&nbsp;<strong>ALL CHARACTERS<\/strong>&nbsp;will be banned.&nbsp;So if you and your house mate are playing,&nbsp;and they get banned,&nbsp;you just lost your account.<\/p><p>You can still do the&nbsp;\"banned unfairly\"&nbsp;request and I,&nbsp;The Creator will review the request.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<h2>Chat<\/h2><p>Since chat is a part of the game,&nbsp;The Creator,&nbsp;will never moderate chat unless it is in the best interest of the community.<\/p><p>Chat messages,&nbsp;including private messages are all logged,&nbsp;unencrypted and can be seen at any time&nbsp;(going back 90 days).&nbsp;Should the need arise The Creator can and will step in to deal the appropriate punishment.<\/p><p>Racial slurs,&nbsp;attacks on other people for any reason including but&nbsp;<strong>not limited to<\/strong>:&nbsp;Sexual Identity\/Preference,&nbsp;Racial Heritage,&nbsp;Age,&nbsp;Sex,&nbsp;Religious Affiliation or Disability.&nbsp;Will not be tolerated and will result in the appropriate punishment.<\/p><p><strong>Do not post your personal information in chat<\/strong>.&nbsp;This includes but&nbsp;<strong>not limited to<\/strong>:&nbsp;Email,&nbsp;address,&nbsp;real name,&nbsp;phone number,&nbsp;credit card or any other identifiable information about you.<\/p><p>With that said your location in-game is shown in chat as X,Y coordinates.<\/p><p>Last but not least,&nbsp;no auction in chat.&nbsp;If you want to sell something go to the&nbsp;<a href=\"about:blank\" rel=\"noopener noreferrer\" target=\"_blank\" style=\"color: rgb(10, 114, 133);\">market board<\/a>.&nbsp;Failure to head this rule can result in being silenced and then,&nbsp;for repeat offenders,&nbsp;banned.<\/p><h2>Chat Throttling<\/h2><p>A player may only send 25 messages every 1 minutes.&nbsp;Failure to heed this,&nbsp;and the system will auto silence you for 5 minutes.&nbsp;If you are not logged in when you can speak again,&nbsp;and have the email settings enabled,&nbsp;you will be emailed when you can speak again.<\/p><h2>\"Free\" Speech<\/h2><p>Just because chat is self moderated for the most part,&nbsp;does not mean The Creator will allow for hate speech,&nbsp;racism or wild conspiracies or the posting of&nbsp;\"fake news\".&nbsp;These are bannable offenses and will result in a silence,&nbsp;followed by an appropriate ban for repeatable offenses.<\/p><p>The Creator suggests,&nbsp;you leave religion and politics out of the general chat discussion.&nbsp;While I will not go and silence or ban someone for talking about current world events,&nbsp;if things do get out of hand appropriate measures will be taken.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":null},{"content":"<h2>Character Names<\/h2><ol><li>Character names may not have special characters in them (including emojis or asci characters).<\/li><li>Character names may not have spaces<\/li><li>Character names must be between 5 and 15 characters long.<\/li><li>Character names may only container letters of any case and numbers.<\/li><\/ol><p>If a character name is deemed to be offensive,&nbsp;that is it contains a racial slur or some other offensive slur,&nbsp;<strong>The Creator<\/strong>&nbsp;can and will initiate a forced name change.<\/p><p>Any attempt to circumvent changing your name including scripts,&nbsp;third party tools or hacks will get your account banned forever.<\/p><p>Once this popup shows up,&nbsp;even if you log out and back in or refresh the page,&nbsp;this popup will stay.<\/p>","display_order":"3","content_image_path":"rules\/Y3jPo64QwHOSeS8kT5bdRhzMREXitCB4QxOZT37r.png","live_wire_component":null}],"created_at":"2022-05-15T22:57:34.000000Z","updated_at":"2022-05-15T22:57:34.000000Z"},{"id":3,"page_name":"home","page_sections":[{"content":"<p>Welcome to Tlessa, a full-fledged, completely free, no cash shops, no pay to win PBBG that allows you to level, gear, craft, enchant, settle kingdoms and so much more.<\/p><p>The store of Tlessa is simple: The Creator has escaped from Purgatory, follow a series of Quests starting on surface to learn more about the NPC’s and the Creator himself. Help to answer questions, unravel the mystery of how and why The Creator escaped from Purgatory.<\/p><p>Tlessa has a lot of systems and a lot to do, most of which is gated behind quests. As a result, the game can be a bit confusing to figure out. As a result, players who signup can enable The Guide, who’s is a quest giver to help guide you through your first thousand levels.<\/p><p>That’s right, there are well over a thousand levels, but unlock additional character levels, you must complete quests, level your character, earn currencies and progress through the world. Are you ready?<\/p><h2>&nbsp;Key Features<\/h2><ul><li>Market board where players can list and buy enchanted gear<\/li><li>Scaling drops (as you level, so do the drops you get from monsters to an extent and utilizing RNG)<\/li><li>6 Planes of existence to explore and fight monsters on.<\/li><li>&nbsp;Automation for fighting called Exploration.<\/li><li>Crafting\/Enchanting\/Alchemy\/Trinketry to gear and push your stats further.<\/li><li>Queen of Hearts and Unique items<\/li><li>&nbsp;Faction Farming<\/li><li>Well over 60+ Quests<\/li><li>&nbsp;Hours, months, day and weeks of content.<\/li><\/ul><p>Players are not gated behind energy systems, instead we use Timers to slow you down. Some timers lock you out of specific features, such as exploration. Others can be hidden away, such as Kingdom management.<\/p><p>You can play for an hour, three or ever … You can play for ever. Questions?<\/p>","display_order":"1","content_image_path":null,"live_wire_component":"null"}],"created_at":"2022-05-18T21:02:24.000000Z","updated_at":"2022-05-18T21:13:08.000000Z"},{"id":4,"page_name":"exploration","page_sections":[{"content":"<p>Tlessa offers players a way to take the monotony out of clicking Attack repeatedly for enemies.<\/p><p>Players can engage in what’s called Exploration.<\/p><p>Exploration allows players automate the attacking process and still engage with the game to move, manage their kingdoms as well as craft.<\/p><p>It does limit players from being able to use items on themselves, cancel boons, equip other gear or manage their skills be they trainable or passive. You cannot enter special locations, paricipate in hunting or fighting celestials. You cannot hand in Quests or Guide Quests while automation is running.<\/p><p>While you are exploring you will go through two phases. One is fight with you and the creature you selected one and one and then another with between one to seven of the same creatures, each fight happens back-to-back.<\/p><p>Should you die during exploration, you will be told and can click the exploration button to see the output the battle, assuming you are logged in. The beauty of Exploration is you can log out and it will run for the set length of time.<\/p><p>Items, xp, skill xp, gold and other currencies are given to you automatically.<\/p><p>Quest items from special locations will NOT drop while exploration is running, other quest items will though.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":"null"},{"content":"<p>How to get started with exploration<\/p><p>First, click the exploration button. If this is colored in, it is disabled because you are dead.<\/p><p>Next select a creature, a length of time and the attack type. Optionally you can select wether to automatically move down the monster list every X levels. New players are suggested to set this to 20, then 10 then 5 as their gear progresses.<\/p><p>What this means is every X levels, move one down the list. This repeats for the duration till the timer runs out, you die or the monster list is exhausted. In that case we fight the final creature, over and over again.<\/p><p>If you have auto disenchant turned on, all drops will follow your disenchanting pretences.<\/p><p>Once satisfied click the explore button.<\/p>","display_order":"2","content_image_path":"exploration\/1MOZesNMtFa7lVzxorQkWj7in5YtzMWDwmti7OMs.png","live_wire_component":"null"},{"content":"<p>You can see the timer under the map. You can still move around the map, the two timers will just sit side by side.<\/p>","display_order":"4","content_image_path":"exploration\/6RJlUywX1oWtPwz7BAZ8x0nnpKzBHLnZzxzMzbh2.png","live_wire_component":"null"},{"content":"<p>Exploration gets players a few things:<\/p><ul><li>Drops (if auto disenchanting is off)<\/li><li>Gold<\/li><li>Gold Dust if you are auto disenchanting<\/li><li>XP<\/li><li>Skill XP (if training)<\/li><li>Certain Quest items<\/li><\/ul><p>Players also receive what’s called <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">Faction points<\/a>. As players earn these points and gain specific milestones, they will get what’s called unique items (basic at first till you get access to Hell).<\/p><p>These can give you a leg up in Battle and can be sold on the market board.<\/p>","display_order":"5","content_image_path":null,"live_wire_component":"null"},{"content":"<p>When in exploration check the Exploration tab beside Server Messages, in the chat section.<\/p><p>Every 5 minutes you will do an encounter, as described above. At the end of the time you selected you will also be rewarded with 10,000 gold, regardless of time selected.<\/p>","display_order":"3","content_image_path":"exploration\/rzNrgOklPlEk58UjhRY0C5tI1Pls27BOaiOFZGVV.png","live_wire_component":"null"}],"created_at":"2022-05-18T21:29:08.000000Z","updated_at":"2022-05-25T04:18:44.000000Z"},{"id":5,"page_name":"races-and-classes","page_sections":[{"content":"<p>In Tlessa there are a few Races and classes you can choose from. You are free to pick whatever Race and Class you want to play as, however if you are a min\/maxer, you might be interested I the below information.<\/p><p>When it comes to picking a race, you want one that will complement the class you plan to play as. All classes have their own play style, suggested attacks, and gear. All classes also have special attacks, based off their class skill and equipment requirements.<\/p><p>When picking a race\/class combo look for one who’s stats align to either double or come close to doubling the racial or class stat, specifically for “to hit” and “damage”.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":"null"},{"content":"<h2>Races of Tlessa.<\/h2><p>Below are a series of races you can choose from. You can click each one to see the stats with the inclusion of Skill modifiers and defence modifiers.<\/p><p>Some classes and Races play nice together when giving bonuses to skills, such as Accuracy, Dodge or Looting. These are your three primary skills, with Accuracy being most important and (to a lesser degree) Casting Accuracy, which no race or class gives bonus too. This skill is intended for Casters using Damage spells.<\/p><p>As a new player, if you want optimization, go for a race that gives the highest accuracy.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":"admin.races.races-table"},{"content":"<h2>Classes of Tlessa<\/h2><p>Below are a series of classes to choose from. Some use two handed weapons such as Hammers, Bows, Staves, while other can wield any weapon. All classes have a hints, tips and tricks section that essentially tells you the most optimal way to play your class.<\/p><p>Again, feel free to experiment.<\/p><p>Much like Races, classes effect your stats and your skills, Dodge, Looting and Accuracy as well as your defence Modifier or Armour Class.<\/p><p>All classes have a To Hit and a Damage Stat. To Hit means the stat we use in conjunction with Accuracy to see if you can hit. Damage is used as your primary damage stat, added to your weapons and so on. These two stats are vital for you to raise via gear, which all gear will raise these stats to some degree.<\/p>","display_order":"3","content_image_path":null,"live_wire_component":"admin.classes.classes-table"},{"content":"<h2>Regarding Class Bonuses<\/h2><p>Each class has a special attack, even the one you selected. This fire based off a few factors: Do you have the appropriate items equipped and is your chance high enough.<\/p><p>You can see your class bonus on the character sheet under the inventory information section, see the relevant screen shot to the side or below if on mobile.<\/p><p>These will fire automatically on your turn when attacking. There is only one way to increase this chance: Gear. Specifically, enchantments. If you follow the enchantments link and filter the enchantments table by class bonus, then you get all the enchantments that effect the class bonus.<\/p><p>The higher this bonus the more chance for these special attacks to fire, which can help take down harder creatures.<\/p><p>Click your class above, to read more about their special attacks and for tips and tricks.<\/p>","display_order":"4","content_image_path":"races-and-classes\/L9jyYgDIYaorxBoRcUjoKcOyZJ9iHMSkyJLH4Lo7.png","live_wire_component":null}],"created_at":"2022-05-19T18:05:37.000000Z","updated_at":"2022-05-24T17:40:01.000000Z"},{"id":6,"page_name":"combat","page_sections":[{"content":"<p>When it comes to Manual combat, which is the same for server-side combat (ie, Exploration, Celestials or <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">PVP<\/a> fights) there are five primary attacks to take into consideration and your class will play a big role in your choice. But for now attack, the first one you see in the above image will do till you can get more gear and better situated with your class.<\/p><p>The five attacks are:<\/p><ul><li>Attack (uses both your weapons)<\/li><li>Cast (uses both your spells)<\/li><li>Cast and Attack (Uses the weapon in the right hand and the spell in spell slot two.)<\/li><li>Attack and Cast (Uses the weapon in the left hand with the spell in spell slot one.)<\/li><li>Defend (Buffs your AC and only uses your affixes and rings) – Vampires Special can fire here, other class special cannot.<\/li><\/ul><p>Some classes like Prophets start out best with a weapon, shield, healing spell and ring and can use cast and attack or attack and cast depending on which hands their weapons and spells are in. This allows prophets to heal and attack.<\/p><p>Others like Vampires want two shields, later one as they have more durability and have some life stealing affixes. Their primary attack is defend at that point.<\/p><p>This is just the basics of combat. Players who want to min max their characters and get the best damage, will read their <a href=\"\/information\/races-and-classes\" rel=\"noopener noreferrer\" target=\"_blank\">class description<\/a> and invest in <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a> gear with the appropriate enchantments to get the most out of their character.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":"null"},{"content":"<p>Welcome to combat. There are two types. Exploration and Manual. <a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a> takes care of everything for you, while with manual, you must select the monster, click attack, select an attack button, kill the creature, click attack again and repeat.<\/p><p>There are times when you must do manual combat, such as Special Locations who quest items used in the games various quests will not drop if you are using exploration in that location. Celestials require manual fights and so does regular PVP.<\/p><p>Combat is how you level your character, it’s quite easy, let's jump in.<\/p>","display_order":"1","content_image_path":"combat\/YsbDq7zOqO1friQCrMY11302QAPVCESA7uCDAtoo.png","live_wire_component":"null"},{"content":"<h2>Regarding Pre-Attack messages<\/h2><p>One thing to keep in mind as you find more gear and equip it, is what’s called: Pre-Attack Messages” See the image to the side (or below on mobile).<\/p><p>There are various <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchantments<\/a> and <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quest items<\/a> that can do things such as reduce the enemies’ stats, reduce their skills so they can’t hit, <a href=\"\/information\/voidance\" rel=\"noopener noreferrer\" target=\"_blank\">devoid them so they cannot void you<\/a>, void them so they cannot fire their enchantments. You can also be voided so your enchantments and rings do not fire for the damage aspects.<\/p><p>These types of affixes can help turn the tide of the battle, especially later on in game when you start fighting even harder creatures where enchantments such as these matter.<\/p><p>They also only fire once at the beginning of battle<\/p>","display_order":"3","content_image_path":"combat\/kJ5ErB4hosm6CKdvQHaCz3kvbhuSO8JizvlDLQEE.png","live_wire_component":"null"},{"content":"<h2>Ambush and Counter<\/h2><p>Later on, when you are far enough along to craft Trinkets, you will encounter two new stats: Ambush and Counter.<\/p><p>Ambush allows you to ambush the enemy before any one even attack. If your ambush kills the enemy – that’s it.&nbsp;This is useful for PVP.<\/p><p>Counter allows you to counter the enemies attack. But beware, they can counter your attack.<\/p><p>Enemies in Purgatory, where you need to be to get Copper Coins, have Ambush and Counter Chances. Trinkets give you Ambush and Counter Chance AND resistances.<\/p><p>A player with 2 trinkets can have up to a max of 95% Ambush\/Counter Chance\/Resistance.<\/p><p>In regular battles, that is Player Vs Monster\/Celestial, players will attempt to ambush and then the enemy will attempt to ambush. However, in <a href=\"\/information\/player-vs-player\" rel=\"noopener noreferrer\" target=\"_blank\">PvP<\/a> You will attempt to ambush the player and that is it. They will not auto attempt to ambush you.<\/p><p>Another thing to note above pvp is that if you and the enemy have a 95% resistance and chance, this would technically mean you have 0% chance (95% chance - 95% resistance = 0% chance). To get around this, we give players a base line of 5%, so: 95% - 95% = 5% minimum.<\/p>","display_order":"4","content_image_path":null,"live_wire_component":"null"}],"created_at":"2022-05-24T16:54:03.000000Z","updated_at":"2022-06-16T03:12:42.000000Z"},{"id":7,"page_name":"factions","page_sections":[{"content":"<p>Players can get 25 uniques from doing all 5 levels of each faction. Alas that will take a while and by the time you get to hell you will have crafted an enchanted gear better then these.<\/p><p>If your inventory is full upon being rewarded for leveling up a faction you will not receive the unique.<\/p>","display_order":"3","content_image_path":null,"live_wire_component":null},{"content":"<p>Factions are Tlessa’s way of gating and rewarding players with gear for completing milestones for each faction or levels.<\/p><p>We use Factions in a lot of Quests and players are encouraged to use Exploration to do their faction farming. All you have to do is be on the plane of the Faction name and kill creatures.<\/p><p>As stated, each Faction has a series of levels from 0 to 5. The points required will double each level and you will receive what’s called a Unique.<\/p><p>This item is a part of Tlessa’s Gear Progression System and is considered mid-level.<\/p>","display_order":"1","content_image_path":"factions\/0DL6KkNQ1FbpsKeMAuNi58rmGhl4103A9amYlTOI.png","live_wire_component":null},{"content":"<p>When players reach a new level, they can obtain a new Green Unique with completely randomly rolled stats. Chances are this item is better than what you have on, so equip it. Alas you can only have one equipped at a time.<\/p><p>Later in the game, you can unlock the Queen of Hearts who will re-roll these and allow you to purchase even better ones and re-roll those and move their affixes to your own gear!<\/p><p>A unique is considered a unique if it has at least ONE randomly rolled enchantment on it.<\/p>","display_order":"2","content_image_path":"factions\/w56rjEiiTedsnd9DtAjQeZi7RMsPaSxY9F78cqMy.png","live_wire_component":null}],"created_at":"2022-05-25T04:26:38.000000Z","updated_at":"2022-05-25T04:26:38.000000Z"},{"id":8,"page_name":"player-vs-player","page_sections":[{"content":"<p>Here you can see the server message updated for the attacker. If you got the mythic it would show here and be a global message.<\/p><p>If the player you are attacking has moved when you click attack, that will show here too.<\/p>","display_order":"5","content_image_path":"player-vs-player\/vjknMcTbYvMiaefEm6aCfaSAigQJ4t0hkT51mhEt.png","live_wire_component":null},{"content":"<p>Welcome to PVP. Let me first state a couple things:<\/p><ul><li>PVP is meant to be fun.<\/li><li>PVP is not required to advance in Tlessa<\/li><li>The Creator can and will ban players for 1 day, 1 week or for ever for repeated offenses of harassment or stalking (there are limitations on my power here, read on)<\/li><li>Characters levels 300 and below cannot participate in PVP and will never see the Duel Button.<\/li><\/ul><p>With that out of the way lets discuss what Tlessas PVP offers.<\/p><p>When players want to engage with each other, all they have to do is be at the same location as another player or set of players. When you are you will see the duel button.<\/p><p>When players die in PVP, <strong>they lose nothing<\/strong>. No gear, no gold, no XP no nothing. You are moved to a safe location that you can walk on, and you are given a flag for two minutes where no one can attack you.<\/p><p>When you chat with this flag, your location is masked.<\/p><p>You will be told when this flag is removed and then you can be targeted again.<\/p><p>It is not a crime to kill someone just because you can. It is also not a crime to stalk someone and repeatedly kill them.<\/p><p><strong>If a player asks you in chat to stop. You stop.<\/strong> Failure to do so will result in a warning and appropriate punishment for follow up attacks when specifically asked not to.<\/p><p>Attacking someone because they are rude to you in chat is appropriate to teach a lesson, to a point.<\/p><p>The entire PVP aspect of the game is self moderated. It is your job to reach out in discord if you feel you are being unfairly attacked.<\/p><p>When you kill another player there is a small chance to get a new type of unique: Mythic. These show up as orange are the most powerful item in the game. These are randomly rolled and can be re-rolled, and the enchantments moved to your own gear Through the Queen of Hearts.<\/p><p>You can sell these for half their valuation on the market.<\/p><p>Finally, PVP is literally your attack &gt; their attack with a few other caveats thrown in we will discuss. <\/p><p>How do you engage in PVP? Let’s discuss.<\/p>","display_order":"1","content_image_path":"player-vs-player\/gdTU0JRIBM797iCp10fYaRsaHN3YNBBbmnLIFbfi.png","live_wire_component":null},{"content":"<p>First, click the duel button to open up the PVP Section. Again, you will not see this button if there is no one around.<\/p>","display_order":"2","content_image_path":"player-vs-player\/e4smJawP1k5nkJ8ehrZ8wSiAwKKyXk9bpeQogakp.png","live_wire_component":null},{"content":"<p>Next click attack. Your enemy can move at any time, we do not lock them in place. You won’t know if the enemy has moved until you go to actually attack and get told that hey your enemy moved.<\/p>","display_order":"3","content_image_path":"player-vs-player\/cqrAAFhiBiiI1ZsaTTAf82kBvMKVwvtCoUmTXmlX.png","live_wire_component":null},{"content":"<p>Finally, you will see in your server message section the messages about who killed you and that we moved you some where safe and put a flag on you for 2 minutes.<\/p>","display_order":"7","content_image_path":"player-vs-player\/dxWgbvAY8iiLZyWkEtvIqMR2OCPbIQNDfSIC7a1S.png","live_wire_component":null},{"content":"<p>Here we see we attacked the player, we killed them.<\/p><p>We also see that the select is empty and we are told that no one is around. In our example the character we killed was moved to a safe location to prevent spawn camping.<\/p><p>Remember, they have a two-minute flag and if they never chat, then you never know where they are.<\/p><p>These attacks are different then monster attacks.<\/p><ul><li>You won’t reduce the players stats, so stat reduction is out.<\/li><li>You can reduce the skills, but they can then turn around and reduce yours I the same breath.<\/li><li>You can void them, they you – again same breath.<\/li><li>You can devoid them, they you – again same breath.<\/li><\/ul><p>This all happens before the actual attack, then you will attack, if they are dead, they will attempt to resurrect – assuming they have healing spells, then. – if they have life stealing affixes – attempt to steal some of your life, just like with monsters.<\/p><p>The only thing that won’t happen, is the player auto attacking you, like a celestial does if you don’t kill it in one hit. If you do not kill the player in one hit, they have a chance to retaliate by clicking the attack button, we will see what happens to defenders in a moment.<\/p>","display_order":"4","content_image_path":"player-vs-player\/2aDLn0ifNZ5GxSl8BjeEfFiXRDt8GOhGbRJRUh61.png","live_wire_component":null},{"content":"<p>Here we can see what the defender sees.<\/p><p>Regardless of what they are doing, unless it’s exploration as you cannot be targeted in exploration, the PVP section will auto open and show you what is happening when you are attacked.<\/p><p>In this case you can see that we were killed.<\/p><p>As you can see some of your abilities will auto fire for you, but you won’t auto attack the enemy after they have finished. If you have healing spells and a high life stealing enchantment(s) on your gear, you have a chance to resurrect and steal some of the players health.<\/p><p>This will let you then attack and attempt to kill them. In this case we died, we were moved to a location with no players, so all we can do is revive and leave the battle.<\/p>","display_order":"6","content_image_path":"player-vs-player\/HXop6lGWUbvbMvLtndK0kEi2iYu4cmeenzNUmnFg.png","live_wire_component":null}],"created_at":"2022-05-30T02:49:52.000000Z","updated_at":"2022-05-30T02:49:54.000000Z"},{"id":10,"page_name":"voidance","page_sections":[{"content":"<p>Tlessa has a concept that becomes more apparent later, it’s called Voidance and Devoidance. In game we call this Devouring Light (Voidance) and Devouring Darkness (Devoidance).<\/p><p>Enemies in special locations, starting on surface, have small amount of these stats. The further down the plane list you go, into Purgatory, the higher these values on enemies become.<\/p><p>There are various quests to do which grant items that increase both stats.<\/p><p>Holy Items also increases these stats later when you have access to the Purgatory Smiths Work Bench.<\/p><p>These will fire automatically, after you click attack and before you click the attack button. This is what’s called pre battle effect’s<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<h2>How do this work?<\/h2><p>Once you start getting further along in the game, you will run into creatures that void you. This means your fancy equipment that boosts all your stats, becomes useless. None of your enchantments will fire, you will use base stats for everything.<\/p><p><strong>Note<\/strong>: If you are voided, your rings and affixes will not fire. However, your secondary ring effects will still fire on the enemies turn. This includes spell evasion and healing reduction (to the enemy)<\/p><p>This can be mitigated by you having Devouring Darkness (Devoidance) which will stop the enemy from being able to void you.<\/p><p>Some enemies also have Devouring Darkness which prevents you from voiding them. This is where resistance enchantments come in.<\/p><p>Voidance and Devoidance last the entire battle.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":null},{"content":"<h2>What about PVP?<\/h2><p>In pvp, resistance enchantments are also needed to reduce the other players Devouring Light and Darkness Resistance.<\/p><p>Monsters and celestials do not have resistances to devouring light or darkness, but players do. If you can reduce their voidance\/Devoidance, you can have a chance to ne shot kill them.<\/p>","display_order":"3","content_image_path":null,"live_wire_component":null}],"created_at":"2022-06-04T01:39:42.000000Z","updated_at":"2022-06-04T01:39:42.000000Z"},{"id":11,"page_name":"settings","page_sections":[{"content":"<p>The Settings page can be accessed by tapping or hovering over the circular user icon at the top right. From here you can tap\/click on settings to see the page to the right (bottom, for mobile).<\/p><p>This page lets you:<\/p><ul><li>Delete your account<\/li><li>Reset your Character<\/li><li>Enable or Disable Chat\/Email Settings<\/li><li>Enable and Manage Auto Disenchant Settings<\/li><li>Enable The Guide (if under level 10)<\/li><li>Change your character name.<\/li><\/ul><p>When it comes to deleting your account, we will wipe your entire account -email and password and send you a final confirmation email.<\/p><p>When it comes to resetting your account, we delete your character and all that is associated, but not the user account. We will re-roll you a fresh character based on your chosen race and class, or you can keep your race and class and just re-roll to start over.<\/p><p>When it comes to changing your name, you are free to name your self what ever. If the community or The Creator deem it inappropriate you will be greeted with a \"force name\" change modal that cannot be dismissed.<\/p><p>Finally, the guide cannot be enabled for characters over level 10 as he is meant to help new players. Characters can re-roll and enable him. You cannot turn him off. You will see a green Guide Quest button at the top of the screen.<\/p><p>Clicking this will open your first quest, Guide quests have a bit of story, requirements, and instructions.<\/p>","display_order":"1","content_image_path":"settings\/B04wTWMhFSKY2IjEm1sxxdtDMNEsNM0wZgXuZEIu.png","live_wire_component":null}],"created_at":"2022-06-04T03:02:45.000000Z","updated_at":"2022-06-04T03:02:45.000000Z"},{"id":12,"page_name":"monsters","page_sections":[{"content":"<p>The primary thing you do in Tlessa is kill monsters. This can be done through manual fighting or exploration.<\/p><p>Either way monsters play a big part of your progression, the primary driving force to keep you going.<\/p><p>Monsters drop random gear that scales with your character level to a point per plane and only ever to max of level 300 crafting\/enchanting. This means players still have to craft and enchant to get the top gear.<\/p><p>Below is a list of monsters. You can filter by plane.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":"admin.monsters.monsters-table"},{"content":"<p>There are places in the world of Tlessa, such as special locations and Planes below Dungeons such as Shadow Plane, Hell, and Purgatory where monsters’ stats get higher than what’s listed here.<\/p><p>The stats above are base line, as if they were all on surface. Special locations on each plane can raise the enemy strength, while planes do the same but also weaken your character.<\/p><p>Gear is your only way forward. Whether you find it, buy it or eventually are forced to craft and enchant it.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":"null"},{"content":"<h2>Regarding Celestials<\/h2><p>As you have seen in the list above, there are Celestials for each plane as well, most of the planes anyhow.<\/p><p>These creatures can be Conjured via the conjure button on the map, or in the drop down of actions for mobile players.<\/p><p>These creatures, most of them, will spawn every Wednesday at 1pm GMT-6 for 24 hours. They have, on this day, an 80% chance to spawn by you just moving around.<\/p><p>Killing them gets you rewards such as items, quest items, gold and a currency called: Crystal Shards which is used in Alchemy.<\/p><p>You can learn more about celestials, including how to conjure, <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">here<\/a>.<\/p>","display_order":"3","content_image_path":null,"live_wire_component":"null"}],"created_at":"2022-06-04T17:15:05.000000Z","updated_at":"2022-06-04T17:28:26.000000Z"},{"id":13,"page_name":"celestials","page_sections":[{"content":"<p>When it comes to stronger creatures in the game, Celestials are the creatures you want. They are not cheap to conjure and exist per plane. See the monster’s section and filter by Plane Name Celestials, where the Plane Name is the one you want.<\/p><p>Celestials have stronger stats then top end creatures and require good gear to take down. A level 1 character will die a horrible death. But a level 100 character who has been investing in enchanting and crafting may have a chance at some of the Surface Celestials.<\/p><p>Celestials can be conjured by clicking the conjure button (see image to the left or bottom for mobile).<\/p><p>You need two <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Currencies<\/a>: Gold and Gold Dust.<\/p><p>Gold, you get from killing, exploration, selling your enchanted items to the shop or the market.<\/p><p>Gold Dust you get from <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">disenchanting<\/a> enchanted items and the daily Gold Dust Lottery at 12 pm Noon GMT-6 for a chance to get 10k gold dust.<\/p><p>Once you have these and decent gear you can click conjure to begin the process.<\/p>","display_order":"1","content_image_path":"celestials\/10IeD16xet91knJMf5LTa8Y4izdTlwYEAc6ykYOB.png","live_wire_component":null},{"content":"<p>When you come upon the Celestials location, again you will be told via the Server Message tab down by the chat, or in the chat as a global message, you will see a new button appear.<\/p><p>Click this to begin the attack. From here its about selecting which attack and clicking it. This is a server side fight, so it can take a second to process the fight.<\/p><p><strong>For mobile players<\/strong> when you come to the location of the Celestial, your actions drop down will update with a option called Fight Celestial, select this to engage with the celestial.<\/p>","display_order":"3","content_image_path":"celestials\/OaYzr5C8gNwXOQZHXr4wiTCGL2ARxbWQWNZ5fR5I.png","live_wire_component":null},{"content":"<p>From here you can see the conjuration window will popup and let you select a Celestial for that plane to conjure. This can be private or public.<\/p><ul><li>Public means every one will see the location of the creature you spawned, meaning any one can come and kill it before you have a chance too.<\/li><li>Private means the global message still goes out but you, and only you, get the location of the creature.<\/li><\/ul><p>Celestials are a first come first serve to get the treasure they drop. If you fail to kill one, in one hit, it will flee and tell people where it went to, even it was a private conjuration.<\/p>","display_order":"2","content_image_path":"celestials\/EA0YVY8iULhWrol4hhgYnH2zVGeYcK0utQqmyRuq.png","live_wire_component":null}],"created_at":"2022-06-04T17:38:38.000000Z","updated_at":"2022-06-04T17:38:38.000000Z"},{"id":14,"page_name":"quest-items","page_sections":[{"content":"<p>Tlessa has a series of <a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">quests<\/a> that progress the player through the world and unlock new features over time. There are a series of quest items that go along with these quests, some effect your character, some are just for handing in.<\/p><p>You can get these items from:<\/p><ul><li>Celestials<\/li><li>Monsters<\/li><li>Special Locations<\/li><li>Other quests as rewards<\/li><\/ul><p>Below you can see a list of quest items the game offers. All of which are obtainable by just playing the game.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":"info.quest-items.quest-items-table"}],"created_at":"2022-06-04T17:46:36.000000Z","updated_at":"2022-06-04T17:48:13.000000Z"},{"id":15,"page_name":"quests","page_sections":[{"content":"<p>Tlessa offers a series of quests in the form of long tree like quest chains that offer explicit details on how to complete the quest.<\/p><p>All quests must be done from top down, as the player completes them, they unlock new features, get new rewards and progress further.<\/p><p>Quests are nothing. More than “fetch” quests. That is: Get your faction here, have this item, get access to this plane.<\/p><p>They are meant to be simple, with clear goals and direction.<\/p><p>Quests also offer story, a bit of story before and after the completion of the quest.<\/p><p>There are quests per plane with two types: Quest Chain and One Off Quests.<\/p><p>Quest Chains, like you see to the right, or bottom if you are on mobile, can be long and have you interact with many NPC’s across many planes.<\/p><p>Just because you see the Surface quest chain, doesn’t mean all those quests are on surface, they just happen to be a part of the tree.<\/p><p><strong>Note:<\/strong> because quests are done in a tree fashion, there is no list of quests you can see on this page.<\/p>","display_order":"1","content_image_path":"quests\/gDxO9cB94yUhHha1Ra91ZjfmExrVqDvpFM6RrWkB.png","live_wire_component":null},{"content":"<p>Clicking the requirements tab will show you what you need to complete this quest. You can click the help icon to open another modal to show the explicit details of how to get the item, currency you need.<\/p><p>Finally, all quests make use of <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">quest items<\/a> or <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">currencies<\/a> or <a href=\"\/information\/factions\" rel=\"noopener noreferrer\" target=\"_blank\">factions<\/a> (or all three) to proceed.<\/p>","display_order":"3","content_image_path":"quests\/AE5FN13Mcf5DRVkdq1JYxWaqjNVh09fpeJlpE8DI.png","live_wire_component":null},{"content":"<p>When you click on a quest you can see three tabs: Details, Required to Complete and Reward.<\/p><p>The Details section states npc details, who the quest belongs to, where they are and if you must be at their location to complete the quest.<\/p><p>That last part, being at that location. You can be anywhere in game, but when you click handing, we auto transport you to the NPC to hand in the quest.<\/p><p>Finally, under the npc details is the “before completion” story, all of these quests in the tree are connected to tell one overarching story.<\/p><p>When you complete the quest that section will update to give you “after completion” story.<\/p><p>You can review this in your quest logs, by clicking the hamburger menu at the top left to open the side bar and select Quest Log followed by Completed Quests.<\/p>","display_order":"2","content_image_path":"quests\/oUYw6RrB6i6O0DL8iATblexBNDNMaUMXNPrP90w8.png","live_wire_component":null}],"created_at":"2022-06-04T18:00:25.000000Z","updated_at":"2022-06-04T18:00:25.000000Z"},{"id":16,"page_name":"crafting","page_sections":[{"content":"<p>Crafting in Tlessa is easy. It requires nothing but time. You will fail more than not at first, but that’s what quest items are for.<\/p><p>As you work your way down the monster list it’s possible for you to get the basic Crafting Books, which you can see below.<\/p><p>To the right, or bottom (for mobile) is an image with the crafting button. This is a drop down where you can select crafting or enchanting or other crafting skills assuming you have them unlocked. And meet requirements for them to show in your list.<\/p><p>Players often ask: “Why should I craft if I am only crafting shop gear?” and also “Why craft at all if the enemy drops scale?”<\/p><p>To answer point one, shop gear only goes to a max price of 2 billion. You can craft well beyond that. Since enemies now scale their drops, each plane has a limit of scaling and the drops are all random, so you could get an item that’s good or an item that has amazing affixes but is worse than what you have equipped.<\/p><p>Purgatory is the 6<sup>th<\/sup> plane in the game going down. This plane drops gear up to a max of level 300 for crafting\/enchanting, there’s 400 levels to crafting\/enchanting.<\/p><p>Let’s discuss how to craft.<\/p><p><strong>Note: There is no automation for any of the actions in the drop down for Craft\/Enchant.<\/strong><\/p>","display_order":"1","content_image_path":"crafting\/ekPTLxPgSy0C9ecwhdTh21rIMh7WFyVWkbmobHdr.png","live_wire_component":"info.quest-items.crafting-books-table"},{"content":"<p>For this example, we are going to select craft from the drop down in the previous image.<\/p><p>Here you can see that we have a bunch of subcategories (to the right or bottom for mobile).<\/p><p>It is important to know that for weapons, there are sub categories: Hammers, Staves, Bows - these each correlate to their respective class and are two handed weapons.<\/p><p>Blacksmiths, Arcane Alchemists and Rangers make use of: Hammers, Staves, Bows respectively.<\/p><p>Of course, <strong>any class, any item - no restrictions<\/strong>, except when it comes to your <a href=\"\/information\/races-and-classesclasses\" rel=\"noopener noreferrer\" target=\"_blank\">classes<\/a> requirements to fire of your special attack. For more info click the link, find your class, click it in the table and read about its tips and tricks.<\/p><p>The table above shows a list of <a href=\"\/information\/quest-items\" rel=\"noopener noreferrer\" target=\"_blank\">quest items<\/a> relevant towards crafting\/enchanting. If you click on an item, it will tell you explicitly how to get that item.<\/p><p><strong>Note:<\/strong> It is suggested players go and get these items for their relevant crafting before attempting to craft. You will fail more than you succeed at first.<\/p><p>Below is all the items you can craft, again these start with shop gear and progress beyond.<\/p>","display_order":"2","content_image_path":"crafting\/4dEl1beGdbIlV48lY8hcPCpwtVU03seHmhXyjxQS.png","live_wire_component":"info.items.craftable-items-table"},{"content":"<p>Finally, in the image (to the right or bottom for mobile) you can see that we have selected our broken dagger and then clicked Craft.<\/p><p>There are no requirements for ingredients, just currency.<\/p><p>For example, Crafting uses Gold, Alchemy uses Shards and Gold Dust and Trinketry uses Gold Dust and Copper Coins.<\/p><p>If you have the currency and can craft the item, all you have standing between you and the item is the chance to craft it, which comes with time (levels) and gear. Again, at first this will be slow and grindy.<\/p><p>You can change the crafting type or close the crafting section. You can also manually fight while crafting, if you are not in the middle of exploration, which is the best time to craft\/enchant.<\/p><p>You can also see we have a timer that’s 10 seconds between crafts and the server messages tab shows you that we crafted this item and that for us, it’s too easy.<\/p><p>That’s all there is to crafting.<\/p>","display_order":"4","content_image_path":"crafting\/FPNZHsrFPOWvhucQsw12ZUuJAGN5SU97Q0Qryp7R.png","live_wire_component":null},{"content":"<p>In the image to the right (bottom for mobile), we have selected weapons, and now we can see a list of weapons we can craft.<\/p><p>Weapons are always single handed, allowing you to duel wield two of them.<\/p><p>Here you can see my list will look longer than yours, that’s because over time you unlock the items to craft. You can see the list above has a min skill level required and a skill level when the item becomes trivial, or too easy.<\/p><p>Crafting Is vital to game progression as shop gear only takes you so far.<\/p>","display_order":"3","content_image_path":"crafting\/Odnj9sruCpsVGhhEcfLqU5Rct6sEIPUnV3FgohBP.png","live_wire_component":null}],"created_at":"2022-06-05T15:32:19.000000Z","updated_at":"2022-06-05T15:48:08.000000Z"},{"id":17,"page_name":"enchanting","page_sections":[{"content":"<p>Enchanting is one of Tlessa’s primary and most important ways to progress your gear.<\/p><p>There are a ton of enchantments, and the table below will let you filter by various types of enchantments. These are also known as, Affixes.<\/p><p>There are two types of enchantments: Prefix and Suffix.<\/p><p>Items from monsters can drop with magical enchantments on them. These will scale with the players level and get higher and better as you progress down to Purgatory. However, they are all random enchantments on random items.<\/p><p>For example, in Purgatory you can get level 300 crafting gear with level 300 enchantments on them. However, because of RNG, it's between level 1 and 300.<\/p><p>Enchanting also gets very expensive quickly, therefore players also want to disenchant the enchanted items they make through enchanting to not only get <a href=\"information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a>, but also level enchanting it’s self at half the rate.<\/p><p><strong>Tip for new players:<\/strong> craft yourself a set of enchanting gear, enchant a series of items, disenchant them. Through this process you will level enchanting very quickly.<\/p><p>The last thing to know about enchanting is that it requires intelligence. The most expensive enchant requires 1000 int to craft, if you have no gear on and are less than level 1000 the enchantments will not show for you in the list.<\/p><p>We fetch the enchants you can create based on your skill level and your intelligence. If you are not a heretic or other class where int is your primary damage (this means it gets 2 points per level) and are less then level 500, you will need to craft gear that raises your int, so you can enchant higher level and int required items.<\/p><p><strong>Note:<\/strong> There is not enchantments for Alchemy or Quick Feet Skill. Instead, For Quick Feet, Use <strong>Move Timeout Modifiers<\/strong><\/p>","display_order":"1","content_image_path":null,"live_wire_component":"admin.affixes.affixes-table"},{"content":"<p>Just like with Crafting you can also fight monsters while crafting, see the image to the right or bottom for mobile.<\/p><p>To get here all you have to do is select Enchant from the blue Craft\/Enchant drop down.<\/p><p>For mobile, select Craft from the actions drop down, then select enchant from the blue drop down. From here the steps are the same on mobile and pc.<\/p><p>As you can see there are three selects, Select the Item, Prefix and\/or Suffix.<\/p><p>At first you will have limited Enchants, but as you enchant more gear, find better gear, and raise your enchanting level and intelligence, you will unlock more powerful and expensive enchants that turn the tide of battle.<\/p>","display_order":"2","content_image_path":"enchanting\/Ms857h6FYhYFd0PxSkwPdvyt1XZ4rQhe1tDHP4HR.png","live_wire_component":"null"},{"content":"<p>You can enchant any item that appears in your list, the items must live in your inventory. We will not be looking through sets for items to enchant.<\/p><p>If you enchant an item that has two enchantments (see image to the right or bottom for mobile) it will take 30 seconds, because we replace the enchants. If you enchant an item that has no enchants, its 10 seconds.<\/p><p>The cost does not increase for replacing enchantments with other enchantments.<\/p><p>There is no way to move enchantments unless you have unique items, then you can use the Queen of Hearts in Hell to move Unique and Mythic Enchants to other items. This is more end game though.<\/p><p>You will fail more than succeed at first, and it will cost you a pretty penny, but again, sort the enchanting list above by enchants that would help you achieve whatever goal it is you are attempting to achieve. Want to hit better, enchant with accuracy, want to cast damage spells better, use casting accuracy and int enchants to do even more damage.<\/p><p>Enchantments are how you build your character.<\/p>","display_order":"3","content_image_path":"enchanting\/WeKJQlapxZKWJWOSb34wC3ejm1OiFppsCvtruP4d.png","live_wire_component":"null"}],"created_at":"2022-06-07T16:26:27.000000Z","updated_at":"2022-06-07T16:33:36.000000Z"},{"id":18,"page_name":"gear-progression","page_sections":[{"content":"<p>Tlessa’s Gear progression is easy to follow, hard to master and costs you nothing to achieve the end game. There are no pay walls, no gate keeping other than your invested time. In place of money, I make you grind. It’s a fun grind though, promise!<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<h2>Tier 1 - Basics<\/h2><p>Shop Gear and drops from enemies in the early stages make up the first half of Tier 1.<\/p><p>Tier 1 ends with top end crafted gear with top end affixes, a full set of this will set you back a few hundred billion.<\/p><p>By the time you make it to Shadow Planes gold won’t be an issue for you.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":null},{"content":"<h2>Tier 2 – Uniques<\/h2><p>Players who play the game and kill enough creatures will incur what’s called Faction Points which in turn reward the player with a unique item every time they reach a new Faction level, which means you could get 25 of these.<\/p><p>Players who get them through Factions only get the entry level uniques. These can be attached to any item and can have one or two enchants. Players can only equip one.<\/p><p>The goal of Tier 2 is to get to Hell, engage with the Queen of Hearts and Purchase the 100 billion Gold Uniques. Which are the best enchantments in game minus Mythics.<\/p><p>You can then Re-roll and move these enchants to another piece of gear.<\/p><p>Tier 2 ends when you have, for example Top Tier Crafted Body with a Decent set of Unique Enchants that cost 100 billion on the item.<\/p>","display_order":"3","content_image_path":null,"live_wire_component":null},{"content":"<h2>Tier 3 – Holy Items<\/h2><p>Holy Items can only be crafted while in Purgatory at the Purgatory Smiths House. You need to do a quest line to access the house.<\/p><p>Players also need to have Alchemy leveled to at least level 60 to unlock Holy Oils. There are 5 levels of oils unlocked past level 60.<\/p><p>Players require these oils to apply what are called Holy Stacks to an item. Every item has a set list of Holy Stacks that can be applied. The stacks are randomly applied between ranges for different levels.<\/p><p>Players have completed Tier 3 when they have a full set of items all with maxed out Holy Stacks.<\/p><p>You can even apply holy stacks to the Unique.<\/p>","display_order":"4","content_image_path":null,"live_wire_component":null},{"content":"<h2>Tier 4 – Trinkets<\/h2><p>Since you are in Purgatory for Phase three, farm Copper coins to be able to use Trinketry. Players can create two trinkets; you will want top tier ones to give you 95% Ambush\/Counter Chance\/Resistance.<\/p><p>You cannot apply Holy or Affixes or move Uniques to these items.<\/p>","display_order":"5","content_image_path":null,"live_wire_component":null},{"content":"<h2>Tier 5 – Mythic – Replaces 100 billion Unique.<\/h2><p>There are only two ways to get this:<\/p><p>Through PVP, where you need to roll higher then 999,995 with a 1-1,000,000 roll.<\/p><p>Through Fighting the Celestial King who spawns once a week after the Gates close for the Celestial Events on Wednesday’s at 1pm GMT-6 and the gates close 24 hours later. When they do the King will spawn on surface. Slay him for the same chance but you get to apply a max of 10% of looting skill bonus towards the roll.<\/p><p>These are orange, always come with two affixes, can be moved to other items, and can have holy stacks applied.<\/p><p>These are better then 100 billion Gold Uniques. They share the same names as Uniques in terms of enchant names but have the best stats.<\/p><p>A level 301 Character who slays another character and is lucky enough to get one these, is a mini god. The true power unleashes when they are higher level.<\/p>","display_order":"6","content_image_path":null,"live_wire_component":null},{"content":"<p>Each tier of gear helps the player to progress their character, get stronger, do better in special locations, other planes, pvp and fighting celestials.<\/p><p>This is a marathon, not a race. It takes a lot of quests, time, dedication, patience, luck on the RNG and investment to get a character with top tier gear.<\/p>","display_order":"7","content_image_path":null,"live_wire_component":null}],"created_at":"2022-06-09T02:27:16.000000Z","updated_at":"2022-06-09T02:27:17.000000Z"},{"id":19,"page_name":"the-guide","page_sections":[{"content":"<p>The Guide is designed to help new players learn the ropes of the game. We give you explicit instructions on how to complete the quest, as well as some story. Each quest is designed to introduce you to various features, from killing and shops, skills, crafting, enchanting and so on.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<h2>Accessing The Guide<\/h2><p>When you register you have an option to enable the guide. If you did not do this, you can head to your settings and enable the guide from there, assuming you’re under level 10.<\/p><p>If you enabled during registration, you will see a popup once the game loads, we only show you this popup once. You can access the guide quests by clicking Guide Quests in the top nav. See image to the right or below for mobile.<\/p>","display_order":"2","content_image_path":"the-guide\/W87AY0LcYGu6kUTVDhOIF4CGNmp84h1Arc78mjaf.png","live_wire_component":null},{"content":"<h2>Viewing the past<\/h2><p>You can view previously complete Guide quests by opening your side bar (hamburger menu at the top left beside the game name).<\/p><p>Here, in the image to the right or bottom for mobile, is an additional option under quests called Completed Guide Quests. Clicking this shows you a table of your quests. You can further click on the quest name to see the story, instructions, and requirements.<\/p><p>The instructions might be useful if you need a refresher.<\/p>","display_order":"4","content_image_path":"the-guide\/XEwMMIBsDM6uTLp5UKs01JeCJLLhpFCbdHT2u7jw.png","live_wire_component":null},{"content":"<h2>Completing the quests<\/h2><p>When you open this modal, see to the right or bottom for mobile, you are shown the requirements in orange at the top, story under that and a tab called instructions which contains the quests instructions spelled out for you.<\/p><p>The hand in button will only be available once you have met the requirements of the quest.<\/p>","display_order":"3","content_image_path":"the-guide\/QkwMKKs8D0rNEkmkP7whp0jfFgLHGB8HhzF0xzlV.png","live_wire_component":null}],"created_at":"2022-06-10T20:21:11.000000Z","updated_at":"2022-06-10T20:21:11.000000Z"},{"id":21,"page_name":"monthly-pvp-event","page_sections":[{"content":"<h2>6:30 GMT-6 – FIGHT!<\/h2><p>At 6:30 GMT-6, there is a 15-minute window for you to get ready. You MUST be logged in to participate, registering will not guarantee you a spot, only being logged in during the event, are you able to participate.<\/p><p>After the 15-minute timer is done, you will be teleported to the Arena which is a new location that players cannot enter.<\/p><p>Your screen will refresh so that all dialogues and so on are closed. You will be told when you are being moved and of the 15-minute window you have left to prepare.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":null},{"content":"<p>Tlessa offers players a way to test their strength against another player, or in this case set of players, through the Monthly Pvp Event<\/p><p>Every month, at the end of the month, a new button will appear in your actions section. This is completely optional, and you do not have to participate.<\/p><p>Those who do get a prize for losing and the winner gets a mythical prize.<\/p><p>To join click the Join Pvp Button (see image to the right, bottom for mobile), select the attack style and click join.<\/p><p>Between 8am GMT-6 and 6:30 GMT-6 you will have the option to join and change your attack type.<\/p>","display_order":"1","content_image_path":"monthly-pvp-event\/b7vwM58ctNq6k7e8ZiXTagarKDHJBUFT01UHL1uy.png","live_wire_component":null},{"content":"<h2>After the Event<\/h2><p>Once the event the last player standing gets fifty-billion gold and a Mythic Unique. A global message goes out congratulating that player.<\/p><p>After which 4 Celestial Kings: Surface, Labyrinth, Dungeons and Shadow Planes will spawn. This is first killed first serve concept, like other Celestials.<\/p><p>These kings are balanced for their planes and are the strongest of their plane for Celestials.<\/p><p>Players who manage to kill one have a chance to get a Mythic Unique, the roll is the same as for killing a player, how ever you get to apply a max of 15% of your looting skill towards the chance.<\/p><p>Celestial kings cannot be conjured and cannot spawn when celestials spawn weekly.<\/p>","display_order":"4","content_image_path":"monthly-pvp-event\/AxX8GlxMDw57FjjlkNQk2H6xbOr8WWIMHziaj0nA.png","live_wire_component":null},{"content":"<h2>After the Move<\/h2><p>After you are moved, you are set into a “automation” state. Much like exploration you cannot do a lot of things, but unlike exploration, you cannot move.<\/p><p>There is a 2-minute window before the fights begin, this next stage is all automated. If you lose, you are moved to a safe location with the PVP flag attached so you cannot be targeted.<\/p><p>You will be rewarded with two billion gold for participating.<\/p><p>If you win, you roll between 1-1,000,000 and must get higher than a 999,995 to gain a mythic.<\/p><p>You are then thrown back into the pool for the next fight. All fights are ordered by lowest level to highest<\/p><p>As you can see to the right (or below for mobile) your pvp section will update upon your turn when the fight between you and whomever is finished. In this case the person lost.<\/p>","display_order":"3","content_image_path":"monthly-pvp-event\/fsOOpnJi2VnFwIyooNpVe8BA9t5D8zjNT5ErLdZX.png","live_wire_component":null}],"created_at":"2022-06-16T03:10:26.000000Z","updated_at":"2022-06-16T03:10:26.000000Z"},{"id":22,"page_name":"automation","page_sections":[{"content":"<p>Automation<\/p><p>Automation in Tlessa comes in a couple forms:<\/p><ul><li><a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a><\/li><li>Pvp Monthly Automation<\/li><\/ul><p>When characters are in either form of automation, they cannot manage their inventory such as equipping items or sets. They cannot manage their skills or passives.<\/p><p>You can read more about exploration and how to engage with that here. Players will find as they are leveling skills, exploration will become essential.<\/p><p>Because of how loot works, in the sense that it is completely random and levels with your character to a point per plane – exploration is one of the best ways to get loot aside from manually fighting.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<p><strong>Pvp Automation<\/strong> however is slightly different. Those who choose to participate in <a href=\"\/information\/monthly-pvp-event\" rel=\"noopener noreferrer\" target=\"_blank\">monthly pvp event<\/a>, will find themselves, after they are automatically moved to the arena, locked out not just being able to attack, but also move.<\/p><p><a href=\"\/information\/exploration\" rel=\"noopener noreferrer\" target=\"_blank\">Exploration<\/a> does not stop you from moving, you just cannot traverse or wage war or settle new kingdoms.<\/p><p>Pvp Automation does prevent you from moving.<\/p>","display_order":"2","content_image_path":null,"live_wire_component":null}],"created_at":"2022-06-17T16:08:08.000000Z","updated_at":"2022-06-17T16:08:08.000000Z"},{"id":23,"page_name":"disenchanting","page_sections":[{"content":"<p>Disenchanting can be done in a verity of ways and will level your enchanting skill by half per successful disenchant.<\/p><p>Disenchanting also gets you a currency: Gold Dust, which is used in a verity of aspects from conjuring celestials to quests, gear upgrades and more.<\/p><p>Disenchanting can be done from the Item Comparison window when an item drops from a monster, the character sheet tab in the inventory, or through a setting on the character settings page to auto disenchant drops.<\/p><p>New players are not encouraged to enable auto disenchant until they get off Surface.<\/p>","display_order":"1","content_image_path":null,"live_wire_component":null},{"content":"<h2>How to disenchant.<\/h2><p>For this example, we are going to go through the character sheet, inventory section. For mobile players, click the character sheet tab, select Inventory Management from the drop down to follow along.<\/p><p>As you can see (to the right or bottom for mobile) I have some enchanted items. If you are unfamiliar with enchanting, check out the enchanting docs.<\/p>","display_order":"2","content_image_path":"disenchanting\/euyUUrVoK0s2jnWQnwjDHB6iOP204fWwICnPqFLe.png","live_wire_component":null},{"content":"<p>Or I can do this by disenchanting all the enchanted items. Careful, if you have unique items, move them first to a set to “stash them”. You can also read about Inventory Management and Set Management.<\/p>","display_order":"4","content_image_path":"disenchanting\/N956OaSuxs5o3tVGj9qrv3gKJxUAqftcCiJZHSoO.png","live_wire_component":null},{"content":"<p>I can do this one by one, by clicking on the item name itself in the table.<\/p>","display_order":"3","content_image_path":"disenchanting\/Upf8xhEy5UMtJKveXibxw2gTRTowHFUX5wXeTyz3.png","live_wire_component":null},{"content":"<p>In this case I chose to disenchant all the items, now you can see in the Server Message Tab that not only did I fail, I also disenchanted some items and even gained a skill level in enchanting, plus – to top it all off - managed to get some Gold Dust!<\/p>","display_order":"5","content_image_path":"disenchanting\/cYgXT3oiF9tVxCxTEekrYVjTj2Y6Iq8Q4XLOBR2v.png","live_wire_component":null}],"created_at":"2022-06-17T16:24:57.000000Z","updated_at":"2022-06-17T16:24:57.000000Z"},{"id":24,"page_name":"alchemy","page_sections":[{"content":"<p>Alchemy<\/p><p>Alchemy is a skill that can only be unlocked after you do the Quest: I Dream of Alchemy.<\/p><p><a href=\"\/information\/quests\" rel=\"noopener noreferrer\" target=\"_blank\">To learn more about quests, click here<\/a>.<\/p><p>Once this quest is complete you will have a new option, under Crafting\/Enchanting called Alchemy. See the image to the right or below for mobile.<\/p><p>For Mobile Players, you will select Craft from your actions drop down then follow the same steps as listed below.<\/p><p>Alchemy Items have three types:<\/p><ul><li>Items you can use on yourself to create what are called boons.<\/li><li>Items you can use on other player kingdoms to do devastating damage.<\/li><li>Items you can use on other items to add various levels of holy stacks to an item.<\/li><\/ul>","display_order":"1","content_image_path":"alchemy\/WicyX4pQVuKsddD7El2ZUmPHYVzpy45LvrgJyas7.png","live_wire_component":"info.alchemy-items.alchemy-items-table"},{"content":"<p>All alchemy items cost <a href=\"\/information\/currencies\" rel=\"noopener noreferrer\" target=\"_blank\">Gold Dust<\/a> and Shards.<\/p><p>Gold Dust you can get from disenchanting, while shards you get from fighting <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">Celestials<\/a>, which can be conjured privately for Shard farming.<\/p>","display_order":"3","content_image_path":"alchemy\/JCdZAKVHAEKqgno2z4HTURCb3EMIhLD8UWjgcvUu.png","live_wire_component":"null"},{"content":"<p>In this case, you can see (to the right or bottom for mobile) that I crafted a Bland Potion. Clicking this link in chat lets you see the item details, but you must go to your inventory to apply the item to yourself.<\/p>","display_order":"2","content_image_path":"alchemy\/iKMbyoavI8YiXhvQNhCfgcEZrblj7o16vXkSCH1O.png","live_wire_component":"null"},{"content":"<p>That’s all there is to Alchemy. A final note is:<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Items that can be used on kingdom can only be used when you are physically standing on an enemies or NPC kingdom.<\/p><p>-&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Items that can be used on other items, such as level 60+ Holy Oils, can only be used in Purgatory as the Work Bench.<\/p>","display_order":"5","content_image_path":"alchemy\/xnbChrj8PYavJXAkhtj5bqihOFRq8R2buPSksTwJ.png","live_wire_component":"null"},{"content":"<p>Let’s use one of these items, for this example select Use Options on your Bland Potion and select use item. Now you should see this modal open (to the right or bottom for mobile)<\/p><p>Click use item.<\/p>","display_order":"9","content_image_path":null,"live_wire_component":"null"},{"content":"<p>For mobile players, click Character Sheet tab, select Inventory management to follow along.<\/p><p>From here, select the Type drop down and select Usable, as shown in the image (to the right or bottom for mobile)<\/p>","display_order":"4","content_image_path":"alchemy\/mwELaZMXU3DPUI8ItuOqEGjsu40Zuoah41Hm1KwR.png","live_wire_component":"null"},{"content":"<p>Now you can see we have some Alchemy items. You can use the Action Drop down at the top or the Use Options Drop down to use the items. For the top Actions drop down you can use many items (up to a max of ten boons – items, can be applied).<\/p><p>For the individual options you can list Alchemical items to the market board for other players to use or use them individually. You cannot sell these to the shop but can list or destroy them.<\/p>","display_order":"8","content_image_path":"alchemy\/RFDoOggR5C9wEf5Cz0SKsi8ezwLHBrUXwXeVu6xi.png","live_wire_component":"null"},{"content":"<p>Clicking this link in chat lets you see the item details, but you must go to your inventory to apply the item to yourself.<\/p>","display_order":"6","content_image_path":"alchemy\/v1KDfvgAyaAjuYjDTab1s2sqnw3iwKxfTyDrUckZ.png","live_wire_component":"null"},{"content":"<p>Now, on the same page (if you on mobile, expand the top section of the character sheet to follow along) click the Active Boons Tab.<\/p><p>Here, (image to the right, bottom for mobile) you can see a list of boons applied to you, this table does not update in real time, but the server messages will tell you when a boon has worn off.<\/p>","display_order":"7","content_image_path":"alchemy\/HlRX2wl4RtijroW7sePJkE0umhWpgLu2dGY0aTU6.png","live_wire_component":"null"}],"created_at":"2022-06-17T17:30:09.000000Z","updated_at":"2022-06-17T17:47:18.000000Z"},{"id":25,"page_name":"currencies","page_sections":[{"content":"<p>There are a couple of currencies that you can get in Tlessa, all of them are listed in your top section on the game tab.<\/p><p>You can see the image to the right, bottom for mobile. For mobile players you will need to expand your top section to see the same details.<\/p><p>As you can see, we have:<\/p><ul><li>Gold (You can have a max of 2 Trillion)<\/li><li>&nbsp;Gold Dust (You can have a max of 2 Billion)<\/li><li>&nbsp;Crystal Shards (You can have a max of 2 Billion)<\/li><li>Copper Coins (You can have a max of 1 Million)<\/li><\/ul><p><strong>Gold<\/strong>, you earn through killing creatures. This is easy to get. Kingdoms can hold more gold through the treasury, which is capped at 2 Billion or the Goblin Coin Bank, which allows you to purchase 1000 Gold Bars for 2 Billion Gold Each.<\/p><p><strong>Gold Dust,<\/strong> you get through <a href=\"\/information\/disenchanting\" rel=\"noopener noreferrer\" target=\"_blank\">Disenchanting<\/a> items, this also helps to level <a href=\"\/information\/enchanting\" rel=\"noopener noreferrer\" target=\"_blank\">enchanting<\/a>. Gold dust is used in <a href=\"\/information\/alchemy\" rel=\"noopener noreferrer\" target=\"_blank\">Alchemy<\/a> to create items as well as with the Queen of hearts to move enchantments and re roll unique items.<\/p><p><strong>Crystal shards<\/strong> are only obtained by killing <a href=\"\/information\/celestials\" rel=\"noopener noreferrer\" target=\"_blank\">celestial<\/a> entities. The further down the planes you go the more shards they drop. These are also used the same way as Gold Dust.<\/p><p><strong>Copper Coins<\/strong> are only obtained by killing any creature in Purgatory. You need these to craft Trinkets which give your character Ambush and Counter Resistance\/Chance.<\/p><p>Some quests require these currencies, specifically Gold Dust.<\/p>","display_order":"1","content_image_path":"currencies\/M6fEl4dQHhVNVUh95qgc78bde0cU96DcX1b6FabL.png","live_wire_component":"null"}],"created_at":"2022-06-17T17:49:01.000000Z","updated_at":"2022-06-17T17:51:56.000000Z"}]